[[{"p":1,"t":"The Proverbs of Solomon son of David, king of Israel:"},{"p":2,"t":"To learn wisdom and moral instruction, and to discern wise counsel."},{"p":3,"t":"To receive moral instruction in skillful living, in righteousness, justice, and equity."},{"p":4,"t":"To impart shrewdness to the morally naive, and a discerning plan to the young person."},{"p":5,"t":"(Let the wise also hear and gain instruction, and let the discerning acquire guidance!)"},{"p":6,"t":"To discern the meaning of a proverb and a parable, the sayings of the wise and their riddles."},{"p":7,"t":"Fearing the Lord is the beginning of moral knowledge, but fools despise wisdom and instruction."},{"p":8,"t":"Listen, my child, to the instruction from your father, and do not forsake the teaching from your mother."},{"p":9,"t":"For they will be like an elegant garland on your head, and like pendants around your neck."},{"p":10,"t":"My child, if sinners try to entice you, do not consent!"},{"p":11,"t":"If they say, “Come with us! We will lie in wait to shed blood; we will ambush an innocent person capriciously."},{"p":12,"t":"We will swallow them alive like Sheol, those full of vigor like those going down to the Pit."},{"p":13,"t":"We will seize all kinds of precious wealth; we will fill our houses with plunder."},{"p":14,"t":"Join with us! We will all share equally in what we steal.”"},{"p":15,"t":"My child, do not go down their way, withhold yourself from their path;"},{"p":16,"t":"for they are eager to inflict harm, and they hasten to shed blood."},{"p":17,"t":"Surely it is futile to spread a net in plain sight of any bird,"},{"p":18,"t":"but these men lie in wait for their own blood, they ambush their own lives!"},{"p":19,"t":"Such are the ways of all who gain profit unjustly; it takes away the life of those who obtain it!"},{"p":20,"t":"Wisdom calls out in the street, she shouts loudly in the plazas;"},{"p":21,"t":"at the head of the noisy streets she calls, in the entrances of the gates in the city she utters her words:"},{"p":22,"t":"“How long will you simpletons love naiveté How long will mockers delight in mockery and fools hate knowledge?"},{"p":23,"t":"If only you will respond to my rebuke, then I will pour out my thoughts to you and I will make my words known to you."},{"p":24,"t":"However, because I called but you refused to listen, because I stretched out my hand but no one paid attention,"},{"p":25,"t":"because you neglected all my advice, and did not comply with my rebuke,"},{"p":26,"t":"so I myself will laugh when disaster strikes you, I will mock when what you dread comes,"},{"p":27,"t":"when what you dread comes like a whirlwind, and disaster strikes you like a devastating storm, when distressing trouble comes on you."},{"p":28,"t":"Then they will call to me, but I will not answer; they will diligently seek me, but they will not find me."},{"p":29,"t":"Because they hated moral knowledge, and did not choose to fear the Lord,"},{"p":30,"t":"they did not comply with my advice, they spurned all my rebuke."},{"p":31,"t":"Therefore they will eat from the fruit of their way, and they will be stuffed full of their own counsel."},{"p":32,"t":"For the waywardness of the simpletons will kill them, and the careless ease of fools will destroy them."},{"p":33,"t":"But the one who listens to me will live in security, and will be at ease from the dread of harm."}],[{"p":1,"t":"My child, if you receive my words, and store up my commands within you,"},{"p":2,"t":"by making your ear attentive to wisdom, and by turning your heart to understanding,"},{"p":3,"t":"indeed, if you call out for discernment &#8211; raise your voice for understanding &#8211;"},{"p":4,"t":"if you seek it like silver, and search for it like hidden treasure,"},{"p":5,"t":"then you will understand how to fear the Lord, and you will discover knowledge about God."},{"p":6,"t":"For the Lord gives wisdom, and from his mouth comes knowledge and understanding."},{"p":7,"t":"He stores up effective counsel for the upright, and is like a shield for those who live with integrity,"},{"p":8,"t":"to guard the paths of the righteous and to protect the way of his pious ones."},{"p":9,"t":"Then you will understand righteousness and justice and equity &#8211; every good way."},{"p":10,"t":"For wisdom will enter your heart, and moral knowledge will be attractive to you."},{"p":11,"t":"Discretion will protect you, understanding will guard you,"},{"p":12,"t":"to deliver you from the way of the wicked, from those speaking perversity,"},{"p":13,"t":"who leave the upright paths to walk on the dark ways,"},{"p":14,"t":"who delight in doing evil, they rejoice in perverse evil;"},{"p":15,"t":"whose paths are morally crooked, and who are devious in their ways;"},{"p":16,"t":"to deliver you from the adulteress, from the sexually loose woman who speaks flattering words;"},{"p":17,"t":"who leaves the husband from her younger days, and forgets her marriage covenant made before God."},{"p":18,"t":"For her house sinks down to death, and her paths lead to the place of the departed spirits."},{"p":19,"t":"None who go in to her will return, nor will they reach the paths of life."},{"p":20,"t":"So you will walk in the way of good people, and will keep on the paths of the righteous."},{"p":21,"t":"For the upright will reside in the land, and those with integrity will remain in it,"},{"p":22,"t":"but the wicked will be removed from the land, and the treacherous will be torn away from it."}],[{"p":1,"t":"My child, do not forget my teaching, but let your heart keep my commandments,"},{"p":2,"t":"for they will provide a long and full life, and they will add well-being to you."},{"p":3,"t":"Do not let truth and mercy leave you; bind them around your neck, write them on the tablet of your heart."},{"p":4,"t":"Then you will find favor and good understanding, in the sight of God and people."},{"p":5,"t":"Trust in the Lord with all your heart, and do not rely on your own understanding."},{"p":6,"t":"Acknowledge him in all your ways,  and he will make your paths straight."},{"p":7,"t":"Do not be wise in your own estimation; fear the Lord and turn away from evil."},{"p":8,"t":"This will bring healing to your body, and refreshment to your inner self."},{"p":9,"t":"Honor the Lord from your wealth and from the first fruits of all your crops;"},{"p":10,"t":"then your barns will be filled completely, and your vats will overflow with new wine."},{"p":11,"t":"My child, do not despise discipline from the Lord, and do not loathe his rebuke."},{"p":12,"t":"For the Lord disciplines those he loves, just as a father disciplines the son in whom he delights."},{"p":13,"t":"Blessed is the one who finds wisdom, and the one who obtains understanding."},{"p":14,"t":"For her benefit is more profitable than silver, and her gain is better than gold."},{"p":15,"t":"She is more precious than rubies, and none of the things you desire can compare with her."},{"p":16,"t":"Long life is in her right hand; in her left hand are riches and honor."},{"p":17,"t":"Her ways are very pleasant, and all her paths are peaceful."},{"p":18,"t":"She is like a tree of life to those who obtain her, and everyone who grasps hold of her will be blessed."},{"p":19,"t":"By wisdom the Lord laid the foundation of the earth; he established the heavens by understanding."},{"p":20,"t":"By his knowledge the primordial sea was broken open, and the clouds drip down dew."},{"p":21,"t":"My child, do not let them escape from your sight; safeguard sound wisdom and discretion."},{"p":22,"t":"So they will give life to you, and grace to adorn your neck."},{"p":23,"t":"Then you will walk on your way with security, and you will not stumble."},{"p":24,"t":"When you lie down you will not be filled with fear; when you lie down your sleep will be pleasant."},{"p":25,"t":"You will not be afraid of sudden disaster, or when destruction overtakes the wicked;"},{"p":26,"t":"for the Lord will be the source of your confidence, and he will guard your foot from being caught in a trap."},{"p":27,"t":"Do not withhold good from those who need it, when you have the ability to help."},{"p":28,"t":"Do not say to your neighbor, “Go! Return tomorrow and I will give it,” when you have it with you at the time."},{"p":29,"t":"Do not plot evil against your neighbor when he dwells by you unsuspectingly."},{"p":30,"t":"Do not accuse anyone without legitimate cause, if he has not treated you wrongly."},{"p":31,"t":"Do not envy a violent man, and do not choose to imitate any of his ways;"},{"p":32,"t":"for one who goes astray is an abomination to the Lord, but he reveals his intimate counsel to the upright."},{"p":33,"t":"The Lord’s curse is on the household of the wicked, but he blesses the home of the righteous."},{"p":34,"t":"Although he is scornful to arrogant scoffers, yet he shows favor to the humble."},{"p":35,"t":"The wise inherit honor, but he holds fools up to public contempt."}],[{"p":1,"t":"Listen, children, to a father’s instruction, and pay attention so that you may gain discernment."},{"p":2,"t":"Because I give you good instruction, do not forsake my teaching."},{"p":3,"t":"When I was a son to my father, a tender only child before my mother,"},{"p":4,"t":"he taught me, and he said to me: “Let your heart lay hold of my words; keep my commands so that you will live."},{"p":5,"t":"Acquire wisdom, acquire understanding; do not forget and do not turn aside from the words I speak."},{"p":6,"t":"Do not forsake wisdom, and she will protect you; love her, and she will guard you."},{"p":7,"t":"Wisdom is supreme &#8211; so acquire wisdom, and whatever you acquire, acquire understanding!"},{"p":8,"t":"Esteem her highly and she will exalt you; she will honor you if you embrace her."},{"p":9,"t":"She will place a fair garland on your head; she will bestow a beautiful crown on you.”"},{"p":10,"t":"Listen, my child, and accept my words, so that the years of your life will be many."},{"p":11,"t":"I will guide you in the way of wisdom and I will lead you in upright paths."},{"p":12,"t":"When you walk, your steps will not be hampered, and when you run, you will not stumble."},{"p":13,"t":"Hold on to instruction, do not let it go; protect it, because it is your life."},{"p":14,"t":"Do not enter the path of the wicked or walk in the way of those who are evil."},{"p":15,"t":"Avoid it, do not go on it; turn away from it, and go on."},{"p":16,"t":"For they cannot sleep unless they cause harm; they are robbed of sleep until they make someone stumble."},{"p":17,"t":"For they eat bread gained from wickedness and drink wine obtained from violence."},{"p":18,"t":"But the path of the righteous is like the bright morning light, growing brighter and brighter until full day."},{"p":19,"t":"The way of the wicked is like gloomy darkness; they do not know what causes them to stumble."},{"p":20,"t":"My child, pay attention to my words; listen attentively to my sayings."},{"p":21,"t":"Do not let them depart from your sight, guard them within your heart;"},{"p":22,"t":"for they are life to those who find them and healing to one’s entire body."},{"p":23,"t":"Guard your heart with all vigilance, for from it are the sources of life."},{"p":24,"t":"Remove perverse speech from your mouth; keep devious talk far from your lips."},{"p":25,"t":"Let your eyes look directly in front of you and let your gaze look straight before you."},{"p":26,"t":"Make the path for your feet level, so that all your ways may be established."},{"p":27,"t":"Do not turn to the right or to the left; turn yourself away from evil."}],[{"p":1,"t":"My child, be attentive to my wisdom, pay close attention to my understanding,"},{"p":2,"t":"in order to safeguard discretion, and that your lips may guard knowledge."},{"p":3,"t":"For the lips of the adulterous woman drip honey, and her seductive words are smoother than olive oil,"},{"p":4,"t":"but in the end she is bitter as wormwood, sharp as a two-edged sword."},{"p":5,"t":"Her feet go down to death; her steps lead straight to the grave."},{"p":6,"t":"Lest she should make level the path leading to life, her paths are unstable but she does not know it."},{"p":7,"t":"So now, children, listen to me; do not turn aside from the words I speak."},{"p":8,"t":"Keep yourself far from her, and do not go near the door of her house,"},{"p":9,"t":"lest you give your vigor to others and your years to a cruel person,"},{"p":10,"t":"lest strangers devour your strength, and your labor benefit another man’s house."},{"p":11,"t":"And at the end of your life you will groan when your flesh and your body are wasted away."},{"p":12,"t":"And you will say, “How I hated discipline! My heart spurned reproof!"},{"p":13,"t":"For I did not obey my teachers and I did not heed my instructors."},{"p":14,"t":"I almost came to complete ruin in the midst of the whole congregation!”"},{"p":15,"t":"Drink water from your own cistern and running water from your own well."},{"p":16,"t":"Should your springs be dispersed outside, your streams of water in the wide plazas?"},{"p":17,"t":"Let them be for yourself alone, and not for strangers with you."},{"p":18,"t":"May your fountain be blessed, and may you rejoice in your young wife &#8211;"},{"p":19,"t":"a loving doe, a graceful deer; may her breasts satisfy you at all times, may you be captivated by her love always."},{"p":20,"t":"But why should you be captivated, my son, by an adulteress, and embrace the bosom of a different woman?"},{"p":21,"t":"For the ways of a person are in front of the Lord’s eyes, and the Lord weighs all that person’s paths."},{"p":22,"t":"The wicked will be captured by his own iniquities, and he will be held by the cords of his own sin."},{"p":23,"t":"He will die because there was no discipline; because of the greatness of his folly he will reel."}],[{"p":1,"t":"My child, if you have made a pledge for your neighbor, and have become a guarantor for a stranger,"},{"p":2,"t":"if you have been ensnared by the words you have uttered, and have been caught by the words you have spoken,"},{"p":3,"t":"then, my child, do this in order to deliver yourself, because you have fallen into your neighbor’s power: go, humble yourself, and appeal firmly to your neighbor."},{"p":4,"t":"Permit no sleep to your eyes or slumber to your eyelids."},{"p":5,"t":"Deliver yourself like a gazelle from a snare, and like a bird from the trap of the fowler."},{"p":6,"t":"Go to the ant, you sluggard; observe its ways and be wise!"},{"p":7,"t":"It has no commander, overseer, or ruler,"},{"p":8,"t":"yet it prepares its food in the summer; it gathers at the harvest what it will eat."},{"p":9,"t":"How long, you sluggard, will you lie there? When will you rise from your sleep?"},{"p":10,"t":"A little sleep, a little slumber, a little folding of the hands to relax,"},{"p":11,"t":"and your poverty will come like a robber, and your need like an armed man."},{"p":12,"t":"A worthless and wicked person walks around saying perverse things;"},{"p":13,"t":"he winks with his eyes, signals with his feet, and points with his fingers;"},{"p":14,"t":"he plots evil with perverse thoughts in his heart, he spreads contention at all times."},{"p":15,"t":"Therefore, his disaster will come suddenly; in an instant he will be broken, and there will be no remedy."},{"p":16,"t":"There are six things that the Lord hates, even seven things that are an abomination to him:"},{"p":17,"t":"haughty eyes, a lying tongue, and hands that shed innocent blood,"},{"p":18,"t":"a heart that devises wicked plans, feet that are swift to run to evil,"},{"p":19,"t":"a false witness who pours out lies, and a person who spreads discord among family members."},{"p":20,"t":"My child, guard the commands of your father and do not forsake the instruction of your mother."},{"p":21,"t":"Bind them on your heart continually; fasten them around your neck."},{"p":22,"t":"When you walk about, they will guide you; when you lie down, they will watch over you; when you wake up, they will talk to you."},{"p":23,"t":"For the commandments are like a lamp, instruction is like a light, and rebukes of discipline are like the road leading to life,"},{"p":24,"t":"by keeping you from the evil woman, from the smooth tongue of the loose woman."},{"p":25,"t":"Do not lust in your heart for her beauty, and do not let her captivate you with her alluring eyes;"},{"p":26,"t":"for on account of a prostitute one is brought down to a loaf of bread, but the wife of another man preys on your precious life."},{"p":27,"t":"Can a man hold fire against his chest without burning his clothes?"},{"p":28,"t":"Can a man walk on hot coals without scorching his feet?"},{"p":29,"t":"So it is with the one who has sex with his neighbor’s wife; no one who touches her will escape punishment."},{"p":30,"t":"People do not despise a thief when he steals to fulfill his need when he is hungry."},{"p":31,"t":"Yet if he is caught he must repay seven times over, he might even have to give all the wealth of his house."},{"p":32,"t":"A man who commits adultery with a woman lacks wisdom, whoever does it destroys his own life."},{"p":33,"t":"He will be beaten and despised, and his reproach will not be wiped away;"},{"p":34,"t":"for jealousy kindles a husband’s rage, and he will not show mercy when he takes revenge."},{"p":35,"t":"He will not consider any compensation; he will not be willing, even if you multiply the compensation."}],[{"p":1,"t":"My child, keep my words and treasure up my commands in your own keeping."},{"p":2,"t":"Keep my commands so that you may live, and obey my instruction as your most prized possession."},{"p":3,"t":"Bind them on your forearm; write them on the tablet of your heart."},{"p":4,"t":"Say to wisdom, “You are my sister,” and call understanding a close relative,"},{"p":5,"t":"so that they may keep you from the adulterous woman, from the loose woman who flatters you with her words."},{"p":6,"t":"For at the window of my house through my window lattice I looked out"},{"p":7,"t":"and I saw among the naive &#8211; I discerned among the youths &#8211; a young man who lacked wisdom."},{"p":8,"t":"He was passing by the street near her corner, making his way along the road to her house"},{"p":9,"t":"in the twilight, the evening, in the dark of the night."},{"p":10,"t":"Suddenly a woman came out to meet him! She was dressed like a prostitute and with secret intent."},{"p":11,"t":"(She is loud and rebellious, she does not remain at home &#8211;"},{"p":12,"t":"at one time outside, at another in the wide plazas, and by every corner she lies in wait.)"},{"p":13,"t":"So she grabbed him and kissed him, and with a bold expression she said to him,"},{"p":14,"t":"“I have fresh meat at home; today I have fulfilled my vows!"},{"p":15,"t":"That is why I came out to meet you, to look for you, and I found you!"},{"p":16,"t":"I have spread my bed with elegant coverings, with richly colored fabric from Egypt."},{"p":17,"t":"I have perfumed my bed with myrrh, aloes, and cinnamon."},{"p":18,"t":"Come, let’s drink deeply of lovemaking until morning, let’s delight ourselves with sexual intercourse."},{"p":19,"t":"For my husband is not at home; he has gone on a journey of some distance."},{"p":20,"t":"He has taken a bag of money with him; he will not return until the end of the month.”"},{"p":21,"t":"She persuaded him with persuasive words; with her smooth talk she compelled him."},{"p":22,"t":"Suddenly he went after her like an ox that goes to the slaughter, like a stag prancing into a trapper’s snare"},{"p":23,"t":"till an arrow pierces his liver &#8211; like a bird hurrying into a trap, and he does not know that it will cost him his life."},{"p":24,"t":"So now, sons, listen to me, and pay attention to the words I speak."},{"p":25,"t":"Do not let your heart turn aside to her ways &#8211; do not wander into her pathways;"},{"p":26,"t":"for she has brought down many fatally wounded, and all those she has slain are many."},{"p":27,"t":"Her house is the way to the grave, going down to the chambers of death."}],[{"p":1,"t":"Does not wisdom call out? Does not understanding raise her voice?"},{"p":2,"t":"At the top of the elevated places along the way, at the intersection of the paths she takes her stand;"},{"p":3,"t":"beside the gates opening into the city, at the entrance of the doorways she cries out:"},{"p":4,"t":"“To you, O people, I call out, and my voice calls to all mankind."},{"p":5,"t":"You who are naive, discern wisdom! And you fools, understand discernment!"},{"p":6,"t":"Listen, for I will speak excellent things, and my lips will utter what is right."},{"p":7,"t":"For my mouth speaks truth, and my lips hate wickedness."},{"p":8,"t":"All the words of my mouth are righteous; there is nothing in them twisted or crooked."},{"p":9,"t":"All of them are clear to the discerning and upright to those who find knowledge."},{"p":10,"t":"Receive my instruction rather than silver, and knowledge rather than choice gold."},{"p":11,"t":"For wisdom is better than rubies, and desirable things cannot be compared to her."},{"p":12,"t":"“I, wisdom, live with prudence, and I find knowledge and discretion."},{"p":13,"t":"The fear of the Lord is to hate evil; I hate arrogant pride and the evil way and perverse utterances."},{"p":14,"t":"Counsel and sound wisdom belong to me; I possess understanding and might."},{"p":15,"t":"Kings reign by means of me, and potentates decree righteousness;"},{"p":16,"t":"by me princes rule, as well as nobles and all righteous judges."},{"p":17,"t":"I love those who love me, and those who seek me find me."},{"p":18,"t":"Riches and honor are with me, long-lasting wealth and righteousness."},{"p":19,"t":"My fruit is better than the purest gold, and what I produce is better than choice silver."},{"p":20,"t":"I walk in the path of righteousness, in the pathway of justice,"},{"p":21,"t":"that I may cause those who love me to inherit wealth, and that I may fill their treasuries."},{"p":22,"t":"The Lord created me as the beginning of his works, before his deeds of long ago."},{"p":23,"t":"From eternity I was appointed, from the beginning, from before the world existed."},{"p":24,"t":"When there were no deep oceans I was born, when there were no springs overflowing with water;"},{"p":25,"t":"before the mountains were set in place &#8211; before the hills &#8211; I was born,"},{"p":26,"t":"before he made the earth and its fields, or the beginning of the dust of the world."},{"p":27,"t":"When he established the heavens, I was there; when he marked out the horizon over the face of the deep,"},{"p":28,"t":"when he established the clouds above, when the fountains of the deep grew strong,"},{"p":29,"t":"when he gave the sea his decree that the waters should not pass over his command, when he marked out the foundations of the earth,"},{"p":30,"t":"then I was beside him as a master craftsman, and I was his delight day by day, rejoicing before him at all times,"},{"p":31,"t":"rejoicing in the habitable part of his earth, and delighting in its people."},{"p":32,"t":"“So now, children, listen to me; blessed are those who keep my ways."},{"p":33,"t":"Listen to my instruction so that you may be wise, and do not neglect it."},{"p":34,"t":"Blessed is the one who listens to me, watching at my doors day by day, waiting beside my doorway."},{"p":35,"t":"For the one who finds me finds life and receives favor from the Lord."},{"p":36,"t":"But the one who does not find me brings harm to himself; all who hate me love death.”"}],[{"p":1,"t":"Wisdom has built her house; she has carved out its seven pillars."},{"p":2,"t":"She has prepared her meat, she has mixed her wine; she also has arranged her table."},{"p":3,"t":"She has sent out her female servants; she calls out on the highest places of the city."},{"p":4,"t":"“Whoever is naive, let him turn in here,” she says to those who lack understanding."},{"p":5,"t":"“Come, eat some of my food, and drink some of the wine I have mixed."},{"p":6,"t":"Abandon your foolish ways so that you may live, and proceed in the way of understanding.”"},{"p":7,"t":"Whoever corrects a mocker is asking for insult; whoever reproves a wicked person receives abuse."},{"p":8,"t":"Do not reprove a mocker or he will hate you; reprove a wise person and he will love you."},{"p":9,"t":"Give instruction to a wise person, and he will become wiser still; teach a righteous person and he will add to his learning."},{"p":10,"t":"The beginning of wisdom is to fear the Lord, and acknowledging the Holy One is understanding."},{"p":11,"t":"For because of me your days will be many, and years will be added to your life."},{"p":12,"t":"If you are wise, you are wise to your own advantage, but if you are a mocker, you alone must bear it."},{"p":13,"t":"The woman called Folly is brash, she is naive and does not know anything."},{"p":14,"t":"So she sits at the door of her house, on a seat at the highest point of the city,"},{"p":15,"t":"calling out to those who are passing by her in the way, who go straight on their way."},{"p":16,"t":"“Whoever is simple, let him turn in here,” she says to those who lack understanding."},{"p":17,"t":"“Stolen waters are sweet, and food obtained in secret is pleasant!”"},{"p":18,"t":"But they do not realize that the dead are there, that her guests are in the depths of the grave."}],[{"p":1,"t":"The Proverbs of Solomon: A wise child makes a father rejoice, but a foolish child is a grief to his mother."},{"p":2,"t":"Treasures gained by wickedness do not profit, but righteousness delivers from mortal danger."},{"p":3,"t":"The Lord satisfies the appetite of the righteous, but he thwarts the craving of the wicked."},{"p":4,"t":"The one who is lazy becomes poor, but the one who works diligently becomes wealthy."},{"p":5,"t":"The one who gathers crops in the summer is a wise son, but the one who sleeps during the harvest is a son who brings shame to himself."},{"p":6,"t":"Blessings are on the head of the righteous, but the speech of the wicked conceals violence."},{"p":7,"t":"The memory of the righteous is a blessing, but the reputation of the wicked will rot."},{"p":8,"t":"The wise person accepts instructions, but the one who speaks foolishness will come to ruin."},{"p":9,"t":"The one who conducts himself in integrity will live securely, but the one who behaves perversely will be found out."},{"p":10,"t":"The one who winks his eye causes trouble, and the one who speaks foolishness will come to ruin."},{"p":11,"t":"The teaching of the righteous is a fountain of life, but the speech of the wicked conceals violence."},{"p":12,"t":"Hatred stirs up dissension, but love covers all transgressions."},{"p":13,"t":"Wisdom is found in the words of the discerning person, but the one who lacks wisdom will be disciplined."},{"p":14,"t":"Those who are wise store up knowledge, but foolish speech leads to imminent destruction."},{"p":15,"t":"The wealth of a rich person is like a fortified city, but the poor are brought to ruin by their poverty."},{"p":16,"t":"The reward which the righteous receive is life; the recompense which the wicked receive is judgment."},{"p":17,"t":"The one who heeds instruction is on the way to life, but the one who rejects rebuke goes astray."},{"p":18,"t":"The one who conceals hatred utters lies, and the one who spreads slander is certainly a fool."},{"p":19,"t":"When words abound, transgression is inevitable, but the one who restrains his words is wise."},{"p":20,"t":"What the righteous say is like the best silver, but what the wicked think is of little value."},{"p":21,"t":"The teaching of the righteous feeds many, but fools die for lack of wisdom."},{"p":22,"t":"The blessing from the Lord makes a person rich, and he adds no sorrow to it."},{"p":23,"t":"Carrying out a wicked scheme is enjoyable to a fool, and so is wisdom for the one who has discernment."},{"p":24,"t":"What the wicked fears will come on him; what the righteous desire will be granted."},{"p":25,"t":"When the storm passes through, the wicked are swept away, but the righteous are an everlasting foundation."},{"p":26,"t":"Like vinegar to the teeth and like smoke to the eyes, so is the sluggard to those who send him."},{"p":27,"t":"Fearing the Lord prolongs life, but the life span of the wicked will be shortened."},{"p":28,"t":"The hope of the righteous is joy, but the expectation of the wicked will remain unfulfilled."},{"p":29,"t":"The way of the Lord is like a stronghold for the upright, but it is destruction to evildoers."},{"p":30,"t":"The righteous will never be moved, but the wicked will not inhabit the land."},{"p":31,"t":"The speech of the righteous bears the fruit of wisdom, but the one who speaks perversion will be destroyed."},{"p":32,"t":"The lips of the righteous know what is pleasing, but the speech of the wicked is perverse."}],[{"p":1,"t":"The Lord abhors dishonest scales, but an accurate weight is his elight."},{"p":2,"t":"When pride comes, then comes disgrace, but with humility comes wisdom."},{"p":3,"t":"The integrity of the upright guides them, but the crookedness of the unfaithful destroys them."},{"p":4,"t":"Wealth does not profit in the day of wrath, but righteousness delivers from mortal danger."},{"p":5,"t":"The righteousness of the blameless will make straight their way, but the wicked person will fall by his own wickedness."},{"p":6,"t":"The righteousness of the upright will deliver them, but the faithless will be captured by their own desires."},{"p":7,"t":"When a wicked person dies, his expectation perishes, and the hope of his strength perishes."},{"p":8,"t":"The righteous person is delivered out of trouble, and the wicked turns up in his stead."},{"p":9,"t":"With his speech the godless person destroys his neighbor, but by knowledge the righteous will be delivered."},{"p":10,"t":"When the righteous do well, the city rejoices; when the wicked perish, there is joy."},{"p":11,"t":"A city is exalted by the blessing provided from the upright, but it is destroyed by the counsel of the wicked."},{"p":12,"t":"The one who denounces his neighbor lacks wisdom, but the one who has discernment keeps silent."},{"p":13,"t":"The one who goes about slandering others reveals secrets, but the one who is trustworthy conceals a matter."},{"p":14,"t":"When there is no guidance a nation falls, but there is success in the abundance of counselors."},{"p":15,"t":"The one who puts up security for a stranger will surely have trouble, but whoever avoids shaking hands will be secure."},{"p":16,"t":"A generous woman gains honor, and ruthless men seize wealth."},{"p":17,"t":"A kind person benefits himself, but a cruel person brings himself trouble."},{"p":18,"t":"The wicked person earns deceitful wages, but the one who sows righteousness reaps a genuine reward."},{"p":19,"t":"True righteousness leads to life, but the one who pursues evil pursues it to his own death."},{"p":20,"t":"The Lord abhors those who are perverse in heart, but those who are blameless in their ways are his delight."},{"p":21,"t":"Be assured that the evil person will certainly be punished, but the descendants of the righteous will not suffer unjust judgment."},{"p":22,"t":"Like a gold ring in a pig’s snout is a beautiful woman who rejects discretion."},{"p":23,"t":"What the righteous desire leads only to good, but what the wicked hope for leads to wrath."},{"p":24,"t":"One person is generous and yet grows more wealthy, but another withholds more than he should and comes to poverty."},{"p":25,"t":"A generous person will be enriched, and the one who provides water for others will himself be satisfied."},{"p":26,"t":"People will curse the one who withholds grain, but they will praise the one who sells it."},{"p":27,"t":"The one who diligently seeks good seeks favor, but the one who searches for evil &#8211; it will come to him."},{"p":28,"t":"The one who trusts in his riches will fall, but the righteous will flourish like a green leaf."},{"p":29,"t":"The one who troubles his family will inherit nothing, and the fool will be a servant to the wise person."},{"p":30,"t":"The fruit of the righteous is like a tree producing life, and the one who wins souls is wise."},{"p":31,"t":"If the righteous are recompensed on earth, how much more the wicked sinner!"}],[{"p":1,"t":"The one who loves discipline loves knowledge, but the one who hates reproof is stupid."},{"p":2,"t":"A good person obtains favor from the Lord, but the Lord condemns a person with wicked schemes."},{"p":3,"t":"No one can be established through wickedness, but a righteous root cannot be moved."},{"p":4,"t":"A noble wife is the crown of her husband, but the wife who acts shamefully is like rottenness in his bones."},{"p":5,"t":"The plans of the righteous are just; the counsels of the wicked are deceitful."},{"p":6,"t":"The words of the wicked lie in wait to shed innocent blood, but the words of the upright will deliver them."},{"p":7,"t":"The wicked are overthrown and perish, but the righteous household will stand."},{"p":8,"t":"A person is praised in accordance with his wisdom, but the one who has a twisted mind is despised."},{"p":9,"t":"Better is a person of humble standing who nevertheless has a servant, than one who pretends to be somebody important yet has no food."},{"p":10,"t":"A righteous person cares for the life of his animal, but even the most compassionate acts of the wicked are cruel."},{"p":11,"t":"The one who works his field will have plenty of food, but whoever chases daydreams lacks wisdom."},{"p":12,"t":"The wicked person desires a stronghold, but the righteous root endures."},{"p":13,"t":"The evil person is ensnared by the transgression of his speech, but the righteous person escapes out of trouble."},{"p":14,"t":"A person will be satisfied with good from the fruit of his words, and the work of his hands will be rendered to him."},{"p":15,"t":"The way of a fool is right in his own opinion, but the one who listens to advice is wise."},{"p":16,"t":"A fool’s annoyance is known at once, but the prudent overlooks an insult."},{"p":17,"t":"The faithful witness tells what is right, but a false witness speaks deceit."},{"p":18,"t":"Speaking recklessly is like the thrusts of a sword, but the words of the wise bring healing."},{"p":19,"t":"The one who tells the truth will endure forever, but the one who lies will last only for a moment."},{"p":20,"t":"Deceit is in the heart of those who plot evil, but those who promote peace have joy."},{"p":21,"t":"The righteous do not encounter any harm, but the wicked are filled with calamity."},{"p":22,"t":"The Lord abhors a person who lies, but those who deal truthfully are his delight."},{"p":23,"t":"The shrewd person conceals knowledge, but foolish people publicize folly."},{"p":24,"t":"The diligent person will rule, but the slothful will become a slave."},{"p":25,"t":"Anxiety in a person’s heart weighs him down, but an encouraging word brings him joy."},{"p":26,"t":"The righteous person is cautious in his friendship, but the way of the wicked leads them astray."},{"p":27,"t":"The lazy person does not roast his prey, but personal possessions are precious to the diligent."},{"p":28,"t":"In the path of righteousness there is life, but another path leads to death."}],[{"p":1,"t":"A wise son accepts his father’s discipline, but a scoffer does not listen to rebuke."},{"p":2,"t":"From the fruit of his speech a person eats good things, but the faithless desire the fruit of violence."},{"p":3,"t":"The one who guards his words guards his life, but whoever is talkative will come to ruin."},{"p":4,"t":"The appetite of the sluggard craves but gets nothing, but the desire of the diligent will be abundantly satisfied."},{"p":5,"t":"The righteous person hates anything false, but the wicked person acts in shameful disgrace."},{"p":6,"t":"Righteousness guards the one who lives with integrity, but wickedness overthrows the sinner."},{"p":7,"t":"There is one who pretends to be rich and yet has nothing; another pretends to be poor and yet possesses great wealth."},{"p":8,"t":"The ransom of a person’s life is his wealth, but the poor person hears no threat."},{"p":9,"t":"The light of the righteous shines brightly, but the lamp of the wicked goes out."},{"p":10,"t":"With pride comes only contention, but wisdom is with the well-advised."},{"p":11,"t":"Wealth gained quickly will dwindle away, but the one who gathers it little by little will become rich."},{"p":12,"t":"Hope deferred makes the heart sick, but a longing fulfilled is like a tree of life."},{"p":13,"t":"The one who despises instruction will pay the penalty, but whoever esteems instruction will be rewarded."},{"p":14,"t":"Instruction from the wise is like a life-giving fountain, to turn a person from deadly snares."},{"p":15,"t":"Keen insight wins favor, but the conduct of the unfaithful is harsh."},{"p":16,"t":"Every shrewd person acts with knowledge, but a fool displays his folly."},{"p":17,"t":"An unreliable messenger falls into trouble, but a faithful envoy brings healing."},{"p":18,"t":"The one who neglects discipline ends up in poverty and shame, but the one who accepts reproof is honored."},{"p":19,"t":"A desire fulfilled is sweet to the soul, but fools abhor turning away from evil."},{"p":20,"t":"The one who associates with the wise grows wise, but a companion of fools suffers harm."},{"p":21,"t":"Calamity pursues sinners, but prosperity rewards the righteous."},{"p":22,"t":"A benevolent person leaves an inheritance for his grandchildren, but the wealth of a sinner is stored up for the righteous."},{"p":23,"t":"There is abundant food in the field of the poor, but it is swept away by injustice."},{"p":24,"t":"The one who spares his rod hates his child, but the one who loves his child is diligent in disciplining him."},{"p":25,"t":"The righteous has enough food to satisfy his appetite, but the belly of the wicked lacks food."}],[{"p":1,"t":"Every wise woman builds her household, but a foolish woman tears it down with her own hands."},{"p":2,"t":"The one who walks in his uprightness fears the Lord, but the one who is perverted in his ways despises him."},{"p":3,"t":"In the speech of a fool is a rod for his back, but the words of the wise protect them."},{"p":4,"t":"Where there are no oxen, the feeding trough is clean, but an abundant harvest is produced by strong oxen."},{"p":5,"t":"A truthful witness does not lie, but a false witness breathes out lies."},{"p":6,"t":"The scorner seeks wisdom but finds none, but understanding is easy for a discerning person."},{"p":7,"t":"Leave the presence of a foolish person, or you will not understand wise counsel."},{"p":8,"t":"The wisdom of the shrewd person is to discern his way, but the folly of fools is deception."},{"p":9,"t":"Fools mock at reparation, but among the upright there is favor."},{"p":10,"t":"The heart knows its own bitterness, and with its joy no one else can share."},{"p":11,"t":"The household of the wicked will be destroyed, but the tent of the upright will flourish."},{"p":12,"t":"There is a way that seems right to a person, but its end is the way that leads to death."},{"p":13,"t":"Even in laughter the heart may ache, and the end of joy may be grief."},{"p":14,"t":"The backslider will be paid back from his own ways, but a good person will be rewarded for his."},{"p":15,"t":"A naive person believes everything, but the shrewd person discerns his steps."},{"p":16,"t":"A wise person is cautious and turns from evil, but a fool throws off restraint and is overconfident."},{"p":17,"t":"A person who has a quick temper does foolish things, and a person with crafty schemes is hated."},{"p":18,"t":"The naive inherit folly, but the shrewd are crowned with knowledge."},{"p":19,"t":"Those who are evil will bow before those who are good, and the wicked will bow at the gates of the righteous."},{"p":20,"t":"A poor person is disliked even by his neighbors, but those who love the rich are many."},{"p":21,"t":"The one who despises his neighbor sins, but whoever is kind to the needy is blessed."},{"p":22,"t":"Do not those who devise evil go astray? But those who plan good exhibit faithful covenant love."},{"p":23,"t":"In all hard work there is profit, but merely talking about it only brings poverty."},{"p":24,"t":"The crown of the wise is their riches, but the folly of fools is folly."},{"p":25,"t":"A truthful witness rescues lives, but the one who breathes lies brings deception."},{"p":26,"t":"In the fear of the Lord one has strong confidence, and it will be a refuge for his children."},{"p":27,"t":"The fear of the Lord is like a life-giving fountain, to turn people from deadly snares."},{"p":28,"t":"A king’s glory is the abundance of people, but the lack of subjects is the ruin of a ruler."},{"p":29,"t":"The one who is slow to anger has great understanding, but the one who has a quick temper exalts folly."},{"p":30,"t":"A tranquil spirit revives the body, but envy is rottenness to the bones."},{"p":31,"t":"The one who oppresses the poor insults his Creator, but whoever shows favor to the needy honors him."},{"p":32,"t":"The wicked will be thrown down in his trouble, but the righteous have refuge even in the threat of death."},{"p":33,"t":"Wisdom rests in the heart of the discerning; it is known even in the heart of fools."},{"p":34,"t":"Righteousness exalts a nation, but sin is a disgrace to any people."},{"p":35,"t":"The king shows favor to a wise servant, but his wrath falls on one who acts shamefully."}],[{"p":1,"t":"A gentle response turns away anger, but a harsh word stirs up wrath."},{"p":2,"t":"The tongue of the wise treats knowledge correctly, but the mouth of the fool spouts out folly."},{"p":3,"t":"The eyes of the Lord are in every place, keeping watch on those who are evil and those who are good."},{"p":4,"t":"Speech that heals is like a life-giving tree, but a perverse tongue breaks the spirit."},{"p":5,"t":"A fool rejects his father’s discipline, but whoever heeds reproof shows good sense."},{"p":6,"t":"In the house of the righteous is abundant wealth, but the income of the wicked brings trouble."},{"p":7,"t":"The lips of the wise spread knowledge, but not so the heart of fools."},{"p":8,"t":"The Lord abhors the sacrifices of the wicked, but the prayer of the upright pleases him."},{"p":9,"t":"The Lord abhors the way of the wicked, but he loves those who pursue righteousness."},{"p":10,"t":"Severe discipline is for the one who abandons the way; the one who hates reproof will die."},{"p":11,"t":"Death and Destruction are before the Lord &#8211; how much more the hearts of humans!"},{"p":12,"t":"The scorner does not love one who corrects him; he will not go to the wise."},{"p":13,"t":"A joyful heart makes the face cheerful, but by a painful heart the spirit is broken."},{"p":14,"t":"The discerning heart seeks knowledge, but the mouth of fools feeds on folly."},{"p":15,"t":"All the days of the afflicted are bad, but one with a cheerful heart has a continual feast."},{"p":16,"t":"Better is little with the fear of the Lord than great wealth and turmoil with it."},{"p":17,"t":"Better a meal of vegetables where there is love than a fattened ox where there is hatred."},{"p":18,"t":"A quick-tempered person stirs up dissension, but one who is slow to anger calms a quarrel."},{"p":19,"t":"The way of the sluggard is like a hedge of thorns, but the path of the upright is like a highway."},{"p":20,"t":"A wise child brings joy to his father, but a foolish person despises his mother."},{"p":21,"t":"Folly is a joy to one who lacks sense, but one who has understanding follows an upright course."},{"p":22,"t":"Plans fail when there is no counsel, but with abundant advisers they are established."},{"p":23,"t":"A person has joy in giving an appropriate answer, and a word at the right time &#8211; how good it is!"},{"p":24,"t":"The path of life is upward for the wise person, to keep him from going downward to Sheol."},{"p":25,"t":"The Lord tears down the house of the proud, but he maintains the boundaries of the widow."},{"p":26,"t":"The Lord abhors the plans of the wicked, but pleasant words are pure."},{"p":27,"t":"The one who is greedy for gain troubles his household, but whoever hates bribes will live."},{"p":28,"t":"The heart of the righteous considers how to answer, but the mouth of the wicked pours out evil things."},{"p":29,"t":"The Lord is far from the wicked, but he hears the prayer of the righteous."},{"p":30,"t":"A bright look brings joy to the heart, and good news gives health to the body."},{"p":31,"t":"The person who hears the reproof that leads to life is at home among the wise."},{"p":32,"t":"The one who refuses correction despises himself, but whoever hears reproof acquires understanding."},{"p":33,"t":"The fear of the Lord provides wise instruction, and before honor comes humility."}],[{"p":1,"t":"The intentions of the heart belong to a man, but the answer of the tongue comes from the Lord."},{"p":2,"t":"All a person’s ways seem right in his own opinion, but the Lord evaluates the motives."},{"p":3,"t":"Commit your works to the Lord, and your plans will be established."},{"p":4,"t":"The Lord works everything for its own ends &#8211; even the wicked for the day of disaster."},{"p":5,"t":"The Lord abhors every arrogant person; rest assured that they will not go unpunished."},{"p":6,"t":"Through loyal love and truth iniquity is appeased; through fearing the Lord one avoids evil."},{"p":7,"t":"When a person’s ways are pleasing to the Lord, he even reconciles his enemies to himself."},{"p":8,"t":"Better to have a little with righteousness than to have abundant income without justice."},{"p":9,"t":"A person plans his course, but the Lord directs his steps."},{"p":10,"t":"The divine verdict is in the words of the king, his pronouncements must not act treacherously against justice."},{"p":11,"t":"Honest scales and balances are from the Lord; all the weights in the bag are his handiwork."},{"p":12,"t":"Doing wickedness is an abomination to kings, because a throne is established in righteousness."},{"p":13,"t":"The delight of kings is righteous counsel, and they love the one who speaks uprightly."},{"p":14,"t":"A king’s wrath is like a messenger of death, but a wise person appeases it."},{"p":15,"t":"In the light of the king’s face there is life, and his favor is like the clouds of the spring rain."},{"p":16,"t":"How much better it is to acquire wisdom than gold; to acquire understanding is more desirable than silver."},{"p":17,"t":"The highway of the upright is to turn away from evil; the one who guards his way safeguards his life."},{"p":18,"t":"Pride goes before destruction, and a haughty spirit before a fall. "},{"p":19,"t":"It is better to be lowly in spirit with the afflicted than to share the spoils with the proud."},{"p":20,"t":"The one who deals wisely in a matter will find success, and blessed is the one who trusts in the Lord."},{"p":21,"t":"The one who is wise in heart is called discerning, and kind speech increases persuasiveness."},{"p":22,"t":"Insight is like a life-giving fountain to the one who possesses it, but folly leads to the discipline of fools."},{"p":23,"t":"A wise person’s heart makes his speech wise and it adds persuasiveness to his words."},{"p":24,"t":"Pleasant words are like a honeycomb, sweet to the soul and healing to the bones."},{"p":25,"t":"There is a way that seems right to a person, but its end is the way that leads to death."},{"p":26,"t":"A laborer’s appetite works on his behalf, for his hunger urges him to work."},{"p":27,"t":"A wicked scoundrel digs up evil, and his slander is like a scorching fire."},{"p":28,"t":"A perverse person spreads dissension, and a gossip separates the closest friends."},{"p":29,"t":"A violent person entices his neighbor, and leads him down a path that is terrible."},{"p":30,"t":"The one who winks his eyes devises perverse things, and one who compresses his lips brings about evil."},{"p":31,"t":"Gray hair is like a crown of glory; it is attained in the path of righteousness."},{"p":32,"t":"Better to be slow to anger than to be a mighty warrior, and one who controls his temper is better than one who captures a city."},{"p":33,"t":"The dice are thrown into the lap, but their every decision is from the Lord."}],[{"p":1,"t":"Better is a dry crust of bread where there is quietness than a house full of feasting with strife."},{"p":2,"t":"A servant who acts wisely will rule over an heir who behaves shamefully, and will share the inheritance along with the relatives."},{"p":3,"t":"The crucible is for refining silver and the furnace is for gold, likewise the Lord tests hearts."},{"p":4,"t":"One who acts wickedly pays attention to evil counsel; a liar listens to a malicious tongue."},{"p":5,"t":"The one who mocks the poor insults his Creator; whoever rejoices over disaster will not go unpunished."},{"p":6,"t":"Grandchildren are like a crown to the elderly, and the glory of children is their parents."},{"p":7,"t":"Excessive speech is not becoming for a fool; how much less are lies for a ruler!"},{"p":8,"t":"A bribe works like a charm for the one who offers it; in whatever he does he succeeds."},{"p":9,"t":"The one who forgives an offense seeks love, but whoever repeats a matter separates close friends."},{"p":10,"t":"A rebuke makes a greater impression on a discerning person than a hundred blows on a fool."},{"p":11,"t":"An evil person seeks only rebellion, and so a cruel messenger will be sent against him."},{"p":12,"t":"It is better for a person to meet a mother bear being robbed of her cubs, than to encounter a fool in his folly."},{"p":13,"t":"As for the one who repays evil for good, evil will not leave his house."},{"p":14,"t":"Starting a quarrel is like letting out water; stop it before strife breaks out!"},{"p":15,"t":"The one who acquits the guilty and the one who condemns the innocent &#8211; both of them are an abomination to the Lord."},{"p":16,"t":"Of what use is money in the hand of a fool, since he has no intention of acquiring wisdom?"},{"p":17,"t":"A friend loves at all times, and a relative is born to help in adversity."},{"p":18,"t":"The one who lacks wisdom strikes hands in pledge, and puts up financial security for his neighbor."},{"p":19,"t":"The one who loves a quarrel loves transgression; whoever builds his gate high seeks destruction."},{"p":20,"t":"The one who has a perverse heart does not find good, and the one who is deceitful in speech falls into trouble."},{"p":21,"t":"Whoever brings a fool into the world does so to his grief, and the father of a fool has no joy."},{"p":22,"t":"A cheerful heart brings good healing, but a crushed spirit dries up the bones."},{"p":23,"t":"A wicked person receives a bribe secretly to pervert the ways of justice."},{"p":24,"t":"Wisdom is directly in front of the discerning person, but the eyes of a fool run to the ends of the earth."},{"p":25,"t":"A foolish child is a grief to his father, and bitterness to the mother who bore him."},{"p":26,"t":"It is terrible to punish a righteous person, and to flog honorable men is wrong."},{"p":27,"t":"The truly wise person restrains his words, and the one who stays calm is discerning."},{"p":28,"t":"Even a fool who remains silent is considered wise, and the one who holds his tongue is deemed discerning."}],[{"p":1,"t":"One who has isolated himself seeks his own desires; he rejects all sound judgment."},{"p":2,"t":"A fool takes no pleasure in understanding but only in disclosing what is on his mind."},{"p":3,"t":"When a wicked person arrives, contempt shows up with him, and with shame comes a reproach."},{"p":4,"t":"The words of a person’s mouth are like deep waters, and the fountain of wisdom is like a flowing brook."},{"p":5,"t":"It is terrible to show partiality to the wicked, by depriving a righteous man of justice."},{"p":6,"t":"The lips of a fool enter into strife, and his mouth invites a flogging."},{"p":7,"t":"The mouth of a fool is his ruin, and his lips are a snare for his life."},{"p":8,"t":"The words of a gossip are like choice morsels; they go down into the person’s innermost being."},{"p":9,"t":"The one who is slack in his work is a brother to one who destroys."},{"p":10,"t":"The name of the Lord is like a strong tower; the righteous person runs to it and is set safely on high."},{"p":11,"t":"The wealth of a rich person is like a strong city, and it is like a high wall in his imagination."},{"p":12,"t":"Before destruction the heart of a person is proud, but humility comes before honor."},{"p":13,"t":"The one who gives an answer before he listens &#8211; that is his folly and his shame."},{"p":14,"t":"A person’s spirit sustains him through sickness &#8211; but who can bear a crushed spirit?"},{"p":15,"t":"The discerning person acquires knowledge, and the wise person seeks knowledge."},{"p":16,"t":"A person’s gift makes room for him, and leads him before important people."},{"p":17,"t":"The first to state his case seems right, until his opponent begins to cross-examine him."},{"p":18,"t":"A toss of a coin ends disputes, and settles the issue between strong opponents."},{"p":19,"t":"A relative offended is harder to reach than a strong city, and disputes are like the barred gates of a fortified citadel."},{"p":20,"t":"From the fruit of a person’s mouth his stomach is satisfied, with the product of his lips is he satisfied."},{"p":21,"t":"Death and life are in the power of the tongue, and those who love its use will eat its fruit."},{"p":22,"t":"The one who finds a wife finds what is enjoyable, and receives a pleasurable gift from the Lord."},{"p":23,"t":"A poor person makes supplications, but a rich man answers harshly."},{"p":24,"t":"A person who has friends may be harmed by them, but there is a friend who sticks closer than a brother."}],[{"p":1,"t":"Better is a poor person who walks in his integrity than one who is perverse in his speech and is a fool."},{"p":2,"t":"It is dangerous to have zeal without knowledge, and the one who acts hastily makes poor choices."},{"p":3,"t":"A person’s folly subverts his way, and his heart rages against the Lord."},{"p":4,"t":"Wealth adds many friends, but a poor person is separated from his friend."},{"p":5,"t":"A false witness will not go unpunished, and the one who spouts out lies will not escape punishment."},{"p":6,"t":"Many people entreat the favor of a generous person, and everyone is the friend of the person who gives gifts."},{"p":7,"t":"All the relatives of a poor person hate him; how much more do his friends avoid him &#8211; he pursues them with words, but they do not respond."},{"p":8,"t":"The one who acquires wisdom loves himself; the one who preserves understanding will prosper."},{"p":9,"t":"A false witness will not go unpunished, and the one who spouts out lies will perish."},{"p":10,"t":"Luxury is not appropriate for a fool; how much less for a servant to rule over princes!"},{"p":11,"t":"A person’s wisdom makes him slow to anger, and it is his glory to overlook an offense."},{"p":12,"t":"A king’s wrath is like the roar of a lion, but his favor is like dew on the grass."},{"p":13,"t":"A foolish child is the ruin of his father, and a contentious wife is like a constant dripping."},{"p":14,"t":"A house and wealth are inherited from parents, but a prudent wife is from the Lord."},{"p":15,"t":"Laziness brings on a deep sleep, and the idle person will go hungry."},{"p":16,"t":"The one who obeys commandments guards his life; the one who despises his ways will die."},{"p":17,"t":"The one who is gracious to the poor lends to the Lord, and the Lord will repay him for his good deed."},{"p":18,"t":"Discipline your child, for there is hope, but do not set your heart on causing his death."},{"p":19,"t":"A person with great anger bears the penalty, but if you deliver him from it once, you will have to do it again."},{"p":20,"t":"Listen to advice and receive discipline, that you may become wise by the end of your life."},{"p":21,"t":"There are many plans in a person’s mind, but it is the counsel of the Lord which will stand."},{"p":22,"t":"What is desirable for a person is to show loyal love, and a poor person is better than a liar."},{"p":23,"t":"Fearing the Lord leads to life, and one who does so will live satisfied; he will not be afflicted by calamity."},{"p":24,"t":"The sluggard plunges his hand in the dish, and he will not even bring it back to his mouth!"},{"p":25,"t":"Flog a scorner, and as a result the simpleton will learn prudence; correct a discerning person, and as a result he will understand knowledge."},{"p":26,"t":"The one who robs his father and chases away his mother is a son who brings shame and disgrace."},{"p":27,"t":"If you stop listening to instruction, my child, you will stray from the words of knowledge."},{"p":28,"t":"A crooked witness scorns justice, and the mouth of the wicked devours iniquity."},{"p":29,"t":"Judgments are prepared for scorners, and floggings for the backs of fools."}],[{"p":1,"t":"Wine is a mocker and strong drink is a brawler; whoever goes astray by them is not wise."},{"p":2,"t":"The king’s terrifying anger is like the roar of a lion; whoever provokes him sins against himself."},{"p":3,"t":"It is an honor for a person to cease from strife, but every fool quarrels."},{"p":4,"t":"The sluggard will not plow during the planting season, so at harvest time he looks for the crop but has nothing."},{"p":5,"t":"Counsel in a person’s heart is like deep water, but an understanding person draws it out."},{"p":6,"t":"Many people profess their loyalty, but a faithful person &#8211; who can find?"},{"p":7,"t":"The righteous person behaves in integrity; blessed are his children after him."},{"p":8,"t":"A king sitting on the throne to judge separates out all evil with his eyes."},{"p":9,"t":"Who can say, “I have kept my heart clean; I am pure from my sin”?"},{"p":10,"t":"Diverse weights and diverse measures &#8211; the Lord abhors both of them."},{"p":11,"t":"Even a young man is known by his actions, whether his activity is pure and whether it is right."},{"p":12,"t":"The ear that hears and the eye that sees &#8211; the Lord has made them both."},{"p":13,"t":"Do not love sleep, lest you become impoverished; open your eyes so that you might be satisfied with food."},{"p":14,"t":"“It’s worthless! It’s worthless!” says the buyer, but when he goes on his way, he boasts."},{"p":15,"t":"There is gold, and an abundance of rubies, but words of knowledge are like a precious jewel."},{"p":16,"t":"Take a man’s garment when he has given security for a stranger, and when he gives surety for strangers, hold him in pledge."},{"p":17,"t":"Bread gained by deceit tastes sweet to a person, but afterward his mouth will be filled with gravel."},{"p":18,"t":"Plans are established by counsel, so make war with guidance."},{"p":19,"t":"The one who goes about gossiping reveals secrets; therefore do not associate with someone who is always opening his mouth."},{"p":20,"t":"The one who curses his father and his mother, his lamp will be extinguished in the blackest darkness."},{"p":21,"t":"An inheritance gained easily in the beginning will not be blessed in the end."},{"p":22,"t":"Do not say, “I will pay back evil!” Wait for the Lord, so that he may vindicate you."},{"p":23,"t":"The Lord abhors differing weights, and dishonest scales are wicked."},{"p":24,"t":"The steps of a person are ordained by the Lord &#8211; so how can anyone understand his own way?"},{"p":25,"t":"It is a snare for a person to rashly cry, “Holy!” and only afterward to consider what he has vowed."},{"p":26,"t":"A wise king separates out the wicked; he turns the threshing wheel over them."},{"p":27,"t":"The human spirit is like the lamp of the Lord, searching all his innermost parts."},{"p":28,"t":"Loyal love and truth preserve a king, and his throne is upheld by loyal love."},{"p":29,"t":"The glory of young men is their strength, and the splendor of old men is gray hair."},{"p":30,"t":"Beatings and wounds cleanse away evil, and floggings cleanse the innermost being."}],[{"p":1,"t":"The king’s heart is in the hand of the Lord like channels of water; he turns it wherever he wants."},{"p":2,"t":"All of a person’s ways seem right in his own opinion, but the Lord evaluates the motives."},{"p":3,"t":"To do righteousness and justice is more acceptable to the Lord than sacrifice."},{"p":4,"t":"Haughty eyes and a proud heart &#8211; the agricultural product of the wicked is sin."},{"p":5,"t":"The plans of the diligent lead only to plenty, but everyone who is hasty comes only to poverty."},{"p":6,"t":"Making a fortune by a lying tongue is like a vapor driven back and forth; they seek death."},{"p":7,"t":"The violence done by the wicked will drag them away because they refuse to do what is right."},{"p":8,"t":"The way of the guilty person is devious, but as for the pure, his way is upright."},{"p":9,"t":"It is better to live on a corner of the housetop than in a house in company with a quarrelsome wife."},{"p":10,"t":"The appetite of the wicked desires evil; his neighbor is shown no favor in his eyes."},{"p":11,"t":"When a scorner is punished, the naive becomes wise; when a wise person is instructed, he gains knowledge."},{"p":12,"t":"The Righteous One considers the house of the wicked; he overthrows the wicked to their ruin."},{"p":13,"t":"The one who shuts his ears to the cry of the poor, he too will cry out and will not be answered."},{"p":14,"t":"A gift given in secret subdues anger, and a bribe given secretly subdues strong wrath."},{"p":15,"t":"Doing justice brings joy to the righteous and terror to those who do evil."},{"p":16,"t":"The one who wanders from the way of wisdom will end up in the company of the departed."},{"p":17,"t":"The one who loves pleasure will be a poor person; whoever loves wine and anointing oil will not be rich."},{"p":18,"t":"The wicked become a ransom for the righteous, and the faithless are taken in the place of the upright."},{"p":19,"t":"It is better to live in a desert land than with a quarrelsome and easily-provoked woman."},{"p":20,"t":"There is desirable treasure and olive oil in the dwelling of the wise, but a foolish person devours all he has."},{"p":21,"t":"The one who pursues righteousness and love finds life, bounty, and honor."},{"p":22,"t":"The wise person can scale the city of the mighty and bring down the stronghold in which they trust."},{"p":23,"t":"The one who guards his mouth and his tongue keeps his life from troubles."},{"p":24,"t":"A proud and arrogant person, whose name is “Scoffer,” acts with overbearing pride."},{"p":25,"t":"What the sluggard desires will kill him, for his hands refuse to work."},{"p":26,"t":"All day long he craves greedily, but the righteous gives and does not hold back."},{"p":27,"t":"The wicked person’s sacrifice is an abomination; how much more when he brings it with evil intent!"},{"p":28,"t":"A lying witness will perish, but the one who reports accurately speaks forever."},{"p":29,"t":"A wicked person shows boldness with his face, but as for the upright, he discerns his ways."},{"p":30,"t":"There is no wisdom and there is no understanding, and there is no counsel against the Lord."},{"p":31,"t":"A horse is prepared for the day of battle, but the victory is from the Lord."}],[{"p":1,"t":"A good name is to be chosen rather than great wealth, good favor more than silver or gold."},{"p":2,"t":"The rich and the poor meet together; the Lord is the creator of them both."},{"p":3,"t":"A shrewd person sees danger and hides himself, but the naive keep right on going and suffer for it."},{"p":4,"t":"The reward for humility and fearing the Lord is riches and honor and life."},{"p":5,"t":"Thorns and snares are in the path of the perverse, but the one who guards himself keeps far from them."},{"p":6,"t":"Train a child in the way that he should go, and when he is old he will not turn from it."},{"p":7,"t":"The rich rule over the poor, and the borrower is servant to the lender."},{"p":8,"t":"The one who sows iniquity will reap trouble, and the rod of his fury will end."},{"p":9,"t":"A generous person will be blessed, for he gives some of his food to the poor."},{"p":10,"t":"Drive out the scorner and contention will leave; strife and insults will cease."},{"p":11,"t":"The one who loves a pure heart and whose speech is gracious &#8211; the king will be his friend."},{"p":12,"t":"The eyes of the Lord guard knowledge, but he overthrows the words of the faithless person."},{"p":13,"t":"The sluggard says, “There is a lion outside! I will be killed in the middle of the streets!”"},{"p":14,"t":"The mouth of an adulteress is like a deep pit; the one against whom the Lord is angry will fall into it."},{"p":15,"t":"Folly is bound up in the heart of a child, but the rod of discipline will drive it far from him."},{"p":16,"t":"The one who oppresses the poor to increase his own gain and the one who gives to the rich &#8211; both end up only in poverty."},{"p":17,"t":"Incline your ear and listen to the words of the wise, and apply your heart to my instruction."},{"p":18,"t":"For it is pleasing if you keep these sayings within you, and they are ready on your lips."},{"p":19,"t":"So that your confidence may be in the Lord, I am making them known to you today &#8211; even you."},{"p":20,"t":"Have I not written thirty sayings for you, sayings of counsel and knowledge,"},{"p":21,"t":"to show you true and reliable words, so that you may give accurate answers to those who sent you?"},{"p":22,"t":"Do not exploit a poor person because he is poor and do not crush the needy in court,"},{"p":23,"t":"for the Lord will plead their case and will rob those who are robbing them."},{"p":24,"t":"Do not make friends with an angry person, and do not associate with a wrathful person,"},{"p":25,"t":"lest you learn his ways and entangle yourself in a snare."},{"p":26,"t":"Do not be one who strikes hands in pledge or who puts up security for debts."},{"p":27,"t":"If you do not have enough to pay, your bed will be taken right out from under you!"},{"p":28,"t":"Do not move an ancient boundary stone which was put in place by your ancestors."},{"p":29,"t":"Do you see a person skilled in his work? He will take his position before kings; he will not take his position before obscure people."}],[{"p":1,"t":"When you sit down to eat with a ruler, consider carefully what is before you,"},{"p":2,"t":"and put a knife to your throat if you possess a large appetite."},{"p":3,"t":"Do not crave that ruler’s delicacies, for that food is deceptive."},{"p":4,"t":"Do not wear yourself out to become rich; be wise enough to restrain yourself."},{"p":5,"t":"When you gaze upon riches, they are gone, for they surely make wings for themselves, and fly off into the sky like an eagle!"},{"p":6,"t":"Do not eat the food of a stingy person, do not crave his delicacies;"},{"p":7,"t":"for he is like someone calculating the cost in his mind. “Eat and drink,” he says to you, but his heart is not with you;"},{"p":8,"t":"you will vomit up the little bit you have eaten, and will have wasted your pleasant words."},{"p":9,"t":"Do not speak in the ears of a fool, for he will despise the wisdom of your words."},{"p":10,"t":"Do not move an ancient boundary stone, or take over the fields of the fatherless,"},{"p":11,"t":"for their Protector is strong; he will plead their case against you."},{"p":12,"t":"Apply your heart to instruction and your ears to the words of knowledge."},{"p":13,"t":"Do not withhold discipline from a child; even if you strike him with the rod, he will not die. "},{"p":14,"t":"If you strike him with the rod, you will deliver him from death."},{"p":15,"t":"My child, if your heart is wise, then my heart also will be glad;"},{"p":16,"t":"my soul will rejoice when your lips speak what is right."},{"p":17,"t":"Do not let your heart envy sinners, but rather be zealous in fearing the Lord all the time."},{"p":18,"t":"For surely there is a future, and your hope will not be cut off."},{"p":19,"t":"Listen, my child, and be wise, and guide your heart on the right way."},{"p":20,"t":"Do not spend time among drunkards, among those who eat too much meat,"},{"p":21,"t":"because drunkards and gluttons become impoverished, and drowsiness clothes them with rags."},{"p":22,"t":"Listen to your father who begot you, and do not despise your mother when she is old."},{"p":23,"t":"Acquire truth and do not sell it &#8211; wisdom, and discipline, and understanding."},{"p":24,"t":"The father of a righteous person will rejoice greatly; whoever fathers a wise child will have joy in him."},{"p":25,"t":"May your father and your mother have joy; may she who bore you rejoice."},{"p":26,"t":"Give me your heart, my son, and let your eyes observe my ways;"},{"p":27,"t":"for a prostitute is like a deep pit; a harlot is like a narrow well."},{"p":28,"t":"Indeed, she lies in wait like a robber, and increases the unfaithful among men."},{"p":29,"t":"Who has woe? Who has sorrow? Who has contentions? Who has complaints? Who has wounds without cause? Who has dullness of the eyes?"},{"p":30,"t":"Those who linger over wine, those who go looking for mixed wine."},{"p":31,"t":"Do not look on the wine when it is red, when it sparkles in the cup, when it goes down smoothly."},{"p":32,"t":"Afterward it bites like a snake, and stings like a viper."},{"p":33,"t":"Your eyes will see strange things, and your mind will speak perverse things."},{"p":34,"t":"And you will be like one who lies down in the midst of the sea, and like one who lies down on the top of the rigging."},{"p":35,"t":"You will say, “They have struck me, but I am not harmed! They beat me, but I did not know it! When will I awake? I will look for another drink.”"}],[{"p":1,"t":"Do not envy evil people, do not desire to be with them;"},{"p":2,"t":"for their hearts contemplate violence, and their lips speak harm."},{"p":3,"t":"By wisdom a house is built, and through understanding it is established;"},{"p":4,"t":"by knowledge its rooms are filled with all kinds of precious and pleasing treasures."},{"p":5,"t":"A wise warrior is strong, and a man of knowledge makes his strength stronger;"},{"p":6,"t":"for with guidance you wage your war, and with numerous advisers there is victory."},{"p":7,"t":"Wisdom is unattainable for a fool; in court he does not open his mouth."},{"p":8,"t":"The one who plans to do evil will be called a scheming person."},{"p":9,"t":"A foolish scheme is sin, and the scorner is an abomination to people."},{"p":10,"t":"If you faint in the day of trouble, your strength is small!"},{"p":11,"t":"Deliver those being taken away to death, and hold back those slipping to the slaughter."},{"p":12,"t":"If you say, “But we did not know about this,” does not the one who evaluates hearts consider? Does not the one who guards your life know? Will he not repay each person according to his deeds?"},{"p":13,"t":"Eat honey, my child, for it is good, and honey from the honeycomb is sweet to your taste."},{"p":14,"t":"Likewise, know that wisdom is sweet to your soul; if you find it, you will have a future, and your hope will not be cut off."},{"p":15,"t":"Do not lie in wait like the wicked against the place where the righteous live; do not assault his home."},{"p":16,"t":"Although a righteous person may fall seven times, he gets up again, but the wicked will be brought down by calamity."},{"p":17,"t":"Do not rejoice when your enemy falls, and when he stumbles do not let your heart rejoice,"},{"p":18,"t":"lest the Lord see it, and be displeased, and turn his wrath away from him."},{"p":19,"t":"Do not fret because of evil people or be envious of wicked people,"},{"p":20,"t":"for the evil person has no future, and the lamp of the wicked will be extinguished."},{"p":21,"t":"Fear the Lord, my child, as well as the king, and do not associate with rebels,"},{"p":22,"t":"for suddenly their destruction will overtake them, and who knows the ruinous judgment both the Lord and the king can bring?"},{"p":23,"t":"These sayings also are from the wise: To show partiality in judgment is terrible:"},{"p":24,"t":"The one who says to the guilty, “You are innocent,” peoples will curse him, and nations will denounce him."},{"p":25,"t":"But there will be delight for those who convict the guilty, and a pleasing blessing will come on them."},{"p":26,"t":"Like a kiss on the lips is the one who gives an honest answer."},{"p":27,"t":"Establish your work outside and get your fields ready; afterward build your house."},{"p":28,"t":"Do not be a witness against your neighbor without cause, and do not deceive with your words."},{"p":29,"t":"Do not say, “I will do to him just as he has done to me; I will pay him back according to what he has done.”"},{"p":30,"t":"I passed by the field of a sluggard, by the vineyard of one who lacks wisdom."},{"p":31,"t":"I saw that thorns had grown up all over it, the ground was covered with weeds, and its stone wall was broken down."},{"p":32,"t":"When I saw this, I gave careful consideration to it; I received instruction from what I saw:"},{"p":33,"t":"“A little sleep, a little slumber, a little folding of the hands to relax,"},{"p":34,"t":"and your poverty will come like a bandit, and your need like an armed robber.”"}],[{"p":1,"t":"These also are proverbs of Solomon, which the men of King Hezekiah of Judah copied:"},{"p":2,"t":"It is the glory of God to conceal a matter, and it is the glory of a king to search out a matter."},{"p":3,"t":"As the heaven is high and the earth is deep so the hearts of kings are unsearchable."},{"p":4,"t":"Remove the dross from the silver, and material for the silversmith will emerge;"},{"p":5,"t":"remove the wicked from before the king, and his throne will be established in righteousness."},{"p":6,"t":"Do not honor yourself before the king, and do not stand in the place of great men;"},{"p":7,"t":"for it is better for him to say to you, “Come up here,” than to put you lower before a prince, whom your eyes have seen."},{"p":8,"t":"Do not go out hastily to litigation, or what will you do afterward when your neighbor puts you to shame?"},{"p":9,"t":"When you argue a case with your neighbor, do not reveal the secret of another person,"},{"p":10,"t":"lest the one who hears it put you to shame and your infamy will never go away."},{"p":11,"t":"Like apples of gold in settings of silver, so is a word skillfully spoken."},{"p":12,"t":"Like an earring of gold and an ornament of fine gold, so is a wise reprover to the ear of the one who listens."},{"p":13,"t":"Like the cold of snow in the time of harvest, so is a faithful messenger to those who send him, for he refreshes the heart of his masters."},{"p":14,"t":"Like cloudy skies and wind that produce no rain, so is the one who boasts of a gift not given."},{"p":15,"t":"Through patience a ruler can be persuaded, and a soft tongue can break a bone."},{"p":16,"t":"When you find honey, eat only what is sufficient for you, lest you become stuffed with it and vomit it up."},{"p":17,"t":"Don’t set foot too frequently in your neighbor’s house, lest he become weary of you and hate you."},{"p":18,"t":"Like a club or a sword or a sharp arrow, so is the one who testifies against his neighbor as a false witness."},{"p":19,"t":"Like a bad tooth or a foot out of joint, so is confidence in an unfaithful person at the time of trouble."},{"p":20,"t":"Like one who takes off a garment on a cold day, or like vinegar poured on soda, so is one who sings songs to a heavy heart."},{"p":21,"t":"If your enemy is hungry, give him food to eat, and if he is thirsty, give him water to drink,"},{"p":22,"t":"for you will heap coals of fire on his head, and the Lord will reward you."},{"p":23,"t":"The north wind brings forth rain, and a gossiping tongue brings forth an angry look."},{"p":24,"t":"It is better to live on a corner of the housetop than in a house in company with a quarrelsome wife."},{"p":25,"t":"Like cold water to a weary person, so is good news from a distant land."},{"p":26,"t":"Like a muddied spring and a polluted well, so is a righteous person who gives way before the wicked."},{"p":27,"t":"It is not good to eat too much honey, nor is it honorable for people to seek their own glory."},{"p":28,"t":"Like a city that is broken down and without a wall, so is a person who cannot control his temper."}],[{"p":1,"t":"Like snow in summer or rain in harvest, so honor is not fitting for a fool."},{"p":2,"t":"Like a fluttering bird or like a flying swallow, so a curse without cause does not come to rest."},{"p":3,"t":"A whip for the horse and a bridle for the donkey, and a rod for the backs of fools!"},{"p":4,"t":"Do not answer a fool according to his folly, lest you yourself also be like him."},{"p":5,"t":"Answer a fool according to his folly, lest he be wise in his own estimation."},{"p":6,"t":"Like cutting off the feet or drinking violence, so is sending a message by the hand of a fool."},{"p":7,"t":"Like legs that hang limp from the lame, so is a proverb in the mouth of fools."},{"p":8,"t":"Like tying a stone in a sling, so is giving honor to a fool."},{"p":9,"t":"Like a thorn that goes into the hand of a drunkard, so is a proverb in the mouth of a fool."},{"p":10,"t":"Like an archer who wounds at random, so is the one who hires a fool or hires any passer-by."},{"p":11,"t":"Like a dog that returns to its vomit, so a fool repeats his folly."},{"p":12,"t":"Do you see a man wise in his own eyes? There is more hope for a fool than for him."},{"p":13,"t":"The sluggard says, “There is a lion in the road! A lion in the streets!”"},{"p":14,"t":"Like a door that turns on its hinges, so a sluggard turns on his bed."},{"p":15,"t":"The sluggard plunges his hand in the dish; he is too lazy to bring it back to his mouth."},{"p":16,"t":"The sluggard is wiser in his own estimation than seven people who respond with good sense."},{"p":17,"t":"Like one who grabs a wild dog by the ears, so is the person passing by who becomes furious over a quarrel not his own."},{"p":18,"t":"Like a madman who shoots firebrands and deadly arrows,"},{"p":19,"t":"so is a person who deceives his neighbor, and says, “Was I not only joking?”"},{"p":20,"t":"Where there is no wood, a fire goes out, and where there is no gossip, contention ceases."},{"p":21,"t":"Like charcoal is to burning coals, and wood to fire, so is a contentious person to kindle strife."},{"p":22,"t":"The words of a gossip are like delicious morsels; they go down into a person’s innermost being."},{"p":23,"t":"Like a coating of glaze over earthenware are fervent lips with an evil heart."},{"p":24,"t":"The one who hates others disguises it with his lips, but he stores up deceit within him."},{"p":25,"t":"When he speaks graciously, do not believe him, for there are seven abominations within him."},{"p":26,"t":"Though his hatred may be concealed by deceit, his evil will be uncovered in the assembly."},{"p":27,"t":"The one who digs a pit will fall into it; the one who rolls a stone &#8211; it will come back on him."},{"p":28,"t":"A lying tongue hates those crushed by it, and a flattering mouth works ruin."}],[{"p":1,"t":"Do not boast about tomorrow; for you do not know what a day may bring forth."},{"p":2,"t":"Let another praise you, and not your own mouth; someone else, and not your own lips."},{"p":3,"t":"A stone is heavy and sand is weighty, but vexation by a fool is more burdensome than the two of them."},{"p":4,"t":"Wrath is cruel and anger is overwhelming, but who can stand before jealousy?"},{"p":5,"t":"Better is open rebuke than hidden love."},{"p":6,"t":"Faithful are the wounds of a friend, but the kisses of an enemy are excessive."},{"p":7,"t":"The one whose appetite is satisfied loathes honey, but to the hungry mouth every bitter thing is sweet."},{"p":8,"t":"Like a bird that wanders from its nest, so is a person who wanders from his home."},{"p":9,"t":"Ointment and incense make the heart rejoice, likewise the sweetness of one’s friend from sincere counsel."},{"p":10,"t":"Do not forsake your friend and your father’s friend, and do not enter your brother’s house in the day of your disaster; a neighbor nearby is better than a brother far away."},{"p":11,"t":"Be wise, my son, and make my heart glad, so that I may answer anyone who taunts me."},{"p":12,"t":"A shrewd person sees danger and hides himself, but the naive keep right on going and suffer for it."},{"p":13,"t":"Take a man’s garment when he has given security for a stranger, and when he gives surety for a stranger, hold him in pledge."},{"p":14,"t":"If someone blesses his neighbor with a loud voice early in the morning, it will be counted as a curse to him."},{"p":15,"t":"A continual dripping on a rainy day and a contentious wife are alike."},{"p":16,"t":"Whoever hides her hides the wind or grasps oil with his right hand."},{"p":17,"t":"As iron sharpens iron, so a person sharpens his friend."},{"p":18,"t":"The one who tends a fig tree will eat its fruit, and whoever takes care of his master will be honored."},{"p":19,"t":"As in water the face is reflected as a face, so a person’s heart reflects the person."},{"p":20,"t":"As Death and Destruction are never satisfied, so the eyes of a person are never satisfied."},{"p":21,"t":"As the crucible is for silver and the furnace is for gold, so a person is proved by the praise he receives."},{"p":22,"t":"If you should pound the fool in the mortar among the grain with the pestle, his foolishness would not depart from him."},{"p":23,"t":"Pay careful attention to the condition of your flocks, give careful attention to your herds,"},{"p":24,"t":"for riches do not last forever, nor does a crown last from generation to generation."},{"p":25,"t":"When the hay is removed and new grass appears, and the grass from the hills is gathered in,"},{"p":26,"t":"the lambs will be for your clothing, and the goats will be for the price of a field."},{"p":27,"t":"And there will be enough goat’s milk for your food, for the food of your household, and for the sustenance of your servant girls."}],[{"p":1,"t":"The wicked person flees when there is no one pursuing, but the righteous person is as confident as a lion."},{"p":2,"t":"When a country is rebellious it has many princes, but by someone who is discerning and knowledgeable order is maintained."},{"p":3,"t":"A poor person who oppresses the weak is like a driving rain without food."},{"p":4,"t":"Those who forsake the law praise the wicked, but those who keep the law contend with them."},{"p":5,"t":"Evil people do not understand justice, but those who seek the Lord understand it all."},{"p":6,"t":"A poor person who walks in his integrity is better than one who is perverse in his ways even though he is rich."},{"p":7,"t":"The one who keeps the law is a discerning child, but a companion of gluttons brings shame to his parents."},{"p":8,"t":"The one who increases his wealth by increasing interest gathers it for someone who is gracious to the needy."},{"p":9,"t":"The one who turns away his ear from hearing the law, even his prayer is an abomination."},{"p":10,"t":"The one who leads the upright astray in an evil way will himself fall into his own pit, but the blameless will inherit what is good."},{"p":11,"t":"A rich person is wise in his own eyes, but a discerning poor person can evaluate him properly."},{"p":12,"t":"When the righteous rejoice, great is the glory, but when the wicked rise to power, people are sought out."},{"p":13,"t":"The one who covers his transgressions will not prosper, but whoever confesses them and forsakes them will find mercy."},{"p":14,"t":"Blessed is the one who is always cautious, but whoever hardens his heart will fall into evil."},{"p":15,"t":"Like a roaring lion or a roving bear, so is a wicked ruler over a poor people."},{"p":16,"t":"The prince who is a great oppressor lacks wisdom, but the one who hates unjust gain will prolong his days."},{"p":17,"t":"The one who is tormented by the murder of another will flee to the pit; let no one support him."},{"p":18,"t":"The one who walks blamelessly will be delivered, but whoever is perverse in his ways will fall at once."},{"p":19,"t":"The one who works his land will be satisfied with food, but whoever chases daydreams will have his fill of poverty."},{"p":20,"t":"A faithful person will have an abundance of blessings, but the one who hastens to gain riches will not go unpunished."},{"p":21,"t":"To show partiality is terrible, for a person will transgress over the smallest piece of bread."},{"p":22,"t":"The stingy person hastens after riches and does not know that poverty will overtake him."},{"p":23,"t":"The one who reproves another will in the end find more favor than the one who flatters with the tongue."},{"p":24,"t":"The one who robs his father and mother and says, “There is no transgression,” is a companion to the one who destroys."},{"p":25,"t":"The greedy person stirs up dissension, but the one who trusts in the Lord will prosper."},{"p":26,"t":"The one who trusts in his own heart is a fool, but the one who walks in wisdom will escape."},{"p":27,"t":"The one who gives to the poor will not lack, but whoever shuts his eyes to them will receive many curses."},{"p":28,"t":"When the wicked gain control, people hide themselves, but when they perish, the righteous increase."}],[{"p":1,"t":"The one who stiffens his neck after numerous rebukes will suddenly be destroyed without remedy."},{"p":2,"t":"When the righteous become numerous, the people rejoice; when the wicked rule, the people groan."},{"p":3,"t":"The man who loves wisdom brings joy to his father, but whoever associates with prostitutes wastes his wealth."},{"p":4,"t":"A king brings stability to a land by justice, but one who exacts tribute tears it down."},{"p":5,"t":"The one who flatters his neighbor spreads a net for his steps."},{"p":6,"t":"In the transgression of an evil person there is a snare, but a righteous person can sing and rejoice."},{"p":7,"t":"The righteous person cares for the legal rights of the poor; the wicked does not understand such knowledge."},{"p":8,"t":"Scornful people inflame a city, but those who are wise turn away wrath."},{"p":9,"t":"If a wise person goes to court with a foolish person, there is no peace whether he is angry or laughs."},{"p":10,"t":"Bloodthirsty people hate someone with integrity; as for the upright, they seek his life."},{"p":11,"t":"A fool lets fly with all his temper, but a wise person keeps it back."},{"p":12,"t":"If a ruler listens to lies, all his ministers will be wicked."},{"p":13,"t":"The poor person and the oppressor have this in common: the Lord gives light to the eyes of them both."},{"p":14,"t":"If a king judges the poor in truth, his throne will be established forever."},{"p":15,"t":"A rod and reproof impart wisdom, but a child who is unrestrained brings shame to his mother."},{"p":16,"t":"When the wicked increase, transgression increases, but the righteous will see their downfall."},{"p":17,"t":"Discipline your child, and he will give you rest; he will bring you happiness."},{"p":18,"t":"When there is no prophetic vision the people cast off restraint, but the one who keeps the law, blessed is he!"},{"p":19,"t":"A servant cannot be corrected by words, for although he understands, there is no answer."},{"p":20,"t":"Do you see someone who is hasty in his words? There is more hope for a fool than for him."},{"p":21,"t":"If someone pampers his servant from youth, he will be a weakling in the end."},{"p":22,"t":"An angry person stirs up dissension, and a wrathful person is abounding in transgression."},{"p":23,"t":"A person’s pride will bring him low, but one who has a lowly spirit will gain honor."},{"p":24,"t":"Whoever shares with a thief is his own enemy; he hears the oath to testify, but does not talk."},{"p":25,"t":"The fear of people becomes a snare, but whoever trusts in the Lord will be set on high."},{"p":26,"t":"Many people seek the face of a ruler, but it is from the Lord that one receives justice."},{"p":27,"t":"An unjust person is an abomination to the righteous, and the one who lives an upright life is an abomination to the wicked."}],[{"p":1,"t":"The words of Agur, the son of Jakeh; an oracle: This man says to Ithiel, to Ithiel and to Ukal:"},{"p":2,"t":"Surely I am more brutish than any other human being, and I do not have human understanding;"},{"p":3,"t":"I have not learned wisdom, nor do I have knowledge of the Holy One."},{"p":4,"t":"Who has ascended into heaven, and then descended? Who has gathered up the winds in his fists? Who has bound up the waters in his cloak? Who has established all the ends of the earth? What is his name, and what is his son’s name? &#8211; if you know!"},{"p":5,"t":"Every word of God is purified; he is like a shield for those who take refuge in him."},{"p":6,"t":"Do not add to his words, lest he reprove you, and prove you to be a liar."},{"p":7,"t":"Two things I ask from you; do not refuse me before I die:"},{"p":8,"t":"Remove falsehood and lies far from me; do not give me poverty or riches, feed me with my allotted portion of bread,"},{"p":9,"t":"lest I become satisfied and act deceptively and say, “Who is the Lord?” Or lest I become poor and steal and demean the name of my God."},{"p":10,"t":"Do not slander a servant to his master, lest he curse you, and you are found guilty."},{"p":11,"t":"There is a generation who curse their fathers and do not bless their mothers."},{"p":12,"t":"There is a generation who are pure in their own eyes and yet are not washed from their filthiness."},{"p":13,"t":"There is a generation whose eyes are so lofty, and whose eyelids are lifted up disdainfully."},{"p":14,"t":"There is a generation whose teeth are like swords and whose molars are like knives to devour the poor from the earth and the needy from among the human race."},{"p":15,"t":"The leech has two daughters: “Give! Give!” There are three things that are never satisfied, four that never say, “Enough” &#8211;"},{"p":16,"t":"the grave, the barren womb, land that is not satisfied with water, and fire that never says, “Enough!”"},{"p":17,"t":"The eye that mocks at a father and despises obeying a mother &#8211; the ravens of the valley will peck it out and the young vultures will eat it."},{"p":18,"t":"There are three things that are too wonderful for me, four that I do not understand:"},{"p":19,"t":"the way of an eagle in the sky, the way of a snake on a rock, the way of a ship in the sea, and the way of a man with a woman."},{"p":20,"t":"This is the way of an adulterous woman: she eats and wipes her mouth and says, “I have not done wrong.”"},{"p":21,"t":"Under three things the earth trembles, and under four things it cannot bear up:"},{"p":22,"t":"under a servant who becomes king, under a fool who is stuffed with food,"},{"p":23,"t":"under an unloved woman who is married, and under a female servant who dispossesses her mistress."},{"p":24,"t":"There are four things on earth that are small, but they are exceedingly wise:"},{"p":25,"t":"ants are creatures with little strength, but they prepare their food in the summer;"},{"p":26,"t":"rock badgers are creatures with little power, but they make their homes in the crags;"},{"p":27,"t":"locusts have no king, but they all go forward by ranks;"},{"p":28,"t":"a lizard you can catch with the hand, but it gets into the palaces of the king."},{"p":29,"t":"There are three things that are magnificent in their step, four things that move about magnificently:"},{"p":30,"t":"a lion, mightiest of the beasts, who does not retreat from anything;"},{"p":31,"t":"a strutting rooster, a male goat, and a king with his army around him."},{"p":32,"t":"If you have done foolishly by exalting yourself or if you have planned evil, put your hand over your mouth!"},{"p":33,"t":"For as the churning of milk produces butter and as punching the nose produces blood, so stirring up anger produces strife."}],[{"p":1,"t":"The words of King Lemuel, an oracle that his mother taught him:"},{"p":2,"t":"O my son, O son of my womb, O son of my vows,"},{"p":3,"t":"Do not give your strength to women, nor your ways to that which ruins kings."},{"p":4,"t":"It is not for kings, O Lemuel, it is not for kings to drink wine, or for rulers to crave strong drink,"},{"p":5,"t":"lest they drink and forget what is decreed, and remove from all the poor their legal rights."},{"p":6,"t":"Give strong drink to the one who is perishing, and wine to those who are bitterly distressed;"},{"p":7,"t":"let them drink and forget their poverty, and remember their misery no more."},{"p":8,"t":"Open your mouth on behalf of those unable to speak, for the legal rights of all the dying."},{"p":9,"t":"Open your mouth, judge in righteousness, and plead the cause of the poor and needy."},{"p":10,"t":"Who can find a wife of noble character? For her value is far more than rubies."},{"p":11,"t":"The heart of her husband has confidence in her, and he has no lack of gain."},{"p":12,"t":"She brings him good and not evil all the days of her life."},{"p":13,"t":"She obtains wool and flax, and she is pleased to work with her hands."},{"p":14,"t":"She is like the merchant ships; she brings her food from afar."},{"p":15,"t":"She also gets up while it is still night, and provides food for her household and a portion to her female servants."},{"p":16,"t":"She considers a field and buys it; from her own income she plants a vineyard."},{"p":17,"t":"She begins her work vigorously, and she strengthens her arms."},{"p":18,"t":"She knows that her merchandise is good, and her lamp does not go out in the night."},{"p":19,"t":"Her hands take hold of the distaff, and her hands grasp the spindle."},{"p":20,"t":"She extends her hand to the poor, and reaches out her hand to the needy."},{"p":21,"t":"She is not afraid of the snow for her household, for all of her household are clothed with scarlet."},{"p":22,"t":"She makes for herself coverlets; her clothing is fine linen and purple."},{"p":23,"t":"Her husband is well-known in the city gate when he sits with the elders of the land."},{"p":24,"t":"She makes linen garments and sells them, and supplies the merchants with sashes."},{"p":25,"t":"She is clothed with strength and honor, and she can laugh at the time to come."},{"p":26,"t":"She opens her mouth with wisdom, and loving instruction is on her tongue."},{"p":27,"t":"She watches over the ways of her household, and does not eat the bread of idleness."},{"p":28,"t":"Her children rise up and call her blessed, her husband also praises her:"},{"p":29,"t":"“Many daughters have done valiantly, but you surpass them all!”"},{"p":30,"t":"Charm is deceitful and beauty is fleeting, but a woman who fears the Lord will be praised."},{"p":31,"t":"Give her credit for what she has accomplished, and let her works praise her in the city gates."}]]