[[{"p":1,"t":"How blessed is the one who does not follow the advice of the wicked, or stand in the pathway with sinners, or sit in the assembly of scoffers!"},{"p":2,"t":"Instead he finds pleasure in obeying the Lord’s commands; he meditates on his commands day and night."},{"p":3,"t":"He is like a tree planted by flowing streams; it yields its fruit at the proper time, and its leaves never fall off. He succeeds in everything he attempts."},{"p":4,"t":"Not so with the wicked! Instead they are like wind-driven chaff."},{"p":5,"t":"For this reason the wicked cannot withstand judgment, nor can sinners join the assembly of the godly."},{"p":6,"t":"Certainly the Lord guards the way of the godly, but the way of the wicked ends in destruction."}],[{"p":1,"t":"Why do the nations rebel? Why are the countries devising plots that will fail?"},{"p":2,"t":"The kings of the earth form a united front; the rulers collaborate against the Lord and his anointed king."},{"p":3,"t":"They say, “Let’s tear off the shackles they’ve put on us! Let’s free ourselves from their ropes!”"},{"p":4,"t":"The one enthroned in heaven laughs in disgust; the Lord taunts them."},{"p":5,"t":"Then he angrily speaks to them and terrifies them in his rage, saying,"},{"p":6,"t":"“I myself have installed my king on Zion, my holy hill.”"},{"p":7,"t":"The king says, “I will announce the Lord’s decree. He said to me: ‘You are my son! This very day I have become your father!"},{"p":8,"t":"Ask me, and I will give you the nations as your inheritance, the ends of the earth as your personal property."},{"p":9,"t":"You will break them with an iron scepter; you will smash them like a potter’s jar!’”"},{"p":10,"t":"So now, you kings, do what is wise; you rulers of the earth, submit to correction!"},{"p":11,"t":"Serve the Lord in fear! Repent in terror!"},{"p":12,"t":"Give sincere homage! Otherwise he will be angry, and you will die because of your behavior, when his anger quickly ignites. How blessed are all who take shelter in him!"}],[{"p":1,"t":"A psalm of David, written when he fled from his son Absalom. Lord, how numerous are my enemies! Many attack me."},{"p":2,"t":"Many say about me, “God will not deliver him.” (Selah)"},{"p":3,"t":"But you, Lord, are a shield that protects me; you are my glory and the one who restores me."},{"p":4,"t":"To the Lord I cried out, and he answered me from his holy hill. (Selah)"},{"p":5,"t":"I rested and slept; I awoke, for the Lord protects me."},{"p":6,"t":"I am not afraid of the multitude of people who attack me from all directions."},{"p":7,"t":"Rise up, Lord! Deliver me, my God! Yes, you will strike all my enemies on the jaw; you will break the teeth of the wicked."},{"p":8,"t":"The Lord delivers; you show favor to your people. (Selah)"}],[{"p":1,"t":"For the music director, to be accompanied by stringed instruments; a psalm of David. When I call out, answer me, O God who vindicates me! Though I am hemmed in, you will lead me into a wide, open place. Have mercy on me and respond to my prayer!"},{"p":2,"t":"You men, how long will you try to turn my honor into shame? How long will you love what is worthless and search for what is deceptive? (Selah)"},{"p":3,"t":"Realize that the Lord shows the godly special favor; the Lord responds when I cry out to him."},{"p":4,"t":"Tremble with fear and do not sin! Meditate as you lie in bed, and repent of your ways! (Selah)"},{"p":5,"t":"Offer the prescribed sacrifices and trust in the Lord!"},{"p":6,"t":"Many say, “Who can show us anything good?” Smile upon us, Lord!"},{"p":7,"t":"You make me happier than those who have abundant grain and wine."},{"p":8,"t":"I will lie down and sleep peacefully, for you, Lord, make me safe and secure."}],[{"p":1,"t":"For the music director, to be accompanied by wind instruments; a psalm of David. Listen to what I say, Lord! Carefully consider my complaint!"},{"p":2,"t":"Pay attention to my cry for help, my king and my God, for I am praying to you!"},{"p":3,"t":"Lord, in the morning you will hear me; in the morning I will present my case to you and then wait expectantly for an answer."},{"p":4,"t":"Certainly you are not a God who approves of evil; evil people cannot dwell with you."},{"p":5,"t":"Arrogant people cannot stand in your presence; you hate all who behave wickedly."},{"p":6,"t":"You destroy liars; the Lord despises violent and deceitful people."},{"p":7,"t":"But as for me, because of your great faithfulness I will enter your house; I will bow down toward your holy temple as I worship you."},{"p":8,"t":"Lord, lead me in your righteousness because of those who wait to ambush me, remove the obstacles in the way in which you are guiding me!"},{"p":9,"t":"For they do not speak the truth; their stomachs are like the place of destruction, their throats like an open grave, their tongues like a steep slope leading into it."},{"p":10,"t":"Condemn them, O God! May their own schemes be their downfall! Drive them away because of their many acts of insurrection, for they have rebelled against you."},{"p":11,"t":"But may all who take shelter in you be happy! May they continually shout for joy! Shelter them so that those who are loyal to you may rejoice!"},{"p":12,"t":"Certainly you reward the godly, Lord. Like a shield you protect them in your good favor."}],[{"p":1,"t":"For the music director, to be accompanied by stringed instruments, according to the sheminith style; a psalm of David. Lord, do not rebuke me in your anger! Do not discipline me in your raging fury!"},{"p":2,"t":"Have mercy on me, Lord, for I am frail! Heal me, Lord, for my bones are shaking!"},{"p":3,"t":"I am absolutely terrified, and you, Lord &#8211; how long will this continue?"},{"p":4,"t":"Relent, Lord, rescue me! Deliver me because of your faithfulness!"},{"p":5,"t":"For no one remembers you in the realm of death, In Sheol who gives you thanks?"},{"p":6,"t":"I am exhausted as I groan; all night long I drench my bed in tears; my tears saturate the cushion beneath me."},{"p":7,"t":"My eyes grow dim from suffering; they grow weak because of all my enemies."},{"p":8,"t":"Turn back from me, all you who behave wickedly, for the Lord has heard the sound of my weeping!"},{"p":9,"t":"The Lord has heard my appeal for mercy; the Lord has accepted my prayer."},{"p":10,"t":"May all my enemies be humiliated and absolutely terrified! May they turn back and be suddenly humiliated!"}],[{"p":1,"t":"A musical composition by David, which he sang to the Lord concerning a Benjaminite named Cush. O Lord my God, in you I have taken shelter. Deliver me from all who chase me! Rescue me!"},{"p":2,"t":"Otherwise they will rip me to shreds like a lion; they will tear me to bits and no one will be able to rescue me."},{"p":3,"t":"O Lord my God, if I have done what they say, or am guilty of unjust actions,"},{"p":4,"t":"or have wronged my ally, or helped his lawless enemy,"},{"p":5,"t":"may an enemy relentlessly chase me and catch me; may he trample me to death and leave me lying dishonored in the dust. (Selah)"},{"p":6,"t":"Stand up angrily, Lord! Rise up with raging fury against my enemies! Wake up for my sake and execute the judgment you have decreed for them!"},{"p":7,"t":"The countries are assembled all around you; take once more your rightful place over them!"},{"p":8,"t":"The Lord judges the nations. Vindicate me, Lord, because I am innocent, because I am blameless, O Exalted One!"},{"p":9,"t":"May the evil deeds of the wicked come to an end! But make the innocent secure, O righteous God, you who examine inner thoughts and motives!"},{"p":10,"t":"The Exalted God is my shield, the one who delivers the morally upright."},{"p":11,"t":"God is a just judge; he is angry throughout the day."},{"p":12,"t":"If a person does not repent, God sharpens his sword and prepares to shoot his bow."},{"p":13,"t":"He prepares to use deadly weapons against him; he gets ready to shoot flaming arrows."},{"p":14,"t":"See the one who is pregnant with wickedness, who conceives destructive plans, and gives birth to harmful lies &#8211; "},{"p":15,"t":"he digs a pit and then falls into the hole he has made."},{"p":16,"t":"He becomes the victim of his own destructive plans and the violence he intended for others falls on his own head."},{"p":17,"t":"I will thank the Lord for his justice; I will sing praises to the sovereign Lord!"}],[{"p":1,"t":"For the music director, according to the gittith style; a psalm of David. O Lord, our Lord, how magnificent is your reputation throughout the earth! You reveal your majesty in the heavens above!"},{"p":2,"t":"From the mouths of children and nursing babies you have ordained praise on account of your adversaries, so that you might put an end to the vindictive enemy."},{"p":3,"t":"When I look up at the heavens, which your fingers made, and see the moon and the stars, which you set in place,"},{"p":4,"t":"Of what importance is the human race, that you should notice them? Of what importance is mankind, that you should pay attention to them,"},{"p":5,"t":"and make them a little less than the heavenly beings? You grant mankind honor and majesty;"},{"p":6,"t":"you appoint them to rule over your creation; you have placed everything under their authority,"},{"p":7,"t":"including all the sheep and cattle, as well as the wild animals,"},{"p":8,"t":"the birds in the sky, the fish in the sea and everything that moves through the currents of the seas."},{"p":9,"t":"O Lord, our Lord, how magnificent is your reputation throughout the earth!"}],[{"p":1,"t":"For the music director; according to the alumoth-labben style; a psalm of David. I will thank the Lord with all my heart! I will tell about all your amazing deeds!"},{"p":2,"t":"I will be happy and rejoice in you! I will sing praises to you, O sovereign One!"},{"p":3,"t":"When my enemies turn back, they trip and are defeated before you."},{"p":4,"t":"For you defended my just cause; from your throne you pronounced a just decision."},{"p":5,"t":"You terrified the nations with your battle cry; you destroyed the wicked; you permanently wiped out all memory of them."},{"p":6,"t":"The enemy’s cities have been reduced to permanent ruins; you destroyed their cities; all memory of the enemies has perished."},{"p":7,"t":"But the Lord rules forever; he reigns in a just manner."},{"p":8,"t":"He judges the world fairly; he makes just legal decisions for the nations."},{"p":9,"t":"Consequently the Lord provides safety for the oppressed; he provides safety in times of trouble."},{"p":10,"t":"Your loyal followers trust in you, for you, Lord, do not abandon those who seek your help."},{"p":11,"t":"Sing praises to the Lord, who rules in Zion! Tell the nations what he has done!"},{"p":12,"t":"For the one who takes revenge against murderers took notice of the oppressed; he did not overlook their cry for help"},{"p":13,"t":"when they prayed: “Have mercy on me, Lord! See how I am oppressed by those who hate me, O one who can snatch me away from the gates of death!"},{"p":14,"t":"Then I will tell about all your praiseworthy acts; in the gates of Daughter Zion I will rejoice because of your deliverance.”"},{"p":15,"t":"The nations fell into the pit they had made; their feet were caught in the net they had hidden."},{"p":16,"t":"The Lord revealed himself; he accomplished justice; the wicked were ensnared by their own actions. (Higgaion. Selah)"},{"p":17,"t":"The wicked are turned back and sent to Sheol; this is the destiny of all the nations that ignore God,"},{"p":18,"t":"for the needy are not permanently ignored, the hopes of the oppressed are not forever dashed."},{"p":19,"t":"Rise up, Lord! Don’t let men be defiant! May the nations be judged in your presence!"},{"p":20,"t":"Terrify them, Lord! Let the nations know they are mere mortals! (Selah)"}],[{"p":1,"t":"Why, Lord, do you stand far off? Why do you pay no attention during times of trouble?"},{"p":2,"t":"The wicked arrogantly chase the oppressed; the oppressed are trapped by the schemes the wicked have dreamed up."},{"p":3,"t":"Yes, the wicked man boasts because he gets what he wants; the one who robs others curses and rejects the Lord."},{"p":4,"t":"The wicked man is so arrogant he always thinks, “God won’t hold me accountable; he doesn’t care.”"},{"p":5,"t":"He is secure at all times. He has no regard for your commands; he disdains all his enemies."},{"p":6,"t":"He says to himself, “I will never be upended, because I experience no calamity.”"},{"p":7,"t":"His mouth is full of curses and deceptive, harmful words; his tongue injures and destroys."},{"p":8,"t":"He waits in ambush near the villages; in hidden places he kills the innocent. His eyes look for some unfortunate victim."},{"p":9,"t":"He lies in ambush in a hidden place, like a lion in a thicket; he lies in ambush, waiting to catch the oppressed; he catches the oppressed by pulling in his net."},{"p":10,"t":"His victims are crushed and beaten down; they are trapped in his sturdy nets."},{"p":11,"t":"He says to himself, “God overlooks it; he does not pay attention; he never notices.”"},{"p":12,"t":"Rise up, Lord! O God, strike him down! Do not forget the oppressed!"},{"p":13,"t":"Why does the wicked man reject God? He says to himself, “You will not hold me accountable.”"},{"p":14,"t":"You have taken notice, for you always see one who inflicts pain and suffering. The unfortunate victim entrusts his cause to you; you deliver the fatherless."},{"p":15,"t":"Break the arm of the wicked and evil man! Hold him accountable for his wicked deeds, which he thought you would not discover."},{"p":16,"t":"The Lord rules forever! The nations are driven out of his land."},{"p":17,"t":"Lord, you have heard the request of the oppressed; you make them feel secure because you listen to their prayer."},{"p":18,"t":"You defend the fatherless and oppressed, so that mere mortals may no longer terrorize them."}],[{"p":1,"t":"For the music director; by David. In the Lord I have taken shelter. How can you say to me, “Flee to a mountain like a bird!"},{"p":2,"t":"For look, the wicked prepare their bows, they put their arrows on the strings, to shoot in the darkness at the morally upright."},{"p":3,"t":"When the foundations are destroyed, what can the godly accomplish?”"},{"p":4,"t":"The Lord is in his holy temple; the Lord’s throne is in heaven. His eyes watch; his eyes examine all people."},{"p":5,"t":"The Lord approves of the godly, but he hates the wicked and those who love to do violence."},{"p":6,"t":"May the Lord rain down burning coals and brimstone on the wicked! A whirlwind is what they deserve!"},{"p":7,"t":"Certainly the Lord is just; he rewards godly deeds; the upright will experience his favor."}],[{"p":1,"t":"For the music director; according to the sheminith style; a psalm of David. Deliver, Lord! For the godly have disappeared; people of integrity have vanished."},{"p":2,"t":"People lie to one another; they flatter and deceive."},{"p":3,"t":"May the Lord cut off all flattering lips, and the tongue that boasts!"},{"p":4,"t":"They say, “We speak persuasively; we know how to flatter and boast. Who is our master?”"},{"p":5,"t":"“Because of the violence done to the oppressed, because of the painful cries of the needy, I will spring into action,” says the Lord. “I will provide the safety they so desperately desire.”"},{"p":6,"t":"The Lord’s words are absolutely reliable. They are as untainted as silver purified in a furnace on the ground, where it is thoroughly refined."},{"p":7,"t":"You, Lord, will protect them; you will continually shelter each one from these evil people,"},{"p":8,"t":"for the wicked seem to be everywhere, when people promote evil."}],[{"p":1,"t":"For the music director; a psalm of David. How long, Lord, will you continue to ignore me? How long will you pay no attention to me?"},{"p":2,"t":"How long must I worry, and suffer in broad daylight? How long will my enemy gloat over me?"},{"p":3,"t":"Look at me! Answer me, O Lord my God! Revive me, or else I will die!"},{"p":4,"t":"Then my enemy will say, “I have defeated him!” Then my foes will rejoice because I am upended."},{"p":5,"t":"But I trust in your faithfulness. May I rejoice because of your deliverance!"},{"p":6,"t":"I will sing praises to the Lord when he vindicates me."}],[{"p":1,"t":"For the music director; by David. Fools say to themselves, “There is no God.” They sin and commit evil deeds; none of them does what is right."},{"p":2,"t":"The Lord looks down from heaven at the human race, to see if there is anyone who is wise and seeks God."},{"p":3,"t":"Everyone rejects God; they are all morally corrupt. None of them does what is right, not even one!"},{"p":4,"t":"All those who behave wickedly do not understand &#8211;  those who devour my people as if they were eating bread, and do not call out to the Lord."},{"p":5,"t":"They are absolutely terrified, for God defends the godly."},{"p":6,"t":"You want to humiliate the oppressed, even though the Lord is their shelter."},{"p":7,"t":"I wish the deliverance of Israel would come from Zion! When the Lord restores the well-being of his people, may Jacob rejoice, may Israel be happy!"}],[{"p":1,"t":"A psalm of David. Lord, who may be a guest in your home? Who may live on your holy hill?"},{"p":2,"t":"Whoever lives a blameless life, does what is right, and speaks honestly."},{"p":3,"t":"He does not slander, or do harm to others, or insult his neighbor."},{"p":4,"t":"He despises a reprobate, but honors the Lord’s loyal followers. He makes firm commitments and does not renege on his promise."},{"p":5,"t":"He does not charge interest when he lends his money. He does not take bribes to testify against the innocent. The one who lives like this will never be upended."}],[{"p":1,"t":"A prayer of David. Protect me, O God, for I have taken shelter in you."},{"p":2,"t":"I say to the Lord, “You are the Lord, my only source of well-being.”"},{"p":3,"t":"As for God’s chosen people who are in the land, and the leading officials I admired so much &#8211;"},{"p":4,"t":"their troubles multiply, they desire other gods. I will not pour out drink offerings of blood to their gods, nor will I make vows in the name of their gods."},{"p":5,"t":"Lord, you give me stability and prosperity; you make my future secure."},{"p":6,"t":"It is as if I have been given fertile fields or received a beautiful tract of land."},{"p":7,"t":"I will praise the Lord who guides me; yes, during the night I reflect and learn."},{"p":8,"t":"I constantly trust in the Lord; because he is at my right hand, I will not be upended."},{"p":9,"t":"So my heart rejoices and I am happy; My life is safe."},{"p":10,"t":"You will not abandon me to Sheol; you will not allow your faithful follower to see the Pit."},{"p":11,"t":"You lead me in the path of life; I experience absolute joy in your presence; you always give me sheer delight."}],[{"p":1,"t":"A prayer of David. Lord, consider my just cause! Pay attention to my cry for help! Listen to the prayer I sincerely offer!"},{"p":2,"t":"Make a just decision on my behalf! Decide what is right!"},{"p":3,"t":"You have scrutinized my inner motives; you have examined me during the night. You have carefully evaluated me, but you find no sin. I am determined I will say nothing sinful."},{"p":4,"t":"As for the actions of people &#8211; just as you have commanded, I have not followed in the footsteps of violent men."},{"p":5,"t":"I carefully obey your commands; I do not deviate from them."},{"p":6,"t":"I call to you for you will answer me, O God. Listen to me! Hear what I say!"},{"p":7,"t":"Accomplish awesome, faithful deeds, you who powerfully deliver those who look to you for protection from their enemies."},{"p":8,"t":"Protect me as you would protect the pupil of your eye! Hide me in the shadow of your wings!"},{"p":9,"t":"Protect me from the wicked men who attack me, my enemies who crowd around me for the kill."},{"p":10,"t":"They are calloused; they speak arrogantly."},{"p":11,"t":"They attack me, now they surround me; they intend to throw me to the ground."},{"p":12,"t":"He is like a lion that wants to tear its prey to bits, like a young lion crouching in hidden places."},{"p":13,"t":"Rise up, Lord! Confront him! Knock him down! Use your sword to rescue me from the wicked man!"},{"p":14,"t":"Lord, use your power to deliver me from these murderers, from the murderers of this world! They enjoy prosperity; you overwhelm them with the riches they desire. They have many children, and leave their wealth to their offspring."},{"p":15,"t":"As for me, because I am innocent I will see your face; when I awake you will reveal yourself to me."}],[{"p":1,"t":"For the music director; by the Lord’s servant David, who sang to the Lord the words of this song when the Lord rescued him from the power of all his enemies, including Saul. He said: “I love you, Lord, my source of strength!"},{"p":2,"t":"The Lord is my high ridge, my stronghold, my deliverer. My God is my rocky summit where I take shelter, my shield, the horn that saves me, and my refuge."},{"p":3,"t":"I called to the Lord, who is worthy of praise, and I was delivered from my enemies."},{"p":4,"t":"The waves of death engulfed me, the currents of chaos overwhelmed me."},{"p":5,"t":"The ropes of Sheol tightened around me, the snares of death trapped me."},{"p":6,"t":"In my distress I called to the Lord; I cried out to my God. From his heavenly temple he heard my voice; he listened to my cry for help."},{"p":7,"t":"The earth heaved and shook; the roots of the mountains trembled; they heaved because he was angry."},{"p":8,"t":"Smoke ascended from his nose; fire devoured as it came from his mouth; he hurled down fiery coals."},{"p":9,"t":"He made the sky sink as he descended; a thick cloud was under his feet."},{"p":10,"t":"He mounted a winged angel and flew; he glided on the wings of the wind."},{"p":11,"t":"He shrouded himself in darkness, in thick rain clouds."},{"p":12,"t":"From the brightness in front of him came hail and fiery coals."},{"p":13,"t":"The Lord thundered in the sky; the sovereign One shouted."},{"p":14,"t":"He shot his arrows and scattered them, many lightning bolts and routed them."},{"p":15,"t":"The depths of the sea were exposed; the inner regions of the world were uncovered by your battle cry, Lord, by the powerful breath from your nose."},{"p":16,"t":"He reached down from above and took hold of me; he pulled me from the surging water."},{"p":17,"t":"He rescued me from my strong enemy, from those who hate me, for they were too strong for me."},{"p":18,"t":"They confronted me in my day of calamity, but the Lord helped me."},{"p":19,"t":"He brought me out into a wide open place; he delivered me because he was pleased with me."},{"p":20,"t":"The Lord repaid me for my godly deeds; he rewarded my blameless behavior."},{"p":21,"t":"For I have obeyed the Lord’s commands; I have not rebelled against my God."},{"p":22,"t":"For I am aware of all his regulations, and I do not reject his rules."},{"p":23,"t":"I was innocent before him, and kept myself from sinning."},{"p":24,"t":"The Lord rewarded me for my godly deeds; he took notice of my blameless behavior."},{"p":25,"t":"You prove to be loyal to one who is faithful; you prove to be trustworthy to one who is innocent."},{"p":26,"t":"You prove to be reliable to one who is blameless, but you prove to be deceptive to one who is perverse."},{"p":27,"t":"For you deliver oppressed people, but you bring down those who have a proud look."},{"p":28,"t":"Indeed, you are my lamp, Lord. My God illuminates the darkness around me."},{"p":29,"t":"Indeed, with your help I can charge against an army; by my God’s power I can jump over a wall."},{"p":30,"t":"The one true God acts in a faithful manner; the Lord’s promise is reliable; he is a shield to all who take shelter in him."},{"p":31,"t":"Indeed, who is God besides the Lord? Who is a protector besides our God?"},{"p":32,"t":"The one true God gives me strength; he removes the obstacles in my way."},{"p":33,"t":"He gives me the agility of a deer; he enables me to negotiate the rugged terrain."},{"p":34,"t":"He trains my hands for battle; my arms can bend even the strongest bow."},{"p":35,"t":"You give me your protective shield; your right hand supports me; your willingness to help enables me to prevail."},{"p":36,"t":"You widen my path; my feet do not slip."},{"p":37,"t":"I chase my enemies and catch them; I do not turn back until I wipe them out."},{"p":38,"t":"I beat them to death; they fall at my feet."},{"p":39,"t":"You give me strength for battle; you make my foes kneel before me."},{"p":40,"t":"You make my enemies retreat; I destroy those who hate me."},{"p":41,"t":"They cry out, but there is no one to help them; they cry out to the Lord, but he does not answer them."},{"p":42,"t":"I grind them as fine windblown dust; I beat them underfoot like clay in the streets."},{"p":43,"t":"You rescue me from a hostile army; you make me a leader of nations; people over whom I had no authority are now my subjects."},{"p":44,"t":"When they hear of my exploits, they submit to me. Foreigners are powerless before me;"},{"p":45,"t":"foreigners lose their courage; they shake with fear as they leave their strongholds."},{"p":46,"t":"The Lord is alive! My protector is praiseworthy! The God who delivers me is exalted as king!"},{"p":47,"t":"The one true God completely vindicates me; he makes nations submit to me."},{"p":48,"t":"He delivers me from my enemies; you snatch me away from those who attack me; you rescue me from violent men."},{"p":49,"t":"So I will give you thanks before the nations, O Lord! I will sing praises to you!"},{"p":50,"t":"He gives his chosen king magnificent victories; he is faithful to his chosen ruler, to David and his descendants forever.”"}],[{"p":1,"t":"For the music director; a psalm of David. The heavens declare the glory of God; the sky displays his handiwork."},{"p":2,"t":"Day after day it speaks out; night after night it reveals his greatness."},{"p":3,"t":"There is no actual speech or word, nor is its voice literally heard."},{"p":4,"t":"Yet its voice echoes throughout the earth; its words carry to the distant horizon. In the sky he has pitched a tent for the sun."},{"p":5,"t":"Like a bridegroom it emerges from its chamber; like a strong man it enjoys running its course."},{"p":6,"t":"It emerges from the distant horizon, and goes from one end of the sky to the other; nothing can escape its heat."},{"p":7,"t":"The law of the Lord is perfect and preserves one’s life. The rules set down by the Lord are reliable and impart wisdom to the inexperienced."},{"p":8,"t":"The Lord’s precepts are fair and make one joyful. The Lord’s commands are pure and give insight for life."},{"p":9,"t":"The commands to fear the Lord are right and endure forever. The judgments given by the Lord are trustworthy and absolutely just."},{"p":10,"t":"They are of greater value than gold, than even a great amount of pure gold; they bring greater delight than honey, than even the sweetest honey from a honeycomb."},{"p":11,"t":"Yes, your servant finds moral guidance there; those who obey them receive a rich reward."},{"p":12,"t":"Who can know all his errors? Please do not punish me for sins I am unaware of."},{"p":13,"t":"Moreover, keep me from committing flagrant sins; do not allow such sins to control me. Then I will be blameless, and innocent of blatant rebellion."},{"p":14,"t":"May my words and my thoughts be acceptable in your sight, O Lord, my sheltering rock and my redeemer."}],[{"p":1,"t":"For the music director; a psalm of David. May the Lord answer you when you are in trouble; may the God of Jacob make you secure!"},{"p":2,"t":"May he send you help from his temple; from Zion may he give you support!"},{"p":3,"t":"May he take notice of your offerings; may he accept your burnt sacrifice! (Selah)"},{"p":4,"t":"May he grant your heart’s desire; may he bring all your plans to pass!"},{"p":5,"t":"Then we will shout for joy over your victory; we will rejoice in the name of our God! May the Lord grant all your requests!"},{"p":6,"t":"Now I am sure that the Lord will deliver his chosen king; he will intervene for him from his holy heavenly temple, and display his mighty ability to deliver."},{"p":7,"t":"Some trust in chariots and others in horses, but we depend on the Lord our God."},{"p":8,"t":"They will fall down, but we will stand firm."},{"p":9,"t":"The Lord will deliver the king; he will answer us when we call to him for help!"}],[{"p":1,"t":"For the music director; a psalm of David. O Lord, the king rejoices in the strength you give; he takes great delight in the deliverance you provide."},{"p":2,"t":"You grant him his heart’s desire; you do not refuse his request. (Selah)"},{"p":3,"t":"For you bring him rich blessings; you place a golden crown on his head."},{"p":4,"t":"He asked you to sustain his life, and you have granted him long life and an enduring dynasty."},{"p":5,"t":"Your deliverance brings him great honor; you give him majestic splendor."},{"p":6,"t":"For you grant him lasting blessings; you give him great joy by allowing him into your presence."},{"p":7,"t":"For the king trusts in the Lord, and because of the sovereign Lord’s faithfulness he is not upended."},{"p":8,"t":"You prevail over all your enemies; your power is too great for those who hate you."},{"p":9,"t":"You burn them up like a fiery furnace when you appear; the Lord angrily devours them; the fire consumes them."},{"p":10,"t":"You destroy their offspring from the earth, their descendants from among the human race."},{"p":11,"t":"Yes, they intend to do you harm; they dream up a scheme, but they do not succeed."},{"p":12,"t":"For you make them retreat when you shoot your arrows at them."},{"p":13,"t":"Rise up, O Lord, in strength! We will sing and praise your power!"}],[{"p":1,"t":"For the music director; according to the tune “Morning Doe;” a psalm of David. My God, my God, why have you abandoned me? I groan in prayer, but help seems far away."},{"p":2,"t":"My God, I cry out during the day, but you do not answer, and during the night my prayers do not let up."},{"p":3,"t":"You are holy; you sit as king receiving the praises of Israel."},{"p":4,"t":"In you our ancestors trusted; they trusted in you and you rescued them."},{"p":5,"t":"To you they cried out, and they were saved; in you they trusted and they were not disappointed."},{"p":6,"t":"But I am a worm, not a man; people insult me and despise me."},{"p":7,"t":"All who see me taunt me; they mock me and shake their heads."},{"p":8,"t":"They say, “Commit yourself to the Lord! Let the Lord rescue him! Let the Lord deliver him, for he delights in him.”"},{"p":9,"t":"Yes, you are the one who brought me out from the womb and made me feel secure on my mother’s breasts."},{"p":10,"t":"I have been dependent on you since birth; from the time I came out of my mother’s womb you have been my God."},{"p":11,"t":"Do not remain far away from me, for trouble is near and I have no one to help me."},{"p":12,"t":"Many bulls surround me; powerful bulls of Bashan hem me in."},{"p":13,"t":"They open their mouths to devour me like a roaring lion that rips its prey."},{"p":14,"t":"My strength drains away like water; all my bones are dislocated; my heart is like wax; it melts away inside me."},{"p":15,"t":"The roof of my mouth is as dry as a piece of pottery; my tongue sticks to my gums. You set me in the dust of death."},{"p":16,"t":"Yes, wild dogs surround me &#8211; a gang of evil men crowd around me; like a lion they pin my hands and feet."},{"p":17,"t":"I can count all my bones; my enemies are gloating over me in triumph."},{"p":18,"t":"They are dividing up my clothes among themselves; they are rolling dice for my garments."},{"p":19,"t":"But you, O Lord, do not remain far away! You are my source of strength! Hurry and help me!"},{"p":20,"t":"Deliver me from the sword! Save my life from the claws of the wild dogs!"},{"p":21,"t":"Rescue me from the mouth of the lion, and from the horns of the wild oxen! You have answered me!"},{"p":22,"t":"I will declare your name to my countrymen! In the middle of the assembly I will praise you!"},{"p":23,"t":"You loyal followers of the Lord, praise him! All you descendants of Jacob, honor him! All you descendants of Israel, stand in awe of him!"},{"p":24,"t":"For he did not despise or detest the suffering of the oppressed; he did not ignore him; when he cried out to him, he responded."},{"p":25,"t":"You are the reason I offer praise in the great assembly; I will fulfill my promises before the Lord’s loyal followers."},{"p":26,"t":"Let the oppressed eat and be filled! Let those who seek his help praise the Lord! May you live forever!"},{"p":27,"t":"Let all the people of the earth acknowledge the Lord and turn to him! Let all the nations worship you!"},{"p":28,"t":"For the Lord is king and rules over the nations."},{"p":29,"t":"All of the thriving people of the earth will join the celebration and worship; all those who are descending into the grave will bow before him, including those who cannot preserve their lives."},{"p":30,"t":"A whole generation will serve him; they will tell the next generation about the sovereign Lord."},{"p":31,"t":"They will come and tell about his saving deeds; they will tell a future generation what he has accomplished."}],[{"p":1,"t":"A psalm of David. The Lord is my shepherd, I lack nothing."},{"p":2,"t":"He takes me to lush pastures, he leads me to refreshing water."},{"p":3,"t":"He restores my strength. He leads me down the right paths for the sake of his reputation."},{"p":4,"t":"Even when I must walk through the darkest valley, I fear no danger, for you are with me; your rod and your staff reassure me."},{"p":5,"t":"You prepare a feast before me in plain sight of my enemies. You refresh my head with oil; my cup is completely full."},{"p":6,"t":"Surely your goodness and faithfulness will pursue me all my days, and I will live in the Lord’s house for the rest of my life."}],[{"p":1,"t":"A psalm of David. The Lord owns the earth and all it contains, the world and all who live in it."},{"p":2,"t":"For he set its foundation upon the seas, and established it upon the ocean currents."},{"p":3,"t":"Who is allowed to ascend the mountain of the Lord? Who may go up to his holy dwelling place?"},{"p":4,"t":"The one whose deeds are blameless and whose motives are pure, who does not lie, or make promises with no intention of keeping them."},{"p":5,"t":"Such godly people are rewarded by the Lord, and vindicated by the God who delivers them."},{"p":6,"t":"Such purity characterizes the people who seek his favor, Jacob’s descendants, who pray to him. (Selah)"},{"p":7,"t":"Look up, you gates! Rise up, you eternal doors! Then the majestic king will enter!"},{"p":8,"t":"Who is this majestic king? The Lord who is strong and mighty! The Lord who is mighty in battle!"},{"p":9,"t":"Look up, you gates! Rise up, you eternal doors! Then the majestic king will enter!"},{"p":10,"t":"Who is this majestic king? The Lord who commands armies! He is the majestic king! (Selah)"}],[{"p":1,"t":"By David. O Lord, I come before you in prayer."},{"p":2,"t":"My God, I trust in you. Please do not let me be humiliated; do not let my enemies triumphantly rejoice over me!"},{"p":3,"t":"Certainly none who rely on you will be humiliated. Those who deal in treachery will be thwarted and humiliated."},{"p":4,"t":"Make me understand your ways, O Lord! Teach me your paths!"},{"p":5,"t":"Guide me into your truth and teach me. For you are the God who delivers me; on you I rely all day long."},{"p":6,"t":"Remember your compassionate and faithful deeds, O Lord, for you have always acted in this manner."},{"p":7,"t":"Do not hold against me the sins of my youth or my rebellious acts! Because you are faithful to me, extend to me your favor, O Lord!"},{"p":8,"t":"The Lord is both kind and fair; that is why he teaches sinners the right way to live."},{"p":9,"t":"May he show the humble what is right! May he teach the humble his way!"},{"p":10,"t":"The Lord always proves faithful and reliable to those who follow the demands of his covenant."},{"p":11,"t":"For the sake of your reputation, O Lord, forgive my sin, because it is great."},{"p":12,"t":"The Lord shows his faithful followers the way they should live."},{"p":13,"t":"They experience his favor; their descendants inherit the land."},{"p":14,"t":"The Lord’s loyal followers receive his guidance, and he reveals his covenantal demands to them."},{"p":15,"t":"I continually look to the Lord for help, for he will free my feet from the enemy’s net."},{"p":16,"t":"Turn toward me and have mercy on me, for I am alone and oppressed!"},{"p":17,"t":"Deliver me from my distress; rescue me from my suffering!"},{"p":18,"t":"See my pain and suffering! Forgive all my sins!"},{"p":19,"t":"Watch my enemies, for they outnumber me; they hate me and want to harm me."},{"p":20,"t":"Protect me and deliver me! Please do not let me be humiliated, for I have taken shelter in you!"},{"p":21,"t":"May integrity and godliness protect me, for I rely on you!"},{"p":22,"t":"O God, rescue Israel from all their distress!"}],[{"p":1,"t":"By David. Vindicate me, O Lord, for I have integrity, and I trust in the Lord without wavering."},{"p":2,"t":"Examine me, O Lord, and test me! Evaluate my inner thoughts and motives!"},{"p":3,"t":"For I am ever aware of your faithfulness, and your loyalty continually motivates me."},{"p":4,"t":"I do not associate with deceitful men, or consort with those who are dishonest."},{"p":5,"t":"I hate the mob of evil men, and do not associate with the wicked."},{"p":6,"t":"I maintain a pure lifestyle, so I can appear before your altar, O Lord,"},{"p":7,"t":"to give you thanks, and to tell about all your amazing deeds."},{"p":8,"t":"O Lord, I love the temple where you live, the place where your splendor is revealed."},{"p":9,"t":"Do not sweep me away with sinners, or execute me along with violent people,"},{"p":10,"t":"who are always ready to do wrong or offer a bribe."},{"p":11,"t":"But I have integrity! Rescue me and have mercy on me!"},{"p":12,"t":"I am safe, and among the worshipers I will praise the Lord."}],[{"p":1,"t":"By David. The Lord delivers and vindicates me! I fear no one! The Lord protects my life! I am afraid of no one!"},{"p":2,"t":"When evil men attack me to devour my flesh, when my adversaries and enemies attack me, they stumble and fall."},{"p":3,"t":"Even when an army is deployed against me, I do not fear. Even when war is imminent, I remain confident."},{"p":4,"t":"I have asked the Lord for one thing &#8211; this is what I desire! I want to live in the Lord’s house all the days of my life, so I can gaze at the splendor of the Lord and contemplate in his temple."},{"p":5,"t":"He will surely give me shelter in the day of danger; he will hide me in his home; he will place me on an inaccessible rocky summit."},{"p":6,"t":"Now I will triumph over my enemies who surround me! I will offer sacrifices in his dwelling place and shout for joy! I will sing praises to the Lord!"},{"p":7,"t":"Hear me, O Lord, when I cry out! Have mercy on me and answer me!"},{"p":8,"t":"My heart tells me to pray to you, and I do pray to you, O Lord."},{"p":9,"t":"Do not reject me! Do not push your servant away in anger! You are my deliverer! Do not forsake or abandon me, O God who vindicates me!"},{"p":10,"t":"Even if my father and mother abandoned me, the Lord would take me in."},{"p":11,"t":"Teach me how you want me to live; lead me along a level path because of those who wait to ambush me!"},{"p":12,"t":"Do not turn me over to my enemies, for false witnesses who want to destroy me testify against me."},{"p":13,"t":"Where would I be if I did not believe I would experience the Lord’s favor in the land of the living?"},{"p":14,"t":"Rely on the Lord! Be strong and confident! Rely on the Lord!"}],[{"p":1,"t":"By David. To you, O Lord, I cry out! My protector, do not ignore me! If you do not respond to me, I will join those who are descending into the grave."},{"p":2,"t":"Hear my plea for mercy when I cry out to you for help, when I lift my hands toward your holy temple!"},{"p":3,"t":"Do not drag me away with evil men, with those who behave wickedly, who talk so friendly to their neighbors, while they plan to harm them!"},{"p":4,"t":"Pay them back for their evil deeds! Pay them back for what they do! Punish them!"},{"p":5,"t":"For they do not understand the Lord’s actions, or the way he carries out justice. The Lord will permanently demolish them."},{"p":6,"t":"The Lord deserves praise, for he has heard my plea for mercy!"},{"p":7,"t":"The Lord strengthens and protects me; I trust in him with all my heart. I am rescued and my heart is full of joy; I will sing to him in gratitude."},{"p":8,"t":"The Lord strengthens his people; he protects and delivers his chosen king."},{"p":9,"t":"Deliver your people! Empower the nation that belongs to you! Care for them like a shepherd and carry them in your arms at all times!"}],[{"p":1,"t":"A psalm of David. Acknowledge the Lord, you heavenly beings, acknowledge the Lord’s majesty and power!"},{"p":2,"t":"Acknowledge the majesty of the Lord’s reputation! Worship the Lord in holy attire!"},{"p":3,"t":"The Lord’s shout is heard over the water; the majestic God thunders, the Lord appears over the surging water."},{"p":4,"t":"The Lord’s shout is powerful, the Lord’s shout is majestic."},{"p":5,"t":"The Lord’s shout breaks the cedars, the Lord shatters the cedars of Lebanon."},{"p":6,"t":"He makes Lebanon skip like a calf and Sirion like a young ox."},{"p":7,"t":"The Lord’s shout strikes with flaming fire."},{"p":8,"t":"The Lord’s shout shakes the wilderness, the Lord shakes the wilderness of Kadesh."},{"p":9,"t":"The Lord’s shout bends the large trees and strips the leaves from the forests. Everyone in his temple says, “Majestic!”"},{"p":10,"t":"The Lord sits enthroned over the engulfing waters, the Lord sits enthroned as the eternal king."},{"p":11,"t":"The Lord gives his people strength; the Lord grants his people security."}],[{"p":1,"t":"A psalm &#8211; a song used at the dedication of the temple; by David. I will praise you, O Lord, for you lifted me up, and did not allow my enemies to gloat over me."},{"p":2,"t":"O Lord my God, I cried out to you and you healed me."},{"p":3,"t":"O Lord, you pulled me up from Sheol; you rescued me from among those descending into the grave."},{"p":4,"t":"Sing to the Lord, you faithful followers of his; give thanks to his holy name."},{"p":5,"t":"For his anger lasts only a brief moment, and his good favor restores one’s life. One may experience sorrow during the night, but joy arrives in the morning."},{"p":6,"t":"In my self-confidence I said, “I will never be upended.”"},{"p":7,"t":"O Lord, in your good favor you made me secure. Then you rejected me and I was terrified."},{"p":8,"t":"To you, O Lord, I cried out; I begged the Lord for mercy:"},{"p":9,"t":"“What profit is there in taking my life, in my descending into the Pit? Can the dust of the grave praise you? Can it declare your loyalty?"},{"p":10,"t":"Hear, O Lord, and have mercy on me! O Lord, deliver me!”"},{"p":11,"t":"Then you turned my lament into dancing; you removed my sackcloth and covered me with joy."},{"p":12,"t":"So now my heart will sing to you and not be silent; O Lord my God, I will always give thanks to you."}],[{"p":1,"t":"For the music director; a psalm of David. In you, O Lord, I have taken shelter! Never let me be humiliated! Vindicate me by rescuing me!"},{"p":2,"t":"Listen to me! Quickly deliver me! Be my protector and refuge, a stronghold where I can be safe!"},{"p":3,"t":"For you are my high ridge and my stronghold; for the sake of your own reputation you lead me and guide me."},{"p":4,"t":"You will free me from the net they hid for me, for you are my place of refuge."},{"p":5,"t":"Into your hand I entrust my life; you will rescue me, O Lord, the faithful God."},{"p":6,"t":"I hate those who serve worthless idols, but I trust in the Lord."},{"p":7,"t":"I will be happy and rejoice in your faithfulness, because you notice my pain and you are aware of how distressed I am."},{"p":8,"t":"You do not deliver me over to the power of the enemy; you enable me to stand in a wide open place."},{"p":9,"t":"Have mercy on me, for I am in distress! My eyes grow dim from suffering. I have lost my strength."},{"p":10,"t":"For my life nears its end in pain; my years draw to a close as I groan. My strength fails me because of my sin, and my bones become brittle."},{"p":11,"t":"Because of all my enemies, people disdain me; my neighbors are appalled by my suffering &#8211; those who know me are horrified by my condition; those who see me in the street run away from me."},{"p":12,"t":"I am forgotten, like a dead man no one thinks about; I am regarded as worthless, like a broken jar."},{"p":13,"t":"For I hear what so many are saying, the terrifying news that comes from every direction. When they plot together against me, they figure out how they can take my life."},{"p":14,"t":"But I trust in you, O Lord! I declare, “You are my God!”"},{"p":15,"t":"You determine my destiny! Rescue me from the power of my enemies and those who chase me."},{"p":16,"t":"Smile on your servant! Deliver me because of your faithfulness!"},{"p":17,"t":"O Lord, do not let me be humiliated, for I call out to you! May evil men be humiliated! May they go wailing to the grave!"},{"p":18,"t":"May lying lips be silenced &#8211; lips that speak defiantly against the innocent with arrogance and contempt!"},{"p":19,"t":"How great is your favor, which you store up for your loyal followers! In plain sight of everyone you bestow it on those who take shelter in you."},{"p":20,"t":"You hide them with you, where they are safe from the attacks of men; you conceal them in a shelter, where they are safe from slanderous attacks."},{"p":21,"t":"The Lord deserves praise for he demonstrated his amazing faithfulness to me when I was besieged by enemies."},{"p":22,"t":"I jumped to conclusions and said, “I am cut off from your presence!” But you heard my plea for mercy when I cried out to you for help."},{"p":23,"t":"Love the Lord, all you faithful followers of his! The Lord protects those who have integrity, but he pays back in full the one who acts arrogantly."},{"p":24,"t":"Be strong and confident, all you who wait on the Lord!"}],[{"p":1,"t":"By David; a well-written song. How blessed is the one whose rebellious acts are forgiven, whose sin is pardoned!"},{"p":2,"t":"How blessed is the one whose wrongdoing the Lord does not punish, in whose spirit there is no deceit."},{"p":3,"t":"When I refused to confess my sin, my whole body wasted away, while I groaned in pain all day long."},{"p":4,"t":"For day and night you tormented me; you tried to destroy me in the intense heat of summer. (Selah)"},{"p":5,"t":"Then I confessed my sin; I no longer covered up my wrongdoing. I said, “I will confess my rebellious acts to the Lord.” And then you forgave my sins. (Selah)"},{"p":6,"t":"For this reason every one of your faithful followers should pray to you while there is a window of opportunity. Certainly when the surging water rises, it will not reach them."},{"p":7,"t":"You are my hiding place; you protect me from distress. You surround me with shouts of joy from those celebrating deliverance. (Selah)"},{"p":8,"t":"I will instruct and teach you about how you should live. I will advise you as I look you in the eye."},{"p":9,"t":"Do not be like an unintelligent horse or mule, which will not obey you unless they are controlled by a bridle and bit."},{"p":10,"t":"An evil person suffers much pain, but the Lord’s faithfulness overwhelms the one who trusts in him."},{"p":11,"t":"Rejoice in the Lord and be happy, you who are godly! Shout for joy, all you who are morally upright!"}],[{"p":1,"t":"You godly ones, shout for joy because of the Lord! It is appropriate for the morally upright to offer him praise."},{"p":2,"t":"Give thanks to the Lord with the harp! Sing to him to the accompaniment of a ten-stringed instrument!"},{"p":3,"t":"Sing to him a new song! Play skillfully as you shout out your praises to him!"},{"p":4,"t":"For the Lord’s decrees are just, and everything he does is fair."},{"p":5,"t":"The Lord promotes equity and justice; the Lord’s faithfulness extends throughout the earth."},{"p":6,"t":"By the Lord’s decree the heavens were made; by a mere word from his mouth all the stars in the sky were created."},{"p":7,"t":"He piles up the water of the sea; he puts the oceans in storehouses."},{"p":8,"t":"Let the whole earth fear the Lord! Let all who live in the world stand in awe of him!"},{"p":9,"t":"For he spoke, and it came into existence, he issued the decree, and it stood firm."},{"p":10,"t":"The Lord frustrates the decisions of the nations; he nullifies the plans of the peoples."},{"p":11,"t":"The Lord’s decisions stand forever; his plans abide throughout the ages."},{"p":12,"t":"How blessed is the nation whose God is the Lord, the people whom he has chosen to be his special possession."},{"p":13,"t":"The Lord watches from heaven; he sees all people."},{"p":14,"t":"From the place where he lives he looks carefully at all the earth’s inhabitants."},{"p":15,"t":"He is the one who forms every human heart, and takes note of all their actions."},{"p":16,"t":"No king is delivered by his vast army; a warrior is not saved by his great might."},{"p":17,"t":"A horse disappoints those who trust in it for victory; despite its great strength, it cannot deliver."},{"p":18,"t":"Look, the Lord takes notice of his loyal followers, those who wait for him to demonstrate his faithfulness"},{"p":19,"t":"by saving their lives from death and sustaining them during times of famine."},{"p":20,"t":"We wait for the Lord; he is our deliverer and shield."},{"p":21,"t":"For our hearts rejoice in him, for we trust in his holy name."},{"p":22,"t":"May we experience your faithfulness, O Lord, for we wait for you."}],[{"p":1,"t":"Written by David, when he pretended to be insane before Abimelech, causing the king to send him away. I will praise the Lord at all times; my mouth will continually praise him."},{"p":2,"t":"I will boast in the Lord; let the oppressed hear and rejoice!"},{"p":3,"t":"Magnify the Lord with me! Let’s praise his name together!"},{"p":4,"t":"I sought the Lord’s help and he answered me; he delivered me from all my fears."},{"p":5,"t":"Those who look to him for help are happy; their faces are not ashamed."},{"p":6,"t":"This oppressed man cried out and the Lord heard; he saved him from all his troubles."},{"p":7,"t":"The Lord’s angel camps around the Lord’s loyal followers and delivers them."},{"p":8,"t":"Taste and see that the Lord is good! How blessed is the one who takes shelter in him!"},{"p":9,"t":"Remain loyal to the Lord, you chosen people of his, for his loyal followers lack nothing!"},{"p":10,"t":"Even young lions sometimes lack food and are hungry, but those who seek the Lord lack no good thing."},{"p":11,"t":"Come children! Listen to me! I will teach you what it means to fear the Lord."},{"p":12,"t":"Do you want to really live? Would you love to live a long, happy life?"},{"p":13,"t":"Then make sure you don’t speak evil words or use deceptive speech!"},{"p":14,"t":"Turn away from evil and do what is right! Strive for peace and promote it!"},{"p":15,"t":"The Lord pays attention to the godly and hears their cry for help."},{"p":16,"t":"But the Lord opposes evildoers and wipes out all memory of them from the earth."},{"p":17,"t":"The godly cry out and the Lord hears; he saves them from all their troubles."},{"p":18,"t":"The Lord is near the brokenhearted; he delivers those who are discouraged."},{"p":19,"t":"The godly face many dangers, but the Lord saves them from each one of them."},{"p":20,"t":"He protects all his bones; not one of them is broken."},{"p":21,"t":"Evil people self-destruct; those who hate the godly are punished."},{"p":22,"t":"The Lord rescues his servants; all who take shelter in him escape punishment."}],[{"p":1,"t":"By David. O Lord, fight those who fight with me! Attack those who attack me!"},{"p":2,"t":"Grab your small shield and large shield, and rise up to help me!"},{"p":3,"t":"Use your spear and lance against those who chase me! Assure me with these words: “I am your deliverer!”"},{"p":4,"t":"May those who seek my life be embarrassed and humiliated! May those who plan to harm me be turned back and ashamed!"},{"p":5,"t":"May they be like wind-driven chaff, as the Lord’s angel attacks them!"},{"p":6,"t":"May their path be dark and slippery, as the Lord’s angel chases them!"},{"p":7,"t":"I did not harm them, but they hid a net to catch me and dug a pit to trap me."},{"p":8,"t":"Let destruction take them by surprise! Let the net they hid catch them! Let them fall into destruction!"},{"p":9,"t":"Then I will rejoice in the Lord and be happy because of his deliverance."},{"p":10,"t":"With all my strength I will say, “O Lord, who can compare to you? You rescue the oppressed from those who try to overpower them; the oppressed and needy from those who try to rob them.”"},{"p":11,"t":"Violent men perjure themselves, and falsely accuse me."},{"p":12,"t":"They repay me evil for the good I have done; I am overwhelmed with sorrow."},{"p":13,"t":"When they were sick, I wore sackcloth, and refrained from eating food. (If I am lying, may my prayers go unanswered!)"},{"p":14,"t":"I mourned for them as I would for a friend or my brother. I bowed down in sorrow as if I were mourning for my mother."},{"p":15,"t":"But when I stumbled, they rejoiced and gathered together; they gathered together to ambush me. They tore at me without stopping to rest."},{"p":16,"t":"When I tripped, they taunted me relentlessly, and tried to bite me."},{"p":17,"t":"O Lord, how long are you going to just stand there and watch this? Rescue me from their destructive attacks; guard my life from the young lions!"},{"p":18,"t":"Then I will give you thanks in the great assembly; I will praise you before a large crowd of people!"},{"p":19,"t":"Do not let those who are my enemies for no reason gloat over me! Do not let those who hate me without cause carry out their wicked schemes!"},{"p":20,"t":"For they do not try to make peace with others, but plan ways to deceive those who are unsuspecting."},{"p":21,"t":"They are ready to devour me; they say, “Aha! Aha! We’ve got you!”"},{"p":22,"t":"But you take notice, Lord! O Lord, do not remain far away from me!"},{"p":23,"t":"Rouse yourself, wake up and vindicate me! My God and Lord, defend my just cause!"},{"p":24,"t":"Vindicate me by your justice, O Lord my God! Do not let them gloat over me!"},{"p":25,"t":"Do not let them say to themselves, “Aha! We have what we wanted!” Do not let them say, “We have devoured him!”"},{"p":26,"t":"May those who want to harm me be totally embarrassed and ashamed! May those who arrogantly taunt me be covered with shame and humiliation!"},{"p":27,"t":"May those who desire my vindication shout for joy and rejoice! May they continually say, “May the Lord be praised, for he wants his servant to be secure.”"},{"p":28,"t":"Then I will tell others about your justice, and praise you all day long."}],[{"p":1,"t":"For the music director; written by the Lord’s servant, David; an oracle. An evil man is rebellious to the core. He does not fear God,"},{"p":2,"t":"for he is too proud to recognize and give up his sin."},{"p":3,"t":"The words he speaks are sinful and deceitful; he does not care about doing what is wise and right."},{"p":4,"t":"He plans ways to sin while he lies in bed; he is committed to a sinful lifestyle; he does not reject what is evil."},{"p":5,"t":"O Lord, your loyal love reaches to the sky; your faithfulness to the clouds."},{"p":6,"t":"Your justice is like the highest mountains, your fairness like the deepest sea; you preserve mankind and the animal kingdom."},{"p":7,"t":"How precious is your loyal love, O God! The human race finds shelter under your wings."},{"p":8,"t":"They are filled with food from your house, and you allow them to drink from the river of your delicacies."},{"p":9,"t":"For you are the one who gives and sustains life."},{"p":10,"t":"Extend your loyal love to your faithful followers, and vindicate the morally upright!"},{"p":11,"t":"Do not let arrogant men overtake me, or let evil men make me homeless!"},{"p":12,"t":"I can see the evildoers! They have fallen! They have been knocked down and are unable to get up!"}],[{"p":1,"t":"By David. Do not fret when wicked men seem to succeed! Do not envy evildoers!"},{"p":2,"t":"For they will quickly dry up like grass, and wither away like plants."},{"p":3,"t":"Trust in the Lord and do what is right! Settle in the land and maintain your integrity!"},{"p":4,"t":"Then you will take delight in the Lord, and he will answer your prayers."},{"p":5,"t":"Commit your future to the Lord! Trust in him, and he will act on your behalf."},{"p":6,"t":"He will vindicate you in broad daylight, and publicly defend your just cause."},{"p":7,"t":"Wait patiently for the Lord! Wait confidently for him! Do not fret over the apparent success of a sinner, a man who carries out wicked schemes!"},{"p":8,"t":"Do not be angry and frustrated! Do not fret! That only leads to trouble!"},{"p":9,"t":"Wicked men will be wiped out, but those who rely on the Lord are the ones who will possess the land."},{"p":10,"t":"Evil men will soon disappear; you will stare at the spot where they once were, but they will be gone."},{"p":11,"t":"But the oppressed will possess the land and enjoy great prosperity."},{"p":12,"t":"Evil men plot against the godly and viciously attack them."},{"p":13,"t":"The Lord laughs in disgust at them, for he knows that their day is coming."},{"p":14,"t":"Evil men draw their swords and prepare their bows, to bring down the oppressed and needy, and to slaughter those who are godly."},{"p":15,"t":"Their swords will pierce their own hearts, and their bows will be broken."},{"p":16,"t":"The little bit that a godly man owns is better than the wealth of many evil men,"},{"p":17,"t":"for evil men will lose their power, but the Lord sustains the godly."},{"p":18,"t":"The Lord watches over the innocent day by day and they possess a permanent inheritance."},{"p":19,"t":"They will not be ashamed when hard times come; when famine comes they will have enough to eat."},{"p":20,"t":"But evil men will die; the Lord’s enemies will be incinerated &#8211; they will go up in smoke."},{"p":21,"t":"Evil men borrow, but do not repay their debt, but the godly show compassion and are generous."},{"p":22,"t":"Surely those favored by the Lord will possess the land, but those rejected by him will be wiped out."},{"p":23,"t":"The Lord grants success to the one whose behavior he finds commendable."},{"p":24,"t":"Even if he trips, he will not fall headlong, for the Lord holds his hand."},{"p":25,"t":"I was once young, now I am old. I have never seen a godly man abandoned, or his children forced to search for food."},{"p":26,"t":"All day long he shows compassion and lends to others, and his children are blessed."},{"p":27,"t":"Turn away from evil! Do what is right! Then you will enjoy lasting security."},{"p":28,"t":"For the Lord promotes justice, and never abandons his faithful followers. They are permanently secure, but the children of evil men are wiped out."},{"p":29,"t":"The godly will possess the land and will dwell in it permanently."},{"p":30,"t":"The godly speak wise words and promote justice."},{"p":31,"t":"The law of their God controls their thinking; their feet do not slip."},{"p":32,"t":"Evil men set an ambush for the godly and try to kill them."},{"p":33,"t":"But the Lord does not surrender the godly, or allow them to be condemned in a court of law."},{"p":34,"t":"Rely on the Lord! Obey his commands! Then he will permit you to possess the land; you will see the demise of evil men."},{"p":35,"t":"I have seen ruthless evil men growing in influence, like a green tree grows in its native soil."},{"p":36,"t":"But then one passes by, and suddenly they have disappeared! I looked for them, but they could not be found."},{"p":37,"t":"Take note of the one who has integrity! Observe the godly! For the one who promotes peace has a future."},{"p":38,"t":"Sinful rebels are totally destroyed; evil men have no future."},{"p":39,"t":"But the Lord delivers the godly; he protects them in times of trouble."},{"p":40,"t":"The Lord helps them and rescues them; he rescues them from evil men and delivers them, for they seek his protection."}],[{"p":1,"t":"A psalm of David, written to get God’s attention. O Lord, do not continue to rebuke me in your anger! Do not continue to punish me in your raging fury!"},{"p":2,"t":"For your arrows pierce me, and your hand presses me down."},{"p":3,"t":"My whole body is sick because of your judgment; I am deprived of health because of my sin."},{"p":4,"t":"For my sins overwhelm me; like a heavy load, they are too much for me to bear."},{"p":5,"t":"My wounds are infected and starting to smell, because of my foolish sins."},{"p":6,"t":"I am dazed and completely humiliated; all day long I walk around mourning."},{"p":7,"t":"For I am overcome with shame and my whole body is sick."},{"p":8,"t":"I am numb with pain and severely battered; I groan loudly because of the anxiety I feel."},{"p":9,"t":"O Lord, you understand my heart’s desire; my groaning is not hidden from you."},{"p":10,"t":"My heart beats quickly; my strength leaves me; I can hardly see."},{"p":11,"t":"Because of my condition, even my friends and acquaintances keep their distance; my neighbors stand far away."},{"p":12,"t":"Those who seek my life try to entrap me; those who want to harm me speak destructive words; all day long they say deceitful things."},{"p":13,"t":"But I am like a deaf man &#8211; I hear nothing; I am like a mute who cannot speak."},{"p":14,"t":"I am like a man who cannot hear and is incapable of arguing his defense."},{"p":15,"t":"Yet I wait for you, O Lord! You will respond, O Lord, my God!"},{"p":16,"t":"I have prayed for deliverance, because otherwise they will gloat over me; when my foot slips they will arrogantly taunt me."},{"p":17,"t":"For I am about to stumble, and I am in constant pain."},{"p":18,"t":"Yes, I confess my wrongdoing, and I am concerned about my sins."},{"p":19,"t":"But those who are my enemies for no reason are numerous; those who hate me without cause outnumber me."},{"p":20,"t":"They repay me evil for the good I have done; though I have tried to do good to them, they hurl accusations at me."},{"p":21,"t":"Do not abandon me, O Lord! My God, do not remain far away from me!"},{"p":22,"t":"Hurry and help me, O Lord, my deliverer!"}],[{"p":1,"t":"For the music director, Jeduthun; a psalm of David. I decided, “I will watch what I say and make sure I do not sin with my tongue. I will put a muzzle over my mouth while in the presence of an evil man.”"},{"p":2,"t":"I was stone silent; I held back the urge to speak. My frustration grew;"},{"p":3,"t":"my anxiety intensified. As I thought about it, I became impatient. Finally I spoke these words:"},{"p":4,"t":"“O Lord, help me understand my mortality and the brevity of life! Let me realize how quickly my life will pass!"},{"p":5,"t":"Look, you make my days short-lived, and my life span is nothing from your perspective. Surely all people, even those who seem secure, are nothing but vapor."},{"p":6,"t":"Surely people go through life as mere ghosts. Surely they accumulate worthless wealth without knowing who will eventually haul it away.”"},{"p":7,"t":"But now, O Lord, upon what am I relying? You are my only hope!"},{"p":8,"t":"Deliver me from all my sins of rebellion! Do not make me the object of fools’ insults!"},{"p":9,"t":"I am silent and cannot open my mouth because of what you have done."},{"p":10,"t":"Please stop wounding me! You have almost beaten me to death!"},{"p":11,"t":"You severely discipline people for their sins; like a moth you slowly devour their strength. Surely all people are a mere vapor. (Selah)"},{"p":12,"t":"Hear my prayer, O Lord! Listen to my cry for help! Do not ignore my sobbing! For I am dependent on you, like one residing outside his native land; I am at your mercy, just as all my ancestors were."},{"p":13,"t":"Turn your angry gaze away from me, so I can be happy before I pass away."}],[{"p":1,"t":"For the music director; By David, a psalm. I relied completely on the Lord, and he turned toward me and heard my cry for help."},{"p":2,"t":"He lifted me out of the watery pit, out of the slimy mud. He placed my feet on a rock and gave me secure footing."},{"p":3,"t":"He gave me reason to sing a new song, praising our God. May many see what God has done, so that they might swear allegiance to him and trust in the Lord!"},{"p":4,"t":"How blessed is the one who trusts in the Lord and does not seek help from the proud or from liars!"},{"p":5,"t":"O Lord, my God, you have accomplished many things; you have done amazing things and carried out your purposes for us. No one can thwart you! I want to declare them and talk about them, but they are too numerous to recount!"},{"p":6,"t":"Receiving sacrifices and offerings are not your primary concern. You make that quite clear to me! You do not ask for burnt sacrifices and sin offerings."},{"p":7,"t":"Then I say, “Look! I come! What is written in the scroll pertains to me."},{"p":8,"t":"I want to do what pleases you, my God. Your law dominates my thoughts.”"},{"p":9,"t":"I have told the great assembly about your justice. Look! I spare no words! O Lord, you know this is true."},{"p":10,"t":"I have not failed to tell about your justice; I spoke about your reliability and deliverance; I have not neglected to tell the great assembly about your loyal love and faithfulness."},{"p":11,"t":"O Lord, you do not withhold your compassion from me. May your loyal love and faithfulness continually protect me!"},{"p":12,"t":"For innumerable dangers surround me. My sins overtake me so I am unable to see; they outnumber the hairs of my head so my strength fails me."},{"p":13,"t":"Please be willing, O Lord, to rescue me! O Lord, hurry and help me!"},{"p":14,"t":"May those who are trying to snatch away my life be totally embarrassed and ashamed! May those who want to harm me be turned back and ashamed!"},{"p":15,"t":"May those who say to me, “Aha! Aha!” be humiliated and disgraced!"},{"p":16,"t":"May all those who seek you be happy and rejoice in you! May those who love to experience your deliverance say continually, “May the Lord be praised!”"},{"p":17,"t":"I am oppressed and needy! May the Lord pay attention to me! You are my helper and my deliverer! O my God, do not delay!"}],[{"p":1,"t":"For the music director; a psalm of David. How blessed is the one who treats the poor properly! When trouble comes, the Lord delivers him."},{"p":2,"t":"May the Lord protect him and save his life! May he be blessed in the land! Do not turn him over to his enemies!"},{"p":3,"t":"The Lord supports him on his sickbed; you completely heal him from his illness."},{"p":4,"t":"As for me, I said: “O Lord, have mercy on me! Heal me, for I have sinned against you!"},{"p":5,"t":"My enemies ask this cruel question about me, ‘When will he finally die and be forgotten?’"},{"p":6,"t":"When someone comes to visit, he pretends to be friendly; he thinks of ways to defame me, and when he leaves he slanders me."},{"p":7,"t":"All who hate me whisper insults about me to one another; they plan ways to harm me."},{"p":8,"t":"They say, ‘An awful disease overwhelms him, and now that he is bed-ridden he will never recover.’"},{"p":9,"t":"Even my close friend whom I trusted, he who shared meals with me, has turned against me."},{"p":10,"t":"As for you, O Lord, have mercy on me and raise me up, so I can pay them back!”"},{"p":11,"t":"By this I know that you are pleased with me, for my enemy does not triumph over me."},{"p":12,"t":"As for me, you uphold me because of my integrity; you allow me permanent access to your presence."},{"p":13,"t":"The Lord God of Israel deserves praise in the future and forevermore! We agree! We agree!"}],[{"p":1,"t":"For the music director; a well-written song by the Korahites. As a deer longs for streams of water, so I long for you, O God!"},{"p":2,"t":"I thirst for God, for the living God. I say, “When will I be able to go and appear in God’s presence?”"},{"p":3,"t":"I cannot eat, I weep day and night; all day long they say to me, “Where is your God?”"},{"p":4,"t":"I will remember and weep! For I was once walking along with the great throng to the temple of God, shouting and giving thanks along with the crowd as we celebrated the holy festival."},{"p":5,"t":"Why are you depressed, O my soul? Why are you upset? Wait for God! For I will again give thanks to my God for his saving intervention."},{"p":6,"t":"I am depressed, so I will pray to you while I am trapped here in the region of the upper Jordan, from Hermon, from Mount Mizar."},{"p":7,"t":"One deep stream calls out to another at the sound of your waterfalls; all your billows and waves overwhelm me."},{"p":8,"t":"By day the Lord decrees his loyal love, and by night he gives me a song, a prayer to the living God."},{"p":9,"t":"I will pray to God, my high ridge: “Why do you ignore me? Why must I walk around mourning because my enemies oppress me?”"},{"p":10,"t":"My enemies’ taunts cut into me to the bone, as they say to me all day long, “Where is your God?”"},{"p":11,"t":"Why are you depressed, O my soul? Why are you upset? Wait for God! For I will again give thanks to my God for his saving intervention."}],[{"p":1,"t":"Vindicate me, O God! Fight for me against an ungodly nation! Deliver me from deceitful and evil men!"},{"p":2,"t":"For you are the God who shelters me. Why do you reject me? Why must I walk around mourning because my enemies oppress me?"},{"p":3,"t":"Reveal your light and your faithfulness! They will lead me, they will escort me back to your holy hill, and to the place where you live."},{"p":4,"t":"Then I will go to the altar of God, to the God who gives me ecstatic joy, so that I express my thanks to you, O God, my God, with a harp."},{"p":5,"t":"Why are you depressed, O my soul? Why are you upset? Wait for God! For I will again give thanks to my God for his saving intervention."}],[{"p":1,"t":"For the music director; by the Korahites, a well-written song. O God, we have clearly heard; our ancestors have told us what you did in their days, in ancient times."},{"p":2,"t":"You, by your power, defeated nations and settled our fathers on their land; you crushed the people living there and enabled our ancestors to occupy it."},{"p":3,"t":"For they did not conquer the land by their swords, and they did not prevail by their strength, but rather by your power, strength and good favor, for you were partial to them."},{"p":4,"t":"You are my king, O God! Decree Jacob’s deliverance!"},{"p":5,"t":"By your power we will drive back our enemies; by your strength we will trample down our foes!"},{"p":6,"t":"For I do not trust in my bow, and I do not prevail by my sword."},{"p":7,"t":"For you deliver us from our enemies; you humiliate those who hate us."},{"p":8,"t":"In God I boast all day long, and we will continually give thanks to your name. (Selah)"},{"p":9,"t":"But you rejected and embarrassed us! You did not go into battle with our armies."},{"p":10,"t":"You made us retreat from the enemy. Those who hate us take whatever they want from us."},{"p":11,"t":"You handed us over like sheep to be eaten; you scattered us among the nations."},{"p":12,"t":"You sold your people for a pittance; you did not ask a high price for them."},{"p":13,"t":"You made us an object of disdain to our neighbors; those who live on our borders taunt and insult us."},{"p":14,"t":"You made us an object of ridicule among the nations; foreigners treat us with contempt."},{"p":15,"t":"All day long I feel humiliated and am overwhelmed with shame,"},{"p":16,"t":"before the vindictive enemy who ridicules and insults me."},{"p":17,"t":"All this has happened to us, even though we have not rejected you or violated your covenant with us."},{"p":18,"t":"We have not been unfaithful, nor have we disobeyed your commands."},{"p":19,"t":"Yet you have battered us, leaving us a heap of ruins overrun by wild dogs; you have covered us with darkness."},{"p":20,"t":"If we had rejected our God, and spread out our hands in prayer to another god,"},{"p":21,"t":"would not God discover it, for he knows one’s thoughts?"},{"p":22,"t":"Yet because of you we are killed all day long; we are treated like sheep at the slaughtering block."},{"p":23,"t":"Rouse yourself! Why do you sleep, O Lord? Wake up! Do not reject us forever!"},{"p":24,"t":"Why do you look the other way, and ignore the way we are oppressed and mistreated?"},{"p":25,"t":"For we lie in the dirt, with our bellies pressed to the ground."},{"p":26,"t":"Rise up and help us! Rescue us because of your loyal love!"}],[{"p":1,"t":"For the music director; according to the tune of “Lilies;” by the Korahites, a well-written poem, a love song. My heart is stirred by a beautiful song. I say, “I have composed this special song for the king; my tongue is as skilled as the stylus of an experienced scribe.”"},{"p":2,"t":"You are the most handsome of all men! You speak in an impressive and fitting manner! For this reason God grants you continual blessings."},{"p":3,"t":"Strap your sword to your thigh, O warrior! Appear in your majestic splendor!"},{"p":4,"t":"Appear in your majesty and be victorious! Ride forth for the sake of what is right, on behalf of justice! Then your right hand will accomplish mighty acts!"},{"p":5,"t":"Your arrows are sharp and penetrate the hearts of the king’s enemies. Nations fall at your feet."},{"p":6,"t":"Your throne, O God, is permanent. The scepter of your kingdom is a scepter of justice."},{"p":7,"t":"You love justice and hate evil. For this reason God, your God has anointed you with the oil of joy, elevating you above your companions."},{"p":8,"t":"All your garments are perfumed with myrrh, aloes, and cassia. From the luxurious palaces comes the music of stringed instruments that makes you happy."},{"p":9,"t":"Princesses are among your honored guests, your bride stands at your right hand, wearing jewelry made with gold from Ophir."},{"p":10,"t":"Listen, O princess! Observe and pay attention! Forget your homeland and your family!"},{"p":11,"t":"Then the king will be attracted by your beauty. After all, he is your master! Submit to him!"},{"p":12,"t":"Rich people from Tyre will seek your favor by bringing a gift."},{"p":13,"t":"The princess looks absolutely magnificent, decked out in pearls and clothed in a brocade trimmed with gold."},{"p":14,"t":"In embroidered robes she is escorted to the king. Her attendants, the maidens of honor who follow her, are led before you."},{"p":15,"t":"They are bubbling with joy as they walk in procession and enter the royal palace."},{"p":16,"t":"Your sons will carry on the dynasty of your ancestors; you will make them princes throughout the land."},{"p":17,"t":"I will proclaim your greatness through the coming years, then the nations will praise you forever."}],[{"p":1,"t":"For the music director; by the Korahites; according to the alamoth style; a song. God is our strong refuge; he is truly our helper in times of trouble."},{"p":2,"t":"For this reason we do not fear when the earth shakes, and the mountains tumble into the depths of the sea,"},{"p":3,"t":"when its waves crash and foam, and the mountains shake before the surging sea. (Selah)"},{"p":4,"t":"The river’s channels bring joy to the city of God, the special, holy dwelling place of the sovereign One."},{"p":5,"t":"God lives within it, it cannot be moved. God rescues it at the break of dawn."},{"p":6,"t":"Nations are in uproar, kingdoms are overthrown. God gives a shout, the earth dissolves."},{"p":7,"t":"The Lord who commands armies is on our side! The God of Jacob is our protector! (Selah)"},{"p":8,"t":"Come! Witness the exploits of the Lord, who brings devastation to the earth!"},{"p":9,"t":"He brings an end to wars throughout the earth; he shatters the bow and breaks the spear; he burns the shields with fire."},{"p":10,"t":"He says, “Stop your striving and recognize that I am God! I will be exalted over the nations! I will be exalted over the earth!”"},{"p":11,"t":"The Lord who commands armies is on our side! The God of Jacob is our protector! (Selah)"}],[{"p":1,"t":"For the music director; by the Korahites; a psalm. All you nations, clap your hands! Shout out to God in celebration!"},{"p":2,"t":"For the sovereign Lord is awe-inspiring; he is the great king who rules the whole earth!"},{"p":3,"t":"He subdued nations beneath us and countries under our feet."},{"p":4,"t":"He picked out for us a special land to be a source of pride for Jacob, whom he loves. (Selah)"},{"p":5,"t":"God has ascended his throne amid loud shouts; the Lord has ascended his throne amid the blaring of ram’s horns."},{"p":6,"t":"Sing to God! Sing! Sing to our king! Sing!"},{"p":7,"t":"For God is king of the whole earth! Sing a well-written song!"},{"p":8,"t":"God reigns over the nations! God sits on his holy throne!"},{"p":9,"t":"The nobles of the nations assemble, along with the people of the God of Abraham, for God has authority over the rulers of the earth. He is highly exalted!"}],[{"p":1,"t":"A song, a psalm by the Korahites. The Lord is great and certainly worthy of praise in the city of our God, his holy hill."},{"p":2,"t":"It is lofty and pleasing to look at, a source of joy to the whole earth. Mount Zion resembles the peaks of Zaphon; it is the city of the great king."},{"p":3,"t":"God is in its fortresses; he reveals himself as its defender."},{"p":4,"t":"For look, the kings assemble; they advance together."},{"p":5,"t":"As soon as they see, they are shocked; they are terrified, they quickly retreat."},{"p":6,"t":"Look at them shake uncontrollably, like a woman writhing in childbirth."},{"p":7,"t":"With an east wind you shatter the large ships."},{"p":8,"t":"We heard about God’s mighty deeds, now we have seen them, in the city of the Lord, the invincible Warrior, in the city of our God. God makes it permanently secure. (Selah)"},{"p":9,"t":"We reflect on your loyal love, O God, within your temple."},{"p":10,"t":"The praise you receive as far away as the ends of the earth is worthy of your reputation, O God. You execute justice!"},{"p":11,"t":"Mount Zion rejoices; the towns of Judah are happy, because of your acts of judgment."},{"p":12,"t":"Walk around Zion! Encircle it! Count its towers!"},{"p":13,"t":"Consider its defenses! Walk through its fortresses, so you can tell the next generation about it!"},{"p":14,"t":"For God, our God, is our defender forever! He guides us!"}],[{"p":1,"t":"For the music director, a psalm by the Korahites. Listen to this, all you nations! Pay attention, all you inhabitants of the world!"},{"p":2,"t":"Pay attention, all you people, both rich and poor!"},{"p":3,"t":"I will declare a wise saying; I will share my profound thoughts."},{"p":4,"t":"I will learn a song that imparts wisdom; I will then sing my insightful song to the accompaniment of a harp."},{"p":5,"t":"Why should I be afraid in times of trouble, when the sinful deeds of deceptive men threaten to overwhelm me?"},{"p":6,"t":"They trust in their wealth and boast in their great riches."},{"p":7,"t":"Certainly a man cannot rescue his brother; he cannot pay God an adequate ransom price"},{"p":8,"t":"(the ransom price for a human life is too high, and people go to their final destiny),"},{"p":9,"t":"so that he might continue to live forever and not experience death."},{"p":10,"t":"Surely one sees that even wise people die; fools and spiritually insensitive people all pass away and leave their wealth to others."},{"p":11,"t":"Their grave becomes their permanent residence, their eternal dwelling place. They name their lands after themselves,"},{"p":12,"t":"but, despite their wealth, people do not last, they are like animals that perish."},{"p":13,"t":"This is the destiny of fools, and of those who approve of their philosophy. (Selah)"},{"p":14,"t":"They will travel to Sheol like sheep, with death as their shepherd. The godly will rule over them when the day of vindication dawns; Sheol will consume their bodies and they will no longer live in impressive houses."},{"p":15,"t":"But God will rescue my life from the power of Sheol; certainly he will pull me to safety. (Selah)"},{"p":16,"t":"Do not be afraid when a man becomes rich and his wealth multiplies!"},{"p":17,"t":"For he will take nothing with him when he dies; his wealth will not follow him down into the grave."},{"p":18,"t":"He pronounces this blessing on himself while he is alive: “May men praise you, for you have done well!”"},{"p":19,"t":"But he will join his ancestors; they will never again see the light of day."},{"p":20,"t":"Wealthy people do not understand; they are like animals that perish."}],[{"p":1,"t":"A psalm by Asaph. El, God, the Lord speaks, and summons the earth to come from the east and west."},{"p":2,"t":"From Zion, the most beautiful of all places, God comes in splendor."},{"p":3,"t":"Our God approaches and is not silent; consuming fire goes ahead of him and all around him a storm rages."},{"p":4,"t":"He summons the heavens above, as well as the earth, so that he might judge his people."},{"p":5,"t":"He says: “Assemble my covenant people before me, those who ratified a covenant with me by sacrifice!”"},{"p":6,"t":"The heavens declare his fairness, for God is judge. (Selah)"},{"p":7,"t":"He says: “Listen my people! I am speaking! Listen Israel! I am accusing you! I am God, your God!"},{"p":8,"t":"I am not condemning you because of your sacrifices, or because of your burnt sacrifices that you continually offer me."},{"p":9,"t":"I do not need to take a bull from your household or goats from your sheepfolds."},{"p":10,"t":"For every wild animal in the forest belongs to me, as well as the cattle that graze on a thousand hills."},{"p":11,"t":"I keep track of every bird in the hills, and the insects of the field are mine."},{"p":12,"t":"Even if I were hungry, I would not tell you, for the world and all it contains belong to me."},{"p":13,"t":"Do I eat the flesh of bulls? Do I drink the blood of goats?"},{"p":14,"t":"Present to God a thank-offering! Repay your vows to the sovereign One!"},{"p":15,"t":"Pray to me when you are in trouble! I will deliver you, and you will honor me!”"},{"p":16,"t":"God says this to the evildoer: “How can you declare my commands, and talk about my covenant?"},{"p":17,"t":"For you hate instruction and reject my words."},{"p":18,"t":"When you see a thief, you join him; you associate with men who are unfaithful to their wives."},{"p":19,"t":"You do damage with words, and use your tongue to deceive."},{"p":20,"t":"You plot against your brother; you slander your own brother."},{"p":21,"t":"When you did these things, I was silent, so you thought I was exactly like you. But now I will condemn you and state my case against you!"},{"p":22,"t":"Carefully consider this, you who reject God! Otherwise I will rip you to shreds and no one will be able to rescue you."},{"p":23,"t":"Whoever presents a thank-offering honors me. To whoever obeys my commands, I will reveal my power to deliver.”"}],[{"p":1,"t":"For the music director; a psalm of David, written when Nathan the prophet confronted him after David’s affair with Bathsheba. Have mercy on me, O God, because of your loyal love! Because of your great compassion, wipe away my rebellious acts!"},{"p":2,"t":"Wash away my wrongdoing! Cleanse me of my sin!"},{"p":3,"t":"For I am aware of my rebellious acts; I am forever conscious of my sin."},{"p":4,"t":"Against you &#8211; you above all &#8211; I have sinned; I have done what is evil in your sight. So you are just when you confront me; you are right when you condemn me."},{"p":5,"t":"Look, I was guilty of sin from birth, a sinner the moment my mother conceived me."},{"p":6,"t":"Look, you desire integrity in the inner man; you want me to possess wisdom."},{"p":7,"t":"Sprinkle me with water and I will be pure; wash me and I will be whiter than snow."},{"p":8,"t":"Grant me the ultimate joy of being forgiven! May the bones you crushed rejoice!"},{"p":9,"t":"Hide your face from my sins! Wipe away all my guilt!"},{"p":10,"t":"Create for me a pure heart, O God! Renew a resolute spirit within me!"},{"p":11,"t":"Do not reject me! Do not take your Holy Spirit away from me!"},{"p":12,"t":"Let me again experience the joy of your deliverance! Sustain me by giving me the desire to obey!"},{"p":13,"t":"Then I will teach rebels your merciful ways, and sinners will turn to you."},{"p":14,"t":"Rescue me from the guilt of murder, O God, the God who delivers me! Then my tongue will shout for joy because of your deliverance."},{"p":15,"t":"O Lord, give me the words! Then my mouth will praise you."},{"p":16,"t":"Certainly you do not want a sacrifice, or else I would offer it; you do not desire a burnt sacrifice."},{"p":17,"t":"The sacrifices God desires are a humble spirit &#8211; O God, a humble and repentant heart you will not reject."},{"p":18,"t":"Because you favor Zion, do what is good for her! Fortify the walls of Jerusalem!"},{"p":19,"t":"Then you will accept the proper sacrifices, burnt sacrifices and whole offerings; then bulls will be sacrificed on your altar."}],[{"p":1,"t":"For the music director; a well-written song by David. It was written when Doeg the Edomite went and informed Saul: “David has arrived at the home of Ahimelech.” Why do you boast about your evil plans, O powerful man? God’s loyal love protects me all day long!"},{"p":2,"t":"Your tongue carries out your destructive plans; it is as effective as a sharp razor, O deceiver."},{"p":3,"t":"You love evil more than good, lies more than speaking the truth. (Selah)"},{"p":4,"t":"You love to use all the words that destroy, and the tongue that deceives."},{"p":5,"t":"Yet God will make you a permanent heap of ruins. He will scoop you up and remove you from your home; he will uproot you from the land of the living. (Selah)"},{"p":6,"t":"When the godly see this, they will be filled with awe, and will mock the evildoer, saying:"},{"p":7,"t":"“Look, here is the man who would not make God his protector! He trusted in his great wealth and was confident about his plans to destroy others.”"},{"p":8,"t":"But I am like a flourishing olive tree in the house of God; I continually trust in God’s loyal love."},{"p":9,"t":"I will continually thank you when you execute judgment; I will rely on you, for your loyal followers know you are good."}],[{"p":1,"t":"For the music director; according to the machalath style; a well-written song by David. Fools say to themselves, “There is no God.” They sin and commit evil deeds; none of them does what is right."},{"p":2,"t":"God looks down from heaven at the human race, to see if there is anyone who is wise and seeks God."},{"p":3,"t":"Everyone rejects God; they are all morally corrupt. None of them does what is right, not even one!"},{"p":4,"t":"All those who behave wickedly do not understand &#8211; those who devour my people as if they were eating bread, and do not call out to God."},{"p":5,"t":"They are absolutely terrified, even by things that do not normally cause fear. For God annihilates those who attack you. You are able to humiliate them because God has rejected them."},{"p":6,"t":"I wish the deliverance of Israel would come from Zion! When God restores the well-being of his people, may Jacob rejoice, may Israel be happy!"}],[{"p":1,"t":"For the music director, to be accompanied by stringed instruments; a well-written song by David. It was written when the Ziphites came and informed Saul: “David is hiding with us.” O God, deliver me by your name! Vindicate me by your power!"},{"p":2,"t":"O God, listen to my prayer! Pay attention to what I say!"},{"p":3,"t":"For foreigners attack me; ruthless men, who do not respect God, seek my life. (Selah)"},{"p":4,"t":"Look, God is my deliverer! The Lord is among those who support me."},{"p":5,"t":"May those who wait to ambush me be repaid for their evil! As a demonstration of your faithfulness, destroy them!"},{"p":6,"t":"With a freewill offering I will sacrifice to you! I will give thanks to your name, O Lord, for it is good!"},{"p":7,"t":"Surely he rescues me from all trouble, and I triumph over my enemies."}],[{"p":1,"t":"For the music director, to be accompanied by stringed instruments; a well-written song by David. Listen, O God, to my prayer! Do not ignore my appeal for mercy!"},{"p":2,"t":"Pay attention to me and answer me! I am so upset and distressed, I am beside myself,"},{"p":3,"t":"because of what the enemy says, and because of how the wicked pressure me, for they hurl trouble down upon me and angrily attack me."},{"p":4,"t":"My heart beats violently within me; the horrors of death overcome me."},{"p":5,"t":"Fear and panic overpower me; terror overwhelms me."},{"p":6,"t":"I say, “I wish I had wings like a dove! I would fly away and settle in a safe place!"},{"p":7,"t":"Look, I will escape to a distant place; I will stay in the wilderness. (Selah)"},{"p":8,"t":"I will hurry off to a place that is safe from the strong wind and the gale.”"},{"p":9,"t":"Confuse them, O Lord! Frustrate their plans! For I see violence and conflict in the city."},{"p":10,"t":"Day and night they walk around on its walls, while wickedness and destruction are within it."},{"p":11,"t":"Disaster is within it; violence and deceit do not depart from its public square."},{"p":12,"t":"Indeed, it is not an enemy who insults me, or else I could bear it; it is not one who hates me who arrogantly taunts me, or else I could hide from him."},{"p":13,"t":"But it is you, a man like me, my close friend in whom I confided."},{"p":14,"t":"We would share personal thoughts with each other; in God’s temple we would walk together among the crowd."},{"p":15,"t":"May death destroy them! May they go down alive into Sheol! For evil is in their dwelling place and in their midst."},{"p":16,"t":"As for me, I will call out to God, and the Lord will deliver me."},{"p":17,"t":"During the evening, morning, and noontime I will lament and moan, and he will hear me."},{"p":18,"t":"He will rescue me and protect me from those who attack me, even though they greatly outnumber me."},{"p":19,"t":"God, the one who has reigned as king from long ago, will hear and humiliate them. (Selah) They refuse to change, and do not fear God."},{"p":20,"t":"He attacks his friends; he breaks his solemn promises to them."},{"p":21,"t":"His words are as smooth as butter, but he harbors animosity in his heart. His words seem softer than oil, but they are really like sharp swords."},{"p":22,"t":"Throw your burden upon the Lord, and he will sustain you. He will never allow the godly to be upended."},{"p":23,"t":"But you, O God, will bring them down to the deep Pit. Violent and deceitful people will not live even half a normal lifespan. But as for me, I trust in you."}],[{"p":1,"t":"For the music director; according to the yonath-elem-rechovim style; a prayer of David, written when the Philistines captured him in Gath. Have mercy on me, O God, for men are attacking me! All day long hostile enemies are tormenting me."},{"p":2,"t":"Those who anticipate my defeat attack me all day long. Indeed, many are fighting against me, O Exalted One."},{"p":3,"t":"When I am afraid, I trust in you."},{"p":4,"t":"In God &#8211; I boast in his promise &#8211; in God I trust, I am not afraid. What can mere men do to me?"},{"p":5,"t":"All day long they cause me trouble; they make a habit of plotting my demise."},{"p":6,"t":"They stalk and lurk; they watch my every step, as they prepare to take my life."},{"p":7,"t":"Because they are bent on violence, do not let them escape! In your anger bring down the nations, O God!"},{"p":8,"t":"You keep track of my misery. Put my tears in your leather container! Are they not recorded in your scroll?"},{"p":9,"t":"My enemies will turn back when I cry out to you for help; I know that God is on my side."},{"p":10,"t":"In God &#8211; I boast in his promise &#8211; in the Lord &#8211; I boast in his promise &#8211;"},{"p":11,"t":"in God I trust, I am not afraid. What can mere men do to me?"},{"p":12,"t":"I am obligated to fulfill the vows I made to you, O God; I will give you the thank-offerings you deserve,"},{"p":13,"t":"when you deliver my life from death. You keep my feet from stumbling, so that I might serve God as I enjoy life."}],[{"p":1,"t":"For the music director; according to the al-tashcheth style; a prayer of David, written when he fled from Saul into the cave. Have mercy on me, O God! Have mercy on me! For in you I have taken shelter. In the shadow of your wings I take shelter until trouble passes."},{"p":2,"t":"I cry out for help to the sovereign God, to the God who vindicates me."},{"p":3,"t":"May he send help from heaven and deliver me from my enemies who hurl insults! (Selah) May God send his loyal love and faithfulness!"},{"p":4,"t":"I am surrounded by lions; I lie down among those who want to devour me; men whose teeth are spears and arrows, whose tongues are a sharp sword."},{"p":5,"t":"Rise up above the sky, O God! May your splendor cover the whole earth!"},{"p":6,"t":"They have prepared a net to trap me; I am discouraged. They have dug a pit for me. They will fall into it! (Selah)"},{"p":7,"t":"I am determined, O God! I am determined! I will sing and praise you!"},{"p":8,"t":"Awake, my soul! Awake, O stringed instrument and harp! I will wake up at dawn!"},{"p":9,"t":"I will give you thanks before the nations, O Master! I will sing praises to you before foreigners!"},{"p":10,"t":"For your loyal love extends beyond the sky, and your faithfulness reaches the clouds."},{"p":11,"t":"Rise up above the sky, O God! May your splendor cover the whole earth!"}],[{"p":1,"t":"For the music director; according to the al-tashcheth style; a prayer of David. Do you rulers really pronounce just decisions? Do you judge people fairly?"},{"p":2,"t":"No! You plan how to do what is unjust; you deal out violence in the earth."},{"p":3,"t":"The wicked turn aside from birth; liars go astray as soon as they are born."},{"p":4,"t":"Their venom is like that of a snake, like a deaf serpent that does not hear,"},{"p":5,"t":"that does not respond to the magicians, or to a skilled snake-charmer."},{"p":6,"t":"O God, break the teeth in their mouths! Smash the jawbones of the lions, O Lord!"},{"p":7,"t":"Let them disappear like water that flows away! Let them wither like grass!"},{"p":8,"t":"Let them be like a snail that melts away as it moves along! Let them be like stillborn babies that never see the sun!"},{"p":9,"t":"Before the kindling is even placed under your pots, he will sweep it away along with both the raw and cooked meat."},{"p":10,"t":"The godly will rejoice when they see vengeance carried out; they will bathe their feet in the blood of the wicked."},{"p":11,"t":"Then observers will say, “Yes indeed, the godly are rewarded! Yes indeed, there is a God who judges in the earth!”"}],[{"p":1,"t":"For the music director; according to the al-tashcheth style; a prayer of David, written when Saul sent men to surround his house and murder him. Deliver me from my enemies, my God! Protect me from those who attack me!"},{"p":2,"t":"Deliver me from evildoers! Rescue me from violent men!"},{"p":3,"t":"For look, they wait to ambush me; powerful men stalk me, but not because I have rebelled or sinned, O Lord."},{"p":4,"t":"Though I have done nothing wrong, they are anxious to attack. Spring into action and help me! Take notice of me!"},{"p":5,"t":"You, O Lord God, the invincible warrior, the God of Israel, rouse yourself and punish all the nations! Have no mercy on any treacherous evildoers! (Selah)"},{"p":6,"t":"They return in the evening; they growl like a dog and prowl around outside the city."},{"p":7,"t":"Look, they hurl insults at me and openly threaten to kill me, for they say, “Who hears?”"},{"p":8,"t":"But you, O Lord, laugh in disgust at them; you taunt all the nations."},{"p":9,"t":"You are my source of strength! I will wait for you! For God is my refuge."},{"p":10,"t":"The God who loves me will help me; God will enable me to triumph over my enemies."},{"p":11,"t":"Do not strike them dead suddenly, because then my people might forget the lesson. Use your power to make them homeless vagabonds and then bring them down, O Lord who shields us!"},{"p":12,"t":"They speak sinful words. So let them be trapped by their own pride and by the curses and lies they speak!"},{"p":13,"t":"Angrily wipe them out! Wipe them out so they vanish! Let them know that God rules in Jacob and to the ends of the earth! (Selah)"},{"p":14,"t":"They return in the evening; they growl like a dog and prowl around outside the city."},{"p":15,"t":"They wander around looking for something to eat; they refuse to sleep until they are full."},{"p":16,"t":"As for me, I will sing about your strength; I will praise your loyal love in the morning. For you are my refuge and my place of shelter when I face trouble."},{"p":17,"t":"You are my source of strength! I will sing praises to you! For God is my refuge, the God who loves me."}],[{"p":1,"t":"For the music director; according to the shushan-eduth style; a prayer of David written to instruct others. It was written when he fought against Aram Naharaim and Aram-Zobah. That was when Joab turned back and struck down 12,000 Edomites in the Valley of Salt. O God, you have rejected us. You suddenly turned on us in your anger. Please restore us!"},{"p":2,"t":"You made the earth quake; you split it open. Repair its breaches, for it is ready to fall."},{"p":3,"t":"You have made your people experience hard times; you have made us drink intoxicating wine."},{"p":4,"t":"You have given your loyal followers a rallying flag, so that they might seek safety from the bow. (Selah)"},{"p":5,"t":"Deliver by your power and answer me, so that the ones you love may be safe."},{"p":6,"t":"God has spoken in his sanctuary: “I will triumph! I will parcel out Shechem; the Valley of Succoth I will measure off."},{"p":7,"t":"Gilead belongs to me, as does Manasseh! Ephraim is my helmet, Judah my royal scepter."},{"p":8,"t":"Moab is my washbasin. I will make Edom serve me. I will shout in triumph over Philistia.”"},{"p":9,"t":"Who will lead me into the fortified city? Who will bring me to Edom?"},{"p":10,"t":"Have you not rejected us, O God? O God, you do not go into battle with our armies."},{"p":11,"t":"Give us help against the enemy, for any help men might offer is futile."},{"p":12,"t":"By God’s power we will conquer; he will trample down our enemies."}],[{"p":1,"t":"For the music director; to be played on a stringed instrument; written by David. O God, hear my cry for help! Pay attention to my prayer!"},{"p":2,"t":"From the most remote place on earth I call out to you in my despair. Lead me up to an inaccessible rocky summit!"},{"p":3,"t":"Indeed, you are my shelter, a strong tower that protects me from the enemy."},{"p":4,"t":"I will be a permanent guest in your home; I will find shelter in the protection of your wings. (Selah)"},{"p":5,"t":"For you, O God, hear my vows; you grant me the reward that belongs to your loyal followers."},{"p":6,"t":"Give the king long life! Make his lifetime span several generations!"},{"p":7,"t":"May he reign forever before God! Decree that your loyal love and faithfulness should protect him."},{"p":8,"t":"Then I will sing praises to your name continually, as I fulfill my vows day after day."}],[{"p":1,"t":"For the music director, Jeduthun; a psalm of David. For God alone I patiently wait; he is the one who delivers me."},{"p":2,"t":"He alone is my protector and deliverer. He is my refuge; I will not be upended."},{"p":3,"t":"How long will you threaten a man? All of you are murderers, as dangerous as a leaning wall or an unstable fence."},{"p":4,"t":"They spend all their time planning how to bring him down. They love to use deceit; they pronounce blessings with their mouths, but inwardly they utter curses. (Selah)"},{"p":5,"t":"Patiently wait for God alone, my soul! For he is the one who gives me confidence."},{"p":6,"t":"He alone is my protector and deliverer. He is my refuge; I will not be upended."},{"p":7,"t":"God delivers me and exalts me; God is my strong protector and my shelter."},{"p":8,"t":"Trust in him at all times, you people! Pour out your hearts before him! God is our shelter! (Selah)"},{"p":9,"t":"Men are nothing but a mere breath; human beings are unreliable. When they are weighed in the scales, all of them together are lighter than air."},{"p":10,"t":"Do not trust in what you can gain by oppression! Do not put false confidence in what you can gain by robbery! If wealth increases, do not become attached to it!"},{"p":11,"t":"God has declared one principle; two principles I have heard: God is strong,"},{"p":12,"t":"and you, O Lord, demonstrate loyal love. For you repay men for what they do."}],[{"p":1,"t":"A psalm of David, written when he was in the Judean wilderness. O God, you are my God! I long for you! My soul thirsts for you, my flesh yearns for you, in a dry and parched land where there is no water."},{"p":2,"t":"Yes, in the sanctuary I have seen you, and witnessed your power and splendor."},{"p":3,"t":"Because experiencing your loyal love is better than life itself, my lips will praise you."},{"p":4,"t":"For this reason I will praise you while I live; in your name I will lift up my hands."},{"p":5,"t":"As if with choice meat you satisfy my soul. My mouth joyfully praises you,"},{"p":6,"t":"whenever I remember you on my bed, and think about you during the nighttime hours."},{"p":7,"t":"For you are my deliverer; under your wings I rejoice."},{"p":8,"t":"My soul pursues you; your right hand upholds me."},{"p":9,"t":"Enemies seek to destroy my life, but they will descend into the depths of the earth."},{"p":10,"t":"Each one will be handed over to the sword; their corpses will be eaten by jackals."},{"p":11,"t":"But the king will rejoice in God; everyone who takes oaths in his name will boast, for the mouths of those who speak lies will be shut up."}],[{"p":1,"t":"For the music director; a psalm of David. Listen to me, O God, as I offer my lament! Protect my life from the enemy’s terrifying attacks."},{"p":2,"t":"Hide me from the plots of evil men, from the crowd of evildoers."},{"p":3,"t":"They sharpen their tongues like a sword; they aim their arrow, a slanderous charge,"},{"p":4,"t":"in order to shoot down the innocent in secluded places. They shoot at him suddenly and are unafraid of retaliation."},{"p":5,"t":"They encourage one another to carry out their evil deed. They plan how to hide snares, and boast, “Who will see them?”"},{"p":6,"t":"They devise unjust schemes; they disguise a well-conceived plot. Man’s inner thoughts cannot be discovered."},{"p":7,"t":"But God will shoot at them; suddenly they will be wounded by an arrow."},{"p":8,"t":"Their slander will bring about their demise. All who see them will shudder,"},{"p":9,"t":"and all people will fear. They will proclaim what God has done, and reflect on his deeds."},{"p":10,"t":"The godly will rejoice in the Lord and take shelter in him. All the morally upright will boast."}],[{"p":1,"t":"For the music director; a psalm of David, a song. Praise awaits you, O God, in Zion. Vows made to you are fulfilled."},{"p":2,"t":"You hear prayers; all people approach you."},{"p":3,"t":"Our record of sins overwhelms me, but you forgive our acts of rebellion."},{"p":4,"t":"How blessed is the one whom you choose, and allow to live in your palace courts. May we be satisfied with the good things of your house &#8211; your holy palace."},{"p":5,"t":"You answer our prayers by performing awesome acts of deliverance, O God, our savior. All the ends of the earth trust in you, as well as those living across the wide seas."},{"p":6,"t":"You created the mountains by your power, and demonstrated your strength."},{"p":7,"t":"You calm the raging seas and their roaring waves, as well as the commotion made by the nations."},{"p":8,"t":"Even those living in the most remote areas are awestruck by your acts; you cause those living in the east and west to praise you."},{"p":9,"t":"You visit the earth and give it rain; you make it rich and fertile with overflowing streams full of water. You provide grain for them, for you prepare the earth to yield its crops."},{"p":10,"t":"You saturate its furrows, and soak its plowed ground. With rain showers you soften its soil, and make its crops grow."},{"p":11,"t":"You crown the year with your good blessings, and you leave abundance in your wake."},{"p":12,"t":"The pastures in the wilderness glisten with moisture, and the hills are clothed with joy."},{"p":13,"t":"The meadows are clothed with sheep, and the valleys are covered with grain. They shout joyfully, yes, they sing."}],[{"p":1,"t":"For the music director; a song, a psalm. Shout out praise to God, all the earth!"},{"p":2,"t":"Sing praises about the majesty of his reputation! Give him the honor he deserves!"},{"p":3,"t":"Say to God: “How awesome are your deeds! Because of your great power your enemies cower in fear before you."},{"p":4,"t":"All the earth worships you and sings praises to you! They sing praises to your name!” (Selah)"},{"p":5,"t":"Come and witness God’s exploits! His acts on behalf of people are awesome!"},{"p":6,"t":"He turned the sea into dry land; they passed through the river on foot. Let us rejoice in him there!"},{"p":7,"t":"He rules by his power forever; he watches the nations. Stubborn rebels should not exalt themselves. (Selah)"},{"p":8,"t":"Praise our God, you nations! Loudly proclaim his praise!"},{"p":9,"t":"He preserves our lives and does not allow our feet to slip."},{"p":10,"t":"For you, O God, tested us; you purified us like refined silver."},{"p":11,"t":"You led us into a trap; you caused us to suffer."},{"p":12,"t":"You allowed men to ride over our heads; we passed through fire and water, but you brought us out into a wide open place."},{"p":13,"t":"I will enter your temple with burnt sacrifices; I will fulfill the vows I made to you,"},{"p":14,"t":"which my lips uttered and my mouth spoke when I was in trouble."},{"p":15,"t":"I will offer up to you fattened animals as burnt sacrifices, along with the smell of sacrificial rams. I will offer cattle and goats. (Selah)"},{"p":16,"t":"Come! Listen, all you who are loyal to God! I will declare what he has done for me."},{"p":17,"t":"I cried out to him for help and praised him with my tongue."},{"p":18,"t":"If I had harbored sin in my heart, the Lord would not have listened."},{"p":19,"t":"However, God heard; he listened to my prayer."},{"p":20,"t":"God deserves praise, for he did not reject my prayer or abandon his love for me!"}],[{"p":1,"t":"For the music director; to be accompanied by stringed instruments; a psalm, a song. May God show us his favor and bless us! May he smile on us! (Selah)"},{"p":2,"t":"Then those living on earth will know what you are like; all nations will know how you deliver your people."},{"p":3,"t":"Let the nations thank you, O God! Let all the nations thank you!"},{"p":4,"t":"Let foreigners rejoice and celebrate! For you execute justice among the nations, and govern the people living on earth. (Selah)"},{"p":5,"t":"Let the nations thank you, O God! Let all the nations thank you!"},{"p":6,"t":"The earth yields its crops. May God, our God, bless us!"},{"p":7,"t":"May God bless us! Then all the ends of the earth will give him the honor he deserves."}],[{"p":1,"t":"For the music director; by David, a psalm, a song. God springs into action! His enemies scatter; his adversaries run from him."},{"p":2,"t":"As smoke is driven away by the wind, so you drive them away. As wax melts before fire, so the wicked are destroyed before God."},{"p":3,"t":"But the godly are happy; they rejoice before God and are overcome with joy."},{"p":4,"t":"Sing to God! Sing praises to his name! Exalt the one who rides on the clouds! For the Lord is his name! Rejoice before him!"},{"p":5,"t":"He is a father to the fatherless and an advocate for widows. God rules from his holy palace."},{"p":6,"t":"God settles those who have been deserted in their own homes; he frees prisoners and grants them prosperity. But sinful rebels live in the desert."},{"p":7,"t":"O God, when you lead your people into battle, when you march through the desert, (Selah)"},{"p":8,"t":"the earth shakes, yes, the heavens pour down rain before God, the God of Sinai, before God, the God of Israel."},{"p":9,"t":"O God, you cause abundant showers to fall on your chosen people. When they are tired, you sustain them,"},{"p":10,"t":"for you live among them. You sustain the oppressed with your good blessings, O God."},{"p":11,"t":"The Lord speaks; many, many women spread the good news."},{"p":12,"t":"Kings leading armies run away &#8211; they run away! The lovely lady of the house divides up the loot."},{"p":13,"t":"When you lie down among the sheepfolds, the wings of the dove are covered with silver and with glittering gold."},{"p":14,"t":"When the sovereign judge scatters kings, let it snow on Zalmon!"},{"p":15,"t":"The mountain of Bashan is a towering mountain; the mountain of Bashan is a mountain with many peaks."},{"p":16,"t":"Why do you look with envy, O mountains with many peaks, at the mountain where God has decided to live? Indeed the Lord will live there permanently!"},{"p":17,"t":"God has countless chariots; they number in the thousands. The Lord comes from Sinai in holy splendor."},{"p":18,"t":"You ascend on high, you have taken many captives. You receive tribute from men, including even sinful rebels. Indeed the Lord God lives there!"},{"p":19,"t":"The Lord deserves praise! Day after day he carries our burden, the God who delivers us. (Selah)"},{"p":20,"t":"Our God is a God who delivers; the Lord, the sovereign Lord, can rescue from death."},{"p":21,"t":"Indeed God strikes the heads of his enemies, the hairy foreheads of those who persist in rebellion."},{"p":22,"t":"The Lord says, “I will retrieve them from Bashan, I will bring them back from the depths of the sea,"},{"p":23,"t":"so that your feet may stomp in their blood, and your dogs may eat their portion of the enemies’ corpses.”"},{"p":24,"t":"They see your processions, O God &#8211; the processions of my God, my king, who marches along in holy splendor."},{"p":25,"t":"Singers walk in front; musicians follow playing their stringed instruments, in the midst of young women playing tambourines."},{"p":26,"t":"In your large assemblies praise God, the Lord, in the assemblies of Israel!"},{"p":27,"t":"There is little Benjamin, their ruler, and the princes of Judah in their robes, along with the princes of Zebulun and the princes of Naphtali."},{"p":28,"t":"God has decreed that you will be powerful. O God, you who have acted on our behalf, demonstrate your power,"},{"p":29,"t":"as you come out of your temple in Jerusalem! Kings bring tribute to you."},{"p":30,"t":"Sound your battle cry against the wild beast of the reeds, and the nations that assemble like a herd of calves led by bulls! They humble themselves and offer gold and silver as tribute. God scatters the nations that like to do battle."},{"p":31,"t":"They come with red cloth from Egypt, Ethiopia voluntarily offers tribute to God."},{"p":32,"t":"O kingdoms of the earth, sing to God! Sing praises to the Lord, (Selah)"},{"p":33,"t":"to the one who rides through the sky from ancient times! Look! He thunders loudly."},{"p":34,"t":"Acknowledge God’s power, his sovereignty over Israel, and the power he reveals in the skies!"},{"p":35,"t":"You are awe-inspiring, O God, as you emerge from your holy temple! It is the God of Israel who gives the people power and strength. God deserves praise!"}],[{"p":1,"t":"For the music director; according to the tune of “Lilies;” by David. Deliver me, O God, for the water has reached my neck."},{"p":2,"t":"I sink into the deep mire where there is no solid ground; I am in deep water, and the current overpowers me."},{"p":3,"t":"I am exhausted from shouting for help; my throat is sore; my eyes grow tired of looking for my God."},{"p":4,"t":"Those who hate me without cause are more numerous than the hairs of my head. Those who want to destroy me, my enemies for no reason, outnumber me. They make me repay what I did not steal!"},{"p":5,"t":"O God, you are aware of my foolish sins; my guilt is not hidden from you."},{"p":6,"t":"Let none who rely on you be disgraced because of me, O sovereign Lord and king! Let none who seek you be ashamed because of me, O God of Israel!"},{"p":7,"t":"For I suffer humiliation for your sake and am thoroughly disgraced."},{"p":8,"t":"My own brothers treat me like a stranger; they act as if I were a foreigner."},{"p":9,"t":"Certainly zeal for your house consumes me; I endure the insults of those who insult you."},{"p":10,"t":"I weep and refrain from eating food, which causes others to insult me."},{"p":11,"t":"I wear sackcloth and they ridicule me."},{"p":12,"t":"Those who sit at the city gate gossip about me; drunkards mock me in their songs."},{"p":13,"t":"O Lord, may you hear my prayer and be favorably disposed to me! O God, because of your great loyal love, answer me with your faithful deliverance!"},{"p":14,"t":"Rescue me from the mud! Don’t let me sink! Deliver me from those who hate me, from the deep water!"},{"p":15,"t":"Don’t let the current overpower me! Don’t let the deep swallow me up! Don’t let the pit devour me!"},{"p":16,"t":"Answer me, O Lord, for your loyal love is good! Because of your great compassion, turn toward me!"},{"p":17,"t":"Do not ignore your servant, for I am in trouble! Answer me right away!"},{"p":18,"t":"Come near me and redeem me! Because of my enemies, rescue me!"},{"p":19,"t":"You know how I am insulted, humiliated and disgraced; you can see all my enemies."},{"p":20,"t":"Their insults are painful and make me lose heart; I look for sympathy, but receive none, for comforters, but find none."},{"p":21,"t":"They put bitter poison into my food, and to quench my thirst they give me vinegar to drink."},{"p":22,"t":"May their dining table become a trap before them! May it be a snare for that group of friends!"},{"p":23,"t":"May their eyes be blinded! Make them shake violently!"},{"p":24,"t":"Pour out your judgment on them! May your raging anger overtake them!"},{"p":25,"t":"May their camp become desolate, their tents uninhabited!"},{"p":26,"t":"For they harass the one whom you discipline; they spread the news about the suffering of those whom you punish."},{"p":27,"t":"Hold them accountable for all their sins! Do not vindicate them!"},{"p":28,"t":"May their names be deleted from the scroll of the living! Do not let their names be listed with the godly!"},{"p":29,"t":"I am oppressed and suffering! O God, deliver and protect me!"},{"p":30,"t":"I will sing praises to God’s name! I will magnify him as I give him thanks!"},{"p":31,"t":"That will please the Lord more than an ox or a bull with horns and hooves."},{"p":32,"t":"The oppressed look on &#8211; let them rejoice! You who seek God, may you be encouraged!"},{"p":33,"t":"For the Lord listens to the needy; he does not despise his captive people."},{"p":34,"t":"Let the heavens and the earth praise him, along with the seas and everything that swims in them!"},{"p":35,"t":"For God will deliver Zion and rebuild the cities of Judah, and his people will again live in them and possess Zion."},{"p":36,"t":"The descendants of his servants will inherit it, and those who are loyal to him will live in it."}],[{"p":1,"t":"For the music director; by David; written to get God’s attention. O God, please be willing to rescue me! O Lord, hurry and help me!"},{"p":2,"t":"May those who are trying to take my life be embarrassed and ashamed! May those who want to harm me be turned back and ashamed!"},{"p":3,"t":"May those who say, “Aha! Aha!” be driven back and disgraced!"},{"p":4,"t":"May all those who seek you be happy and rejoice in you! May those who love to experience your deliverance say continually, “May God be praised!”"},{"p":5,"t":"I am oppressed and needy! O God, hurry to me! You are my helper and my deliverer! O Lord, do not delay!"}],[{"p":1,"t":"In you, O Lord, I have taken shelter! Never let me be humiliated!"},{"p":2,"t":"Vindicate me by rescuing me! Listen to me! Deliver me!"},{"p":3,"t":"Be my protector and refuge, a stronghold where I can be safe! For you are my high ridge and my stronghold."},{"p":4,"t":"My God, rescue me from the power of the wicked, from the hand of the cruel oppressor!"},{"p":5,"t":"For you give me confidence, O Lord; O Lord, I have trusted in you since I was young."},{"p":6,"t":"I have leaned on you since birth; you pulled me from my mother’s womb. I praise you continually."},{"p":7,"t":"Many are appalled when they see me, but you are my secure shelter."},{"p":8,"t":"I praise you constantly and speak of your splendor all day long."},{"p":9,"t":"Do not reject me in my old age! When my strength fails, do not abandon me!"},{"p":10,"t":"For my enemies talk about me; those waiting for a chance to kill me plot my demise."},{"p":11,"t":"They say, “God has abandoned him. Run and seize him, for there is no one who will rescue him!”"},{"p":12,"t":"O God, do not remain far away from me! My God, hurry and help me!"},{"p":13,"t":"May my accusers be humiliated and defeated! May those who want to harm me be covered with scorn and disgrace!"},{"p":14,"t":"As for me, I will wait continually, and will continue to praise you."},{"p":15,"t":"I will tell about your justice, and all day long proclaim your salvation, though I cannot fathom its full extent."},{"p":16,"t":"I will come and tell about the mighty acts of the sovereign Lord. I will proclaim your justice &#8211; yours alone."},{"p":17,"t":"O God, you have taught me since I was young, and I am still declaring your amazing deeds."},{"p":18,"t":"Even when I am old and gray, O God, do not abandon me, until I tell the next generation about your strength, and those coming after me about your power."},{"p":19,"t":"Your justice, O God, extends to the skies above; you have done great things. O God, who can compare to you?"},{"p":20,"t":"Though you have allowed me to experience much trouble and distress, revive me once again! Bring me up once again from the depths of the earth!"},{"p":21,"t":"Raise me to a position of great honor! Turn and comfort me!"},{"p":22,"t":"I will express my thanks to you with a stringed instrument, praising your faithfulness, O my God! I will sing praises to you accompanied by a harp, O Holy One of Israel!"},{"p":23,"t":"My lips will shout for joy! Yes, I will sing your praises! I will praise you when you rescue me!"},{"p":24,"t":"All day long my tongue will also tell about your justice, for those who want to harm me will be embarrassed and ashamed."}],[{"p":1,"t":"For Solomon. O God, grant the king the ability to make just decisions! Grant the king’s son the ability to make fair decisions!"},{"p":2,"t":"Then he will judge your people fairly, and your oppressed ones equitably."},{"p":3,"t":"The mountains will bring news of peace to the people, and the hills will announce justice."},{"p":4,"t":"He will defend the oppressed among the people; he will deliver the children of the poor and crush the oppressor."},{"p":5,"t":"People will fear you as long as the sun and moon remain in the sky, for generation after generation."},{"p":6,"t":"He will descend like rain on the mown grass, like showers that drench the earth."},{"p":7,"t":"During his days the godly will flourish; peace will prevail as long as the moon remains in the sky."},{"p":8,"t":"May he rule from sea to sea, and from the Euphrates River to the ends of the earth!"},{"p":9,"t":"Before him the coastlands will bow down, and his enemies will lick the dust."},{"p":10,"t":"The kings of Tarshish and the coastlands will offer gifts; the kings of Sheba and Seba will bring tribute."},{"p":11,"t":"All kings will bow down to him; all nations will serve him."},{"p":12,"t":"For he will rescue the needy when they cry out for help, and the oppressed who have no defender."},{"p":13,"t":"He will take pity on the poor and needy; the lives of the needy he will save."},{"p":14,"t":"From harm and violence he will defend them; he will value their lives."},{"p":15,"t":"May he live! May they offer him gold from Sheba! May they continually pray for him! May they pronounce blessings on him all day long!"},{"p":16,"t":"May there be an abundance of grain in the earth; on the tops of the mountains may it sway! May its fruit trees flourish like the forests of Lebanon! May its crops be as abundant as the grass of the earth!"},{"p":17,"t":"May his fame endure! May his dynasty last as long as the sun remains in the sky! May they use his name when they formulate their blessings! May all nations consider him to be favored by God!"},{"p":18,"t":"The Lord God, the God of Israel, deserves praise! He alone accomplishes amazing things!"},{"p":19,"t":"His glorious name deserves praise forevermore! May his majestic splendor fill the whole earth! We agree! We agree!"},{"p":20,"t":"This collection of the prayers of David son of Jesse ends here."}],[{"p":1,"t":"A psalm by Asaph. Certainly God is good to Israel, and to those whose motives are pure!"},{"p":2,"t":"But as for me, my feet almost slipped; my feet almost slid out from under me."},{"p":3,"t":"For I envied those who are proud, as I observed the prosperity of the wicked."},{"p":4,"t":"For they suffer no pain; their bodies are strong and well-fed."},{"p":5,"t":"They are immune to the trouble common to men; they do not suffer as other men do."},{"p":6,"t":"Arrogance is their necklace, and violence their clothing."},{"p":7,"t":"Their prosperity causes them to do wrong; their thoughts are sinful."},{"p":8,"t":"They mock and say evil things; they proudly threaten violence."},{"p":9,"t":"They speak as if they rule in heaven, and lay claim to the earth."},{"p":10,"t":"Therefore they have more than enough food to eat, and even suck up the water of the sea."},{"p":11,"t":"They say, “How does God know what we do? Is the sovereign one aware of what goes on?”"},{"p":12,"t":"Take a good look! This is what the wicked are like, those who always have it so easy and get richer and richer."},{"p":13,"t":"I concluded, “Surely in vain I have kept my motives pure and maintained a pure lifestyle."},{"p":14,"t":"I suffer all day long, and am punished every morning.”"},{"p":15,"t":"If I had publicized these thoughts, I would have betrayed your loyal followers."},{"p":16,"t":"When I tried to make sense of this, it was troubling to me."},{"p":17,"t":"Then I entered the precincts of God’s temple, and understood the destiny of the wicked."},{"p":18,"t":"Surely you put them in slippery places; you bring them down to ruin."},{"p":19,"t":"How desolate they become in a mere moment! Terrifying judgments make their demise complete!"},{"p":20,"t":"They are like a dream after one wakes up. O Lord, when you awake you will despise them."},{"p":21,"t":"Yes, my spirit was bitter, and my insides felt sharp pain."},{"p":22,"t":"I was ignorant and lacked insight; I was as senseless as an animal before you."},{"p":23,"t":"But I am continually with you; you hold my right hand."},{"p":24,"t":"You guide me by your wise advice, and then you will lead me to a position of honor."},{"p":25,"t":"Whom do I have in heaven but you? I desire no one but you on earth."},{"p":26,"t":"My flesh and my heart may grow weak, but God always protects my heart and gives me stability."},{"p":27,"t":"Yes, look! Those far from you die; you destroy everyone who is unfaithful to you."},{"p":28,"t":"But as for me, God’s presence is all I need. I have made the sovereign Lord my shelter, as I declare all the things you have done."}],[{"p":1,"t":"A well-written song by Asaph. Why, O God, have you permanently rejected us? Why does your anger burn against the sheep of your pasture?"},{"p":2,"t":"Remember your people whom you acquired in ancient times, whom you rescued so they could be your very own nation, as well as Mount Zion, where you dwell!"},{"p":3,"t":"Hurry and look at the permanent ruins, and all the damage the enemy has done to the temple!"},{"p":4,"t":"Your enemies roar in the middle of your sanctuary; they set up their battle flags."},{"p":5,"t":"They invade like lumberjacks swinging their axes in a thick forest."},{"p":6,"t":"And now they are tearing down all its engravings with axes and crowbars."},{"p":7,"t":"They set your sanctuary on fire; they desecrate your dwelling place by knocking it to the ground."},{"p":8,"t":"They say to themselves, “We will oppress all of them.” They burn down all the places where people worship God in the land."},{"p":9,"t":"We do not see any signs of God’s presence; there are no longer any prophets and we have no one to tell us how long this will last."},{"p":10,"t":"How long, O God, will the adversary hurl insults? Will the enemy blaspheme your name forever?"},{"p":11,"t":"Why do you remain inactive? Intervene and destroy him!"},{"p":12,"t":"But God has been my king from ancient times, performing acts of deliverance on the earth."},{"p":13,"t":"You destroyed the sea by your strength; you shattered the heads of the sea monster in the water."},{"p":14,"t":"You crushed the heads of Leviathan; you fed him to the people who live along the coast."},{"p":15,"t":"You broke open the spring and the stream; you dried up perpetually flowing rivers."},{"p":16,"t":"You established the cycle of day and night; you put the moon and sun in place."},{"p":17,"t":"You set up all the boundaries of the earth; you created the cycle of summer and winter."},{"p":18,"t":"Remember how the enemy hurls insults, O Lord, and how a foolish nation blasphemes your name!"},{"p":19,"t":"Do not hand the life of your dove over to a wild animal! Do not continue to disregard the lives of your oppressed people!"},{"p":20,"t":"Remember your covenant promises, for the dark regions of the earth are full of places where violence rules."},{"p":21,"t":"Do not let the afflicted be turned back in shame! Let the oppressed and poor praise your name!"},{"p":22,"t":"Rise up, O God! Defend your honor! Remember how fools insult you all day long!"},{"p":23,"t":"Do not disregard what your enemies say, or the unceasing shouts of those who defy you."}],[{"p":1,"t":"For the music director; according to the al-tashcheth style; a psalm of Asaph; a song. We give thanks to you, O God! We give thanks! You reveal your presence; people tell about your amazing deeds."},{"p":2,"t":"God says, “At the appointed times, I judge fairly."},{"p":3,"t":"When the earth and all its inhabitants dissolve in fear, I make its pillars secure.” (Selah)"},{"p":4,"t":"I say to the proud, “Do not be proud,” and to the wicked, “Do not be so confident of victory!"},{"p":5,"t":"Do not be so certain you have won! Do not speak with your head held so high!"},{"p":6,"t":"For victory does not come from the east or west, or from the wilderness."},{"p":7,"t":"For God is the judge! He brings one down and exalts another."},{"p":8,"t":"For the Lord holds in his hand a cup full of foaming wine mixed with spices, and pours it out. Surely all the wicked of the earth will slurp it up and drink it to its very last drop.”"},{"p":9,"t":"As for me, I will continually tell what you have done; I will sing praises to the God of Jacob!"},{"p":10,"t":"God says, “I will bring down all the power of the wicked; the godly will be victorious.”"}],[{"p":1,"t":"For the music director; to be accompanied by stringed instruments; a psalm of Asaph, a song. God has revealed himself in Judah; in Israel his reputation is great."},{"p":2,"t":"He lives in Salem; he dwells in Zion."},{"p":3,"t":"There he shattered the arrows, the shield, the sword, and the rest of the weapons of war. (Selah)"},{"p":4,"t":"You shine brightly and reveal your majesty, as you descend from the hills where you killed your prey."},{"p":5,"t":"The bravehearted were plundered; they “fell asleep.” All the warriors were helpless."},{"p":6,"t":"At the sound of your battle cry, O God of Jacob, both rider and horse “fell asleep.”"},{"p":7,"t":"You are awesome! Yes, you! Who can withstand your intense anger?"},{"p":8,"t":"From heaven you announced what their punishment would be. The earth was afraid and silent"},{"p":9,"t":"when God arose to execute judgment, and to deliver all the oppressed of the earth. (Selah)"},{"p":10,"t":"Certainly your angry judgment upon men will bring you praise; you reveal your anger in full measure."},{"p":11,"t":"Make vows to the Lord your God and repay them! Let all those who surround him bring tribute to the awesome one!"},{"p":12,"t":"He humbles princes; the kings of the earth regard him as awesome."}],[{"p":1,"t":"For the music director, Jeduthun; a psalm of Asaph. I will cry out to God and call for help! I will cry out to God and he will pay attention to me."},{"p":2,"t":"In my time of trouble I sought the Lord. I kept my hand raised in prayer throughout the night. I refused to be comforted."},{"p":3,"t":"I said, “I will remember God while I groan; I will think about him while my strength leaves me.” (Selah)"},{"p":4,"t":"You held my eyelids open; I was troubled and could not speak."},{"p":5,"t":"I thought about the days of old, about ancient times."},{"p":6,"t":"I said, “During the night I will remember the song I once sang; I will think very carefully.” I tried to make sense of what was happening."},{"p":7,"t":"I asked, “Will the Lord reject me forever? Will he never again show me his favor?"},{"p":8,"t":"Has his loyal love disappeared forever? Has his promise failed forever?"},{"p":9,"t":"Has God forgotten to be merciful? Has his anger stifled his compassion?”"},{"p":10,"t":"Then I said, “I am sickened by the thought that the sovereign One might become inactive."},{"p":11,"t":"I will remember the works of the Lord. Yes, I will remember the amazing things you did long ago!"},{"p":12,"t":"I will think about all you have done; I will reflect upon your deeds!”"},{"p":13,"t":"O God, your deeds are extraordinary! What god can compare to our great God?"},{"p":14,"t":"You are the God who does amazing things; you have revealed your strength among the nations."},{"p":15,"t":"You delivered your people by your strength &#8211; the children of Jacob and Joseph. (Selah)"},{"p":16,"t":"The waters saw you, O God, the waters saw you and trembled. Yes, the depths of the sea shook with fear."},{"p":17,"t":"The clouds poured down rain; the skies thundered. Yes, your arrows flashed about."},{"p":18,"t":"Your thunderous voice was heard in the wind; the lightning bolts lit up the world; the earth trembled and shook."},{"p":19,"t":"You walked through the sea; you passed through the surging waters, but left no footprints."},{"p":20,"t":"You led your people like a flock of sheep, by the hand of Moses and Aaron."}],[{"p":1,"t":"A well-written song by Asaph. Pay attention, my people, to my instruction! Listen to the words I speak!"},{"p":2,"t":"I will sing a song that imparts wisdom; I will make insightful observations about the past."},{"p":3,"t":"What we have heard and learned &#8211; that which our ancestors have told us &#8211;"},{"p":4,"t":"we will not hide from their descendants. We will tell the next generation about the Lord’s praiseworthy acts, about his strength and the amazing things he has done."},{"p":5,"t":"He established a rule in Jacob; he set up a law in Israel. He commanded our ancestors to make his deeds known to their descendants,"},{"p":6,"t":"so that the next generation, children yet to be born, might know about them. They will grow up and tell their descendants about them."},{"p":7,"t":"Then they will place their confidence in God. They will not forget the works of God, and they will obey his commands."},{"p":8,"t":"Then they will not be like their ancestors, who were a stubborn and rebellious generation, a generation that was not committed and faithful to God."},{"p":9,"t":"The Ephraimites were armed with bows, but they retreated in the day of battle."},{"p":10,"t":"They did not keep their covenant with God, and they refused to obey his law."},{"p":11,"t":"They forgot what he had done, the amazing things he had shown them."},{"p":12,"t":"He did amazing things in the sight of their ancestors, in the land of Egypt, in the region of Zoan."},{"p":13,"t":"He divided the sea and led them across it; he made the water stand in a heap."},{"p":14,"t":"He led them with a cloud by day, and with the light of a fire all night long."},{"p":15,"t":"He broke open rocks in the wilderness, and gave them enough water to fill the depths of the sea."},{"p":16,"t":"He caused streams to flow from the rock, and made the water flow like rivers."},{"p":17,"t":"Yet they continued to sin against him, and rebelled against the sovereign One in the desert."},{"p":18,"t":"They willfully challenged God by asking for food to satisfy their appetite."},{"p":19,"t":"They insulted God, saying, “Is God really able to give us food in the wilderness?"},{"p":20,"t":"Yes, he struck a rock and water flowed out, streams gushed forth. But can he also give us food? Will he provide meat for his people?”"},{"p":21,"t":"When the Lord heard this, he was furious. A fire broke out against Jacob, and his anger flared up against Israel,"},{"p":22,"t":"because they did not have faith in God, and did not trust his ability to deliver them."},{"p":23,"t":"He gave a command to the clouds above, and opened the doors in the sky."},{"p":24,"t":"He rained down manna for them to eat; he gave them the grain of heaven."},{"p":25,"t":"Man ate the food of the mighty ones. He sent them more than enough to eat."},{"p":26,"t":"He brought the east wind through the sky, and by his strength led forth the south wind."},{"p":27,"t":"He rained down meat on them like dust, birds as numerous as the sand on the seashores."},{"p":28,"t":"He caused them to fall right in the middle of their camp, all around their homes."},{"p":29,"t":"They ate until they were stuffed; he gave them what they desired."},{"p":30,"t":"They were not yet filled up, their food was still in their mouths,"},{"p":31,"t":"when the anger of God flared up against them. He killed some of the strongest of them; he brought the young men of Israel to their knees."},{"p":32,"t":"Despite all this, they continued to sin, and did not trust him to do amazing things."},{"p":33,"t":"So he caused them to die unsatisfied and filled with terror."},{"p":34,"t":"When he struck them down, they sought his favor; they turned back and longed for God."},{"p":35,"t":"They remembered that God was their protector, and that the sovereign God was their deliverer."},{"p":36,"t":"But they deceived him with their words, and lied to him."},{"p":37,"t":"They were not really committed to him, and they were unfaithful to his covenant."},{"p":38,"t":"Yet he is compassionate. He forgives sin and does not destroy. He often holds back his anger, and does not stir up his fury."},{"p":39,"t":"He remembered that they were made of flesh, and were like a wind that blows past and does not return."},{"p":40,"t":"How often they rebelled against him in the wilderness, and insulted him in the desert!"},{"p":41,"t":"They again challenged God, and offended the Holy One of Israel."},{"p":42,"t":"They did not remember what he had done, how he delivered them from the enemy,"},{"p":43,"t":"when he performed his awesome deeds in Egypt, and his acts of judgment in the region of Zoan."},{"p":44,"t":"He turned their rivers into blood, and they could not drink from their streams."},{"p":45,"t":"He sent swarms of biting insects against them, as well as frogs that overran their land."},{"p":46,"t":"He gave their crops to the grasshopper, the fruit of their labor to the locust."},{"p":47,"t":"He destroyed their vines with hail, and their sycamore-fig trees with driving rain."},{"p":48,"t":"He rained hail down on their cattle, and hurled lightning bolts down on their livestock."},{"p":49,"t":"His raging anger lashed out against them, He sent fury, rage, and trouble as messengers who bring disaster."},{"p":50,"t":"He sent his anger in full force; he did not spare them from death; he handed their lives over to destruction."},{"p":51,"t":"He struck down all the firstborn in Egypt, the firstfruits of their reproductive power in the tents of Ham."},{"p":52,"t":"Yet he brought out his people like sheep; he led them through the wilderness like a flock."},{"p":53,"t":"He guided them safely along, while the sea covered their enemies."},{"p":54,"t":"He brought them to the border of his holy land, to this mountainous land which his right hand acquired."},{"p":55,"t":"He drove the nations out from before them; he assigned them their tribal allotments and allowed the tribes of Israel to settle down."},{"p":56,"t":"Yet they challenged and defied the sovereign God, and did not obey his commands."},{"p":57,"t":"They were unfaithful and acted as treacherously as their ancestors; they were as unreliable as a malfunctioning bow."},{"p":58,"t":"They made him angry with their pagan shrines, and made him jealous with their idols."},{"p":59,"t":"God heard and was angry; he completely rejected Israel."},{"p":60,"t":"He abandoned the sanctuary at Shiloh, the tent where he lived among men."},{"p":61,"t":"He allowed the symbol of his strong presence to be captured; he gave the symbol of his splendor into the hand of the enemy."},{"p":62,"t":"He delivered his people over to the sword, and was angry with his chosen nation."},{"p":63,"t":"Fire consumed their young men, and their virgins remained unmarried."},{"p":64,"t":"Their priests fell by the sword, but their widows did not weep."},{"p":65,"t":"But then the Lord awoke from his sleep; he was like a warrior in a drunken rage."},{"p":66,"t":"He drove his enemies back; he made them a permanent target for insults."},{"p":67,"t":"He rejected the tent of Joseph; he did not choose the tribe of Ephraim."},{"p":68,"t":"He chose the tribe of Judah, and Mount Zion, which he loves."},{"p":69,"t":"He made his sanctuary as enduring as the heavens above; as secure as the earth, which he established permanently."},{"p":70,"t":"He chose David, his servant, and took him from the sheepfolds."},{"p":71,"t":"He took him away from following the mother sheep, and made him the shepherd of Jacob, his people, and of Israel, his chosen nation."},{"p":72,"t":"David cared for them with pure motives; he led them with skill."}],[{"p":1,"t":"A psalm of Asaph. O God, foreigners have invaded your chosen land; they have polluted your holy temple and turned Jerusalem into a heap of ruins."},{"p":2,"t":"They have given the corpses of your servants to the birds of the sky; the flesh of your loyal followers to the beasts of the earth."},{"p":3,"t":"They have made their blood flow like water all around Jerusalem, and there is no one to bury them."},{"p":4,"t":"We have become an object of disdain to our neighbors; those who live on our borders taunt and insult us."},{"p":5,"t":"How long will this go on, O Lord? Will you stay angry forever? How long will your rage burn like fire?"},{"p":6,"t":"Pour out your anger on the nations that do not acknowledge you, on the kingdoms that do not pray to you!"},{"p":7,"t":"For they have devoured Jacob and destroyed his home."},{"p":8,"t":"Do not hold us accountable for the sins of earlier generations! Quickly send your compassion our way, for we are in serious trouble!"},{"p":9,"t":"Help us, O God, our deliverer! For the sake of your glorious reputation, rescue us! Forgive our sins for the sake of your reputation!"},{"p":10,"t":"Why should the nations say, “Where is their God?” Before our very eyes may the shed blood of your servants be avenged among the nations!"},{"p":11,"t":"Listen to the painful cries of the prisoners! Use your great strength to set free those condemned to die!"},{"p":12,"t":"Pay back our neighbors in full! May they be insulted the same way they insulted you, O Lord!"},{"p":13,"t":"Then we, your people, the sheep of your pasture, will continually thank you. We will tell coming generations of your praiseworthy acts."}],[{"p":1,"t":"For the music director; according to the shushan-eduth style; a psalm of Asaph. O shepherd of Israel, pay attention, you who lead Joseph like a flock of sheep! You who sit enthroned above the winged angels, reveal your splendor!"},{"p":2,"t":"In the sight of Ephraim, Benjamin, and Manasseh reveal your power! Come and deliver us!"},{"p":3,"t":"O God, restore us! Smile on us! Then we will be delivered!"},{"p":4,"t":"O Lord God, invincible warrior! How long will you remain angry at your people while they pray to you?"},{"p":5,"t":"You have given them tears as food; you have made them drink tears by the measure."},{"p":6,"t":"You have made our neighbors dislike us, and our enemies insult us."},{"p":7,"t":"O God, invincible warrior, restore us! Smile on us! Then we will be delivered!"},{"p":8,"t":"You uprooted a vine from Egypt; you drove out nations and transplanted it."},{"p":9,"t":"You cleared the ground for it; it took root, and filled the land."},{"p":10,"t":"The mountains were covered by its shadow, the highest cedars by its branches."},{"p":11,"t":"Its branches reached the Mediterranean Sea, and its shoots the Euphrates River."},{"p":12,"t":"Why did you break down its walls, so that all who pass by pluck its fruit?"},{"p":13,"t":"The wild boars of the forest ruin it; the insects of the field feed on it."},{"p":14,"t":"O God, invincible warrior, come back! Look down from heaven and take notice! Take care of this vine,"},{"p":15,"t":"the root your right hand planted, the shoot you made to grow!"},{"p":16,"t":"It is burned and cut down. They die because you are displeased with them."},{"p":17,"t":"May you give support to the one you have chosen, to the one whom you raised up for yourself!"},{"p":18,"t":"Then we will not turn away from you. Revive us and we will pray to you!"},{"p":19,"t":"O Lord God, invincible warrior, restore us! Smile on us! Then we will be delivered!"}],[{"p":1,"t":"For the music director; according to the gittith style; by Asaph. Shout for joy to God, our source of strength! Shout out to the God of Jacob!"},{"p":2,"t":"Sing a song and play the tambourine, the pleasant sounding harp, and the ten-stringed instrument!"},{"p":3,"t":"Sound the ram’s horn on the day of the new moon, and on the day of the full moon when our festival begins."},{"p":4,"t":"For observing the festival is a requirement for Israel; it is an ordinance given by the God of Jacob."},{"p":5,"t":"He decreed it as a regulation in Joseph, when he attacked the land of Egypt. I heard a voice I did not recognize."},{"p":6,"t":"It said: “I removed the burden from his shoulder; his hands were released from holding the basket."},{"p":7,"t":"In your distress you called out and I rescued you. I answered you from a dark thundercloud. I tested you at the waters of Meribah. (Selah)"},{"p":8,"t":"I said, ‘Listen, my people! I will warn you! O Israel, if only you would obey me!"},{"p":9,"t":"There must be no other god among you. You must not worship a foreign god."},{"p":10,"t":"I am the Lord, your God, the one who brought you out of the land of Egypt. Open your mouth wide and I will fill it!’"},{"p":11,"t":"But my people did not obey me; Israel did not submit to me."},{"p":12,"t":"I gave them over to their stubborn desires; they did what seemed right to them."},{"p":13,"t":"If only my people would obey me! If only Israel would keep my commands!"},{"p":14,"t":"Then I would quickly subdue their enemies, and attack their adversaries.”"},{"p":15,"t":"(May those who hate the Lord cower in fear before him! May they be permanently humiliated!)"},{"p":16,"t":"“I would feed Israel the best wheat, and would satisfy your appetite with honey from the rocky cliffs.”"}],[{"p":1,"t":"A psalm of Asaph. God stands in the assembly of El; in the midst of the gods he renders judgment."},{"p":2,"t":"He says, “How long will you make unjust legal decisions and show favoritism to the wicked? (Selah)"},{"p":3,"t":"Defend the cause of the poor and the fatherless! Vindicate the oppressed and suffering!"},{"p":4,"t":"Rescue the poor and needy! Deliver them from the power of the wicked!"},{"p":5,"t":"They neither know nor understand. They stumble around in the dark, while all the foundations of the earth crumble."},{"p":6,"t":"I thought, ‘You are gods; all of you are sons of the Most High.’"},{"p":7,"t":"Yet you will die like mortals; you will fall like all the other rulers.”"},{"p":8,"t":"Rise up, O God, and execute judgment on the earth! For you own all the nations."}],[{"p":1,"t":"A song, a psalm of Asaph. O God, do not be silent! Do not ignore us! Do not be inactive, O God!"},{"p":2,"t":"For look, your enemies are making a commotion; those who hate you are hostile."},{"p":3,"t":"They carefully plot against your people, and make plans to harm the ones you cherish."},{"p":4,"t":"They say, “Come on, let’s annihilate them so they are no longer a nation! Then the name of Israel will be remembered no more.”"},{"p":5,"t":"Yes, they devise a unified strategy; they form an alliance against you."},{"p":6,"t":"It includes the tents of Edom and the Ishmaelites, Moab and the Hagrites,"},{"p":7,"t":"Gebal, Ammon, and Amalek, Philistia and the inhabitants of Tyre."},{"p":8,"t":"Even Assyria has allied with them, lending its strength to the descendants of Lot. (Selah)"},{"p":9,"t":"Do to them as you did to Midian &#8211; as you did to Sisera and Jabin at the Kishon River!"},{"p":10,"t":"They were destroyed at Endor; their corpses were like manure on the ground."},{"p":11,"t":"Make their nobles like Oreb and Zeeb, and all their rulers like Zebah and Zalmunna,"},{"p":12,"t":"who said, “Let’s take over the pastures of God!”"},{"p":13,"t":"O my God, make them like dead thistles, like dead weeds blown away by the wind!"},{"p":14,"t":"Like the fire that burns down the forest, or the flames that consume the mountainsides,"},{"p":15,"t":"chase them with your gale winds, and terrify them with your windstorm."},{"p":16,"t":"Cover their faces with shame, so they might seek you, O Lord."},{"p":17,"t":"May they be humiliated and continually terrified! May they die in shame!"},{"p":18,"t":"Then they will know that you alone are the Lord, the sovereign king over all the earth."}],[{"p":1,"t":"For the music director; according to the gittith style; written by the Korahites, a psalm. How lovely is the place where you live, O Lord who rules over all!"},{"p":2,"t":"I desperately want to be in the courts of the Lord’s temple. My heart and my entire being shout for joy to the living God."},{"p":3,"t":"Even the birds find a home there, and the swallow builds a nest, where she can protect her young near your altars, O Lord who rules over all, my king and my God."},{"p":4,"t":"How blessed are those who live in your temple and praise you continually! (Selah)"},{"p":5,"t":"How blessed are those who find their strength in you, and long to travel the roads that lead to your temple!"},{"p":6,"t":"As they pass through the Baca Valley, he provides a spring for them. The rain even covers it with pools of water."},{"p":7,"t":"They are sustained as they travel along; each one appears before God in Zion."},{"p":8,"t":"O Lord, sovereign God, hear my prayer! Listen, O God of Jacob! (Selah)"},{"p":9,"t":"O God, take notice of our shield! Show concern for your chosen king!"},{"p":10,"t":"Certainly spending just one day in your temple courts is better than spending a thousand elsewhere. I would rather stand at the entrance to the temple of my God than live in the tents of the wicked."},{"p":11,"t":"For the Lord God is our sovereign protector. The Lord bestows favor and honor; he withholds no good thing from those who have integrity."},{"p":12,"t":"O Lord who rules over all, how blessed are those who trust in you!"}],[{"p":1,"t":"For the music director; written by the Korahites, a psalm. O Lord, you showed favor to your land; you restored the well-being of Jacob."},{"p":2,"t":"You pardoned the wrongdoing of your people; you forgave all their sin. (Selah)"},{"p":3,"t":"You withdrew all your fury; you turned back from your raging anger."},{"p":4,"t":"Restore us, O God our deliverer! Do not be displeased with us!"},{"p":5,"t":"Will you stay mad at us forever? Will you remain angry throughout future generations?"},{"p":6,"t":"Will you not revive us once more? Then your people will rejoice in you!"},{"p":7,"t":"O Lord, show us your loyal love! Bestow on us your deliverance!"},{"p":8,"t":"I will listen to what God the Lord says. For he will make peace with his people, his faithful followers. Yet they must not return to their foolish ways."},{"p":9,"t":"Certainly his loyal followers will soon experience his deliverance; then his splendor will again appear in our land."},{"p":10,"t":"Loyal love and faithfulness meet; deliverance and peace greet each other with a kiss."},{"p":11,"t":"Faithfulness grows from the ground, and deliverance looks down from the sky."},{"p":12,"t":"Yes, the Lord will bestow his good blessings, and our land will yield its crops."},{"p":13,"t":"Deliverance goes before him, and prepares a pathway for him."}],[{"p":1,"t":"A prayer of David. Listen O Lord! Answer me! For I am oppressed and needy."},{"p":2,"t":"Protect me, for I am loyal! O my God, deliver your servant, who trusts in you!"},{"p":3,"t":"Have mercy on me, O Lord, for I cry out to you all day long!"},{"p":4,"t":"Make your servant glad, for to you, O Lord, I pray!"},{"p":5,"t":"Certainly O Lord, you are kind and forgiving, and show great faithfulness to all who cry out to you."},{"p":6,"t":"O Lord, hear my prayer! Pay attention to my plea for mercy!"},{"p":7,"t":"In my time of trouble I cry out to you, for you will answer me."},{"p":8,"t":"None can compare to you among the gods, O Lord! Your exploits are incomparable!"},{"p":9,"t":"All the nations, whom you created, will come and worship you, O Lord. They will honor your name."},{"p":10,"t":"For you are great and do amazing things. You alone are God."},{"p":11,"t":"O Lord, teach me how you want me to live! Then I will obey your commands. Make me wholeheartedly committed to you!"},{"p":12,"t":"O Lord, my God, I will give you thanks with my whole heart! I will honor your name continually!"},{"p":13,"t":"For you will extend your great loyal love to me, and will deliver my life from the depths of Sheol."},{"p":14,"t":"O God, arrogant men attack me; a gang of ruthless men, who do not respect you, seek my life."},{"p":15,"t":"But you, O Lord, are a compassionate and merciful God. You are patient and demonstrate great loyal love and faithfulness."},{"p":16,"t":"Turn toward me and have mercy on me! Give your servant your strength! Deliver your slave!"},{"p":17,"t":"Show me evidence of your favor! Then those who hate me will see it and be ashamed, for you, O Lord, will help me and comfort me."}],[{"p":1,"t":"Written by the Korahites; a psalm, a song. The Lord’s city is in the holy hills."},{"p":2,"t":"The Lord loves the gates of Zion more than all the dwelling places of Jacob."},{"p":3,"t":"People say wonderful things about you, O city of God. (Selah)"},{"p":4,"t":"I mention Rahab and Babylon to my followers. Here are Philistia and Tyre, along with Ethiopia. It is said of them, “This one was born there.”"},{"p":5,"t":"But it is said of Zion’s residents, “Each one of these was born in her, and the sovereign One makes her secure.”"},{"p":6,"t":"The Lord writes in the census book of the nations, “This one was born there.” (Selah)"},{"p":7,"t":"As for the singers, as well as the pipers &#8211; all of them sing within your walls."}],[{"p":1,"t":"A song, a psalm written by the Korahites; for the music director; according to the machalath-leannoth style; a well-written song by Heman the Ezrachite. O Lord God who delivers me! By day I cry out and at night I pray before you."},{"p":2,"t":"Listen to my prayer! Pay attention to my cry for help!"},{"p":3,"t":"For my life is filled with troubles and I am ready to enter Sheol."},{"p":4,"t":"They treat me like those who descend into the grave. I am like a helpless man,"},{"p":5,"t":"adrift among the dead, like corpses lying in the grave, whom you remember no more, and who are cut off from your power."},{"p":6,"t":"You place me in the lowest regions of the pit, in the dark places, in the watery depths."},{"p":7,"t":"Your anger bears down on me, and you overwhelm me with all your waves. (Selah)"},{"p":8,"t":"You cause those who know me to keep their distance; you make me an appalling sight to them. I am trapped and cannot get free."},{"p":9,"t":"My eyes grow weak because of oppression. I call out to you, O Lord, all day long; I spread out my hands in prayer to you."},{"p":10,"t":"Do you accomplish amazing things for the dead? Do the departed spirits rise up and give you thanks? (Selah)"},{"p":11,"t":"Is your loyal love proclaimed in the grave, or your faithfulness in the place of the dead?"},{"p":12,"t":"Are your amazing deeds experienced in the dark region, or your deliverance in the land of oblivion?"},{"p":13,"t":"As for me, I cry out to you, O Lord; in the morning my prayer confronts you."},{"p":14,"t":"O Lord, why do you reject me, and pay no attention to me?"},{"p":15,"t":"I am oppressed and have been on the verge of death since my youth. I have been subjected to your horrors and am numb with pain."},{"p":16,"t":"Your anger overwhelms me; your terrors destroy me."},{"p":17,"t":"They surround me like water all day long; they join forces and encircle me."},{"p":18,"t":"You cause my friends and neighbors to keep their distance; those who know me leave me alone in the darkness."}],[{"p":1,"t":"A well-written song by Ethan the Ezrachite. I will sing continually about the Lord’s faithful deeds; to future generations I will proclaim your faithfulness."},{"p":2,"t":"For I say, “Loyal love is permanently established; in the skies you set up your faithfulness.”"},{"p":3,"t":"The Lord said, “I have made a covenant with my chosen one; I have made a promise on oath to David, my servant:"},{"p":4,"t":"‘I will give you an eternal dynasty and establish your throne throughout future generations.’” (Selah)"},{"p":5,"t":"O Lord, the heavens praise your amazing deeds, as well as your faithfulness in the angelic assembly."},{"p":6,"t":"For who in the skies can compare to the Lord? Who is like the Lord among the heavenly beings,"},{"p":7,"t":"a God who is honored in the great angelic assembly, and more awesome than all who surround him?"},{"p":8,"t":"O Lord, sovereign God! Who is strong like you, O Lord? Your faithfulness surrounds you."},{"p":9,"t":"You rule over the proud sea. When its waves surge, you calm them."},{"p":10,"t":"You crushed the Proud One and killed it; with your strong arm you scattered your enemies."},{"p":11,"t":"The heavens belong to you, as does the earth. You made the world and all it contains."},{"p":12,"t":"You created the north and the south. Tabor and Hermon rejoice in your name."},{"p":13,"t":"Your arm is powerful, your hand strong, your right hand victorious."},{"p":14,"t":"Equity and justice are the foundation of your throne. Loyal love and faithfulness characterize your rule."},{"p":15,"t":"How blessed are the people who worship you! O Lord, they experience your favor."},{"p":16,"t":"They rejoice in your name all day long, and are vindicated by your justice."},{"p":17,"t":"For you give them splendor and strength. By your favor we are victorious."},{"p":18,"t":"For our shield belongs to the Lord, our king to the Holy One of Israel."},{"p":19,"t":"Then you spoke through a vision to your faithful followers and said: “I have energized a warrior; I have raised up a young man from the people."},{"p":20,"t":"I have discovered David, my servant. With my holy oil I have anointed him as king."},{"p":21,"t":"My hand will support him, and my arm will strengthen him."},{"p":22,"t":"No enemy will be able to exact tribute from him; a violent oppressor will not be able to humiliate him."},{"p":23,"t":"I will crush his enemies before him; I will strike down those who hate him."},{"p":24,"t":"He will experience my faithfulness and loyal love, and by my name he will win victories."},{"p":25,"t":"I will place his hand over the sea, his right hand over the rivers."},{"p":26,"t":"He will call out to me, ‘You are my father, my God, and the protector who delivers me.’"},{"p":27,"t":"I will appoint him to be my firstborn son, the most exalted of the earth’s kings."},{"p":28,"t":"I will always extend my loyal love to him, and my covenant with him is secure."},{"p":29,"t":"I will give him an eternal dynasty, and make his throne as enduring as the skies above."},{"p":30,"t":"If his sons reject my law and disobey my regulations,"},{"p":31,"t":"if they break my rules and do not keep my commandments,"},{"p":32,"t":"I will punish their rebellion by beating them with a club, their sin by inflicting them with bruises."},{"p":33,"t":"But I will not remove my loyal love from him, nor be unfaithful to my promise."},{"p":34,"t":"I will not break my covenant or go back on what I promised."},{"p":35,"t":"Once and for all I have vowed by my own holiness, I will never deceive David."},{"p":36,"t":"His dynasty will last forever. His throne will endure before me, like the sun,"},{"p":37,"t":"it will remain stable, like the moon, his throne will endure like the skies.” (Selah)"},{"p":38,"t":"But you have spurned and rejected him; you are angry with your chosen king."},{"p":39,"t":"You have repudiated your covenant with your servant; you have thrown his crown to the ground."},{"p":40,"t":"You have broken down all his walls; you have made his strongholds a heap of ruins."},{"p":41,"t":"All who pass by have robbed him; he has become an object of disdain to his neighbors."},{"p":42,"t":"You have allowed his adversaries to be victorious, and all his enemies to rejoice."},{"p":43,"t":"You turn back his sword from the adversary, and have not sustained him in battle."},{"p":44,"t":"You have brought to an end his splendor, and have knocked his throne to the ground."},{"p":45,"t":"You have cut short his youth, and have covered him with shame. (Selah)"},{"p":46,"t":"How long, O Lord, will this last? Will you remain hidden forever? Will your anger continue to burn like fire?"},{"p":47,"t":"Take note of my brief lifespan! Why do you make all people so mortal?"},{"p":48,"t":"No man can live on without experiencing death, or deliver his life from the power of Sheol. (Selah)"},{"p":49,"t":"Where are your earlier faithful deeds, O Lord, the ones performed in accordance with your reliable oath to David?"},{"p":50,"t":"Take note, O Lord, of the way your servants are taunted, and of how I must bear so many insults from people!"},{"p":51,"t":"Your enemies, O Lord, hurl insults; they insult your chosen king as they dog his footsteps."},{"p":52,"t":"The Lord deserves praise forevermore! We agree! We agree!"}],[{"p":1,"t":"A prayer of Moses, the man of God. O Lord, you have been our protector through all generations!"},{"p":2,"t":"Even before the mountains came into existence, or you brought the world into being, you were the eternal God."},{"p":3,"t":"You make mankind return to the dust, and say, “Return, O people!”"},{"p":4,"t":"Yes, in your eyes a thousand years are like yesterday that quickly passes, or like one of the divisions of the nighttime."},{"p":5,"t":"You bring their lives to an end and they “fall asleep.” In the morning they are like the grass that sprouts up;"},{"p":6,"t":"in the morning it glistens and sprouts up; at evening time it withers and dries up."},{"p":7,"t":"Yes, we are consumed by your anger; we are terrified by your wrath."},{"p":8,"t":"You are aware of our sins; you even know about our hidden sins."},{"p":9,"t":"Yes, throughout all our days we experience your raging fury; the years of our lives pass quickly, like a sigh."},{"p":10,"t":"The days of our lives add up to seventy years, or eighty, if one is especially strong. But even one’s best years are marred by trouble and oppression. Yes, they pass quickly and we fly away."},{"p":11,"t":"Who can really fathom the intensity of your anger? Your raging fury causes people to fear you."},{"p":12,"t":"So teach us to consider our mortality, so that we might live wisely."},{"p":13,"t":"Turn back toward us, O Lord! How long must this suffering last? Have pity on your servants!"},{"p":14,"t":"Satisfy us in the morning with your loyal love! Then we will shout for joy and be happy all our days!"},{"p":15,"t":"Make us happy in proportion to the days you have afflicted us, in proportion to the years we have experienced trouble!"},{"p":16,"t":"May your servants see your work! May their sons see your majesty!"},{"p":17,"t":"May our sovereign God extend his favor to us! Make our endeavors successful! Yes, make them successful!"}],[{"p":1,"t":"As for you, the one who lives in the shelter of the sovereign One, and resides in the protective shadow of the mighty king &#8211;"},{"p":2,"t":"I say this about the Lord, my shelter and my stronghold, my God in whom I trust &#8211;"},{"p":3,"t":"he will certainly rescue you from the snare of the hunter and from the destructive plague."},{"p":4,"t":"He will shelter you with his wings; you will find safety under his wings. His faithfulness is like a shield or a protective wall."},{"p":5,"t":"You need not fear the terrors of the night, the arrow that flies by day,"},{"p":6,"t":"the plague that comes in the darkness, or the disease that comes at noon."},{"p":7,"t":"Though a thousand may fall beside you, and a multitude on your right side, it will not reach you."},{"p":8,"t":"Certainly you will see it with your very own eyes &#8211; you will see the wicked paid back."},{"p":9,"t":"For you have taken refuge in the Lord, my shelter, the sovereign One."},{"p":10,"t":"No harm will overtake you; no illness will come near your home."},{"p":11,"t":"For he will order his angels to protect you in all you do."},{"p":12,"t":"They will lift you up in their hands, so you will not slip and fall on a stone."},{"p":13,"t":"You will subdue a lion and a snake; you will trample underfoot a young lion and a serpent."},{"p":14,"t":"The Lord says, “Because he is devoted to me, I will deliver him; I will protect him because he is loyal to me."},{"p":15,"t":"When he calls out to me, I will answer him. I will be with him when he is in trouble; I will rescue him and bring him honor."},{"p":16,"t":"I will satisfy him with long life, and will let him see my salvation."}],[{"p":1,"t":"A psalm; a song for the Sabbath day. It is fitting to thank the Lord, and to sing praises to your name, O sovereign One!"},{"p":2,"t":"It is fitting to proclaim your loyal love in the morning, and your faithfulness during the night,"},{"p":3,"t":"to the accompaniment of a ten-stringed instrument and a lyre, to the accompaniment of the meditative tone of the harp."},{"p":4,"t":"For you, O Lord, have made me happy by your work. I will sing for joy because of what you have done."},{"p":5,"t":"How great are your works, O Lord! Your plans are very intricate!"},{"p":6,"t":"The spiritually insensitive do not recognize this; the fool does not understand this."},{"p":7,"t":"When the wicked sprout up like grass, and all the evildoers glisten, it is so that they may be annihilated."},{"p":8,"t":"But you, O Lord, reign forever!"},{"p":9,"t":"Indeed, look at your enemies, O Lord! Indeed, look at how your enemies perish! All the evildoers are scattered!"},{"p":10,"t":"You exalt my horn like that of a wild ox. I am covered with fresh oil."},{"p":11,"t":"I gloat in triumph over those who tried to ambush me; I hear the defeated cries of the evil foes who attacked me."},{"p":12,"t":"The godly grow like a palm tree; they grow high like a cedar in Lebanon."},{"p":13,"t":"Planted in the Lord’s house, they grow in the courts of our God."},{"p":14,"t":"They bear fruit even when they are old; they are filled with vitality and have many leaves."},{"p":15,"t":"So they proclaim that the Lord, my protector, is just and never unfair."}],[{"p":1,"t":"The Lord reigns! He is robed in majesty, the Lord is robed, he wears strength around his waist. Indeed, the world is established, it cannot be moved."},{"p":2,"t":"Your throne has been secure from ancient times; you have always been king."},{"p":3,"t":"The waves roar, O Lord, the waves roar, the waves roar and crash."},{"p":4,"t":"Above the sound of the surging water, and the mighty waves of the sea, the Lord sits enthroned in majesty."},{"p":5,"t":"The rules you set down are completely reliable. Holiness aptly adorns your house, O Lord, forever."}],[{"p":1,"t":"O Lord, the God who avenges! O God who avenges, reveal your splendor!"},{"p":2,"t":"Rise up, O judge of the earth! Pay back the proud!"},{"p":3,"t":"O Lord, how long will the wicked, how long will the wicked celebrate?"},{"p":4,"t":"They spew out threats and speak defiantly; all the evildoers boast."},{"p":5,"t":"O Lord, they crush your people; they oppress the nation that belongs to you."},{"p":6,"t":"They kill the widow and the one residing outside his native land, and they murder the fatherless."},{"p":7,"t":"Then they say, “The Lord does not see this; the God of Jacob does not take notice of it.”"},{"p":8,"t":"Take notice of this, you ignorant people! You fools, when will you ever understand?"},{"p":9,"t":"Does the one who makes the human ear not hear? Does the one who forms the human eye not see?"},{"p":10,"t":"Does the one who disciplines the nations not punish? He is the one who imparts knowledge to human beings!"},{"p":11,"t":"The Lord knows that peoples’ thoughts are morally bankrupt."},{"p":12,"t":"How blessed is the one whom you instruct, O Lord, the one whom you teach from your law,"},{"p":13,"t":"in order to protect him from times of trouble, until the wicked are destroyed."},{"p":14,"t":"Certainly the Lord does not forsake his people; he does not abandon the nation that belongs to him."},{"p":15,"t":"For justice will prevail, and all the morally upright will be vindicated."},{"p":16,"t":"Who will rise up to defend me against the wicked? Who will stand up for me against the evildoers?"},{"p":17,"t":"If the Lord had not helped me, I would have laid down in the silence of death."},{"p":18,"t":"If I say, “My foot is slipping,” your loyal love, O Lord, supports me."},{"p":19,"t":"When worries threaten to overwhelm me, your soothing touch makes me happy."},{"p":20,"t":"Cruel rulers are not your allies, those who make oppressive laws."},{"p":21,"t":"They conspire against the blameless, and condemn to death the innocent."},{"p":22,"t":"But the Lord will protect me, and my God will shelter me."},{"p":23,"t":"He will pay them back for their sin. He will destroy them because of their evil; the Lord our God will destroy them."}],[{"p":1,"t":"Come! Let’s sing for joy to the Lord! Let’s shout out praises to our protector who delivers us!"},{"p":2,"t":"Let’s enter his presence with thanksgiving! Let’s shout out to him in celebration!"},{"p":3,"t":"For the Lord is a great God, a great king who is superior to all gods."},{"p":4,"t":"The depths of the earth are in his hand, and the mountain peaks belong to him."},{"p":5,"t":"The sea is his, for he made it. His hands formed the dry land."},{"p":6,"t":"Come! Let’s bow down and worship! Let’s kneel before the Lord, our creator!"},{"p":7,"t":"For he is our God; we are the people of his pasture, the sheep he owns. Today, if only you would obey him!"},{"p":8,"t":"He says, “Do not be stubborn like they were at Meribah, like they were that day at Massah in the wilderness,"},{"p":9,"t":"where your ancestors challenged my authority, and tried my patience, even though they had seen my work."},{"p":10,"t":"For forty years I was continually disgusted with that generation, and I said, ‘These people desire to go astray; they do not obey my commands.’"},{"p":11,"t":"So I made a vow in my anger, ‘They will never enter into the resting place I had set aside for them.’”"}],[{"p":1,"t":"Sing to the Lord a new song! Sing to the Lord, all the earth!"},{"p":2,"t":"Sing to the Lord! Praise his name! Announce every day how he delivers!"},{"p":3,"t":"Tell the nations about his splendor! Tell all the nations about his amazing deeds!"},{"p":4,"t":"For the Lord is great and certainly worthy of praise; he is more awesome than all gods."},{"p":5,"t":"For all the gods of the nations are worthless, but the Lord made the sky."},{"p":6,"t":"Majestic splendor emanates from him; his sanctuary is firmly established and beautiful."},{"p":7,"t":"Ascribe to the Lord, O families of the nations, ascribe to the Lord splendor and strength!"},{"p":8,"t":"Ascribe to the Lord the splendor he deserves! Bring an offering and enter his courts!"},{"p":9,"t":"Worship the Lord in holy attire! Tremble before him, all the earth!"},{"p":10,"t":"Say among the nations, “The Lord reigns! The world is established, it cannot be moved. He judges the nations fairly.”"},{"p":11,"t":"Let the sky rejoice, and the earth be happy! Let the sea and everything in it shout!"},{"p":12,"t":"Let the fields and everything in them celebrate! Then let the trees of the forest shout with joy"},{"p":13,"t":"before the Lord, for he comes! For he comes to judge the earth! He judges the world fairly, and the nations in accordance with his justice."}],[{"p":1,"t":"The Lord reigns! Let the earth be happy! Let the many coastlands rejoice!"},{"p":2,"t":"Dark clouds surround him; equity and justice are the foundation of his throne."},{"p":3,"t":"Fire goes before him; on every side it burns up his enemies."},{"p":4,"t":"His lightning bolts light up the world; the earth sees and trembles."},{"p":5,"t":"The mountains melt like wax before the Lord, before the Lord of the whole earth."},{"p":6,"t":"The sky declares his justice, and all the nations see his splendor."},{"p":7,"t":"All who worship idols are ashamed, those who boast about worthless idols. All the gods bow down before him."},{"p":8,"t":"Zion hears and rejoices, the towns of Judah are happy, because of your judgments, O Lord."},{"p":9,"t":"For you, O Lord, are the sovereign king over the whole earth; you are elevated high above all gods."},{"p":10,"t":"You who love the Lord, hate evil! He protects the lives of his faithful followers; he delivers them from the power of the wicked."},{"p":11,"t":"The godly bask in the light; the morally upright experience joy."},{"p":12,"t":"You godly ones, rejoice in the Lord! Give thanks to his holy name."}],[{"p":1,"t":"A psalm. Sing to the Lord a new song, for he performs amazing deeds! His right hand and his mighty arm accomplish deliverance."},{"p":2,"t":"The Lord demonstrates his power to deliver; in the sight of the nations he reveals his justice."},{"p":3,"t":"He remains loyal and faithful to the family of Israel. All the ends of the earth see our God deliver us."},{"p":4,"t":"Shout out praises to the Lord, all the earth! Break out in a joyful shout and sing!"},{"p":5,"t":"Sing to the Lord accompanied by a harp, accompanied by a harp and the sound of music!"},{"p":6,"t":"With trumpets and the blaring of the ram’s horn, shout out praises before the king, the Lord!"},{"p":7,"t":"Let the sea and everything in it shout, along with the world and those who live in it!"},{"p":8,"t":"Let the rivers clap their hands! Let the mountains sing in unison"},{"p":9,"t":"before the Lord! For he comes to judge the earth! He judges the world fairly, and the nations in a just manner."}],[{"p":1,"t":"The Lord reigns! The nations tremble. He sits enthroned above the winged angels; the earth shakes."},{"p":2,"t":"The Lord is elevated in Zion; he is exalted over all the nations."},{"p":3,"t":"Let them praise your great and awesome name! He is holy!"},{"p":4,"t":"The king is strong; he loves justice. You ensure that legal decisions will be made fairly; you promote justice and equity in Jacob."},{"p":5,"t":"Praise the Lord our God! Worship before his footstool! He is holy!"},{"p":6,"t":"Moses and Aaron were among his priests; Samuel was one of those who prayed to him. They prayed to the Lord and he answered them."},{"p":7,"t":"He spoke to them from a pillar of cloud; they obeyed his regulations and the ordinance he gave them."},{"p":8,"t":"O Lord our God, you answered them. They found you to be a forgiving God, but also one who punished their sinful deeds."},{"p":9,"t":"Praise the Lord our God! Worship on his holy hill, for the Lord our God is holy!"}],[{"p":1,"t":"A thanksgiving psalm. Shout out praises to the Lord, all the earth!"},{"p":2,"t":"Worship the Lord with joy! Enter his presence with joyful singing!"},{"p":3,"t":"Acknowledge that the Lord is God! He made us and we belong to him; we are his people, the sheep of his pasture."},{"p":4,"t":"Enter his gates with thanksgiving, and his courts with praise! Give him thanks! Praise his name!"},{"p":5,"t":"For the Lord is good. His loyal love endures, and he is faithful through all generations."}],[{"p":1,"t":"A psalm of David. I will sing about loyalty and justice! To you, O Lord, I will sing praises!"},{"p":2,"t":"I will walk in the way of integrity. When will you come to me? I will conduct my business with integrity in the midst of my palace."},{"p":3,"t":"I will not even consider doing what is dishonest. I hate doing evil; I will have no part of it."},{"p":4,"t":"I will have nothing to do with a perverse person; I will not permit evil."},{"p":5,"t":"I will destroy anyone who slanders his neighbor in secret. I will not tolerate anyone who has a cocky demeanor and an arrogant attitude."},{"p":6,"t":"I will favor the honest people of the land, and allow them to live with me. Those who walk in the way of integrity will attend me."},{"p":7,"t":"Deceitful people will not live in my palace. Liars will not be welcome in my presence."},{"p":8,"t":"Each morning I will destroy all the wicked people in the land, and remove all evildoers from the city of the Lord."}],[{"p":1,"t":"The prayer of an oppressed man, as he grows faint and pours out his lament before the Lord. O Lord, hear my prayer! Pay attention to my cry for help!"},{"p":2,"t":"Do not ignore me in my time of trouble! Listen to me! When I call out to you, quickly answer me!"},{"p":3,"t":"For my days go up in smoke, and my bones are charred like a fireplace."},{"p":4,"t":"My heart is parched and withered like grass, for I am unable to eat food."},{"p":5,"t":"Because of the anxiety that makes me groan, my bones protrude from my skin."},{"p":6,"t":"I am like an owl in the wilderness; I am like a screech owl among the ruins."},{"p":7,"t":"I stay awake; I am like a solitary bird on a roof."},{"p":8,"t":"All day long my enemies taunt me; those who mock me use my name in their curses."},{"p":9,"t":"For I eat ashes as if they were bread, and mix my drink with my tears,"},{"p":10,"t":"because of your anger and raging fury. Indeed, you pick me up and throw me away."},{"p":11,"t":"My days are coming to an end, and I am withered like grass."},{"p":12,"t":"But you, O Lord, rule forever, and your reputation endures."},{"p":13,"t":"You will rise up and have compassion on Zion. For it is time to have mercy on her, for the appointed time has come."},{"p":14,"t":"Indeed, your servants take delight in her stones, and feel compassion for the dust of her ruins."},{"p":15,"t":"The nations will respect the reputation of the Lord, and all the kings of the earth will respect his splendor,"},{"p":16,"t":"when the Lord rebuilds Zion, and reveals his splendor,"},{"p":17,"t":"when he responds to the prayer of the destitute, and does not reject their request."},{"p":18,"t":"The account of his intervention will be recorded for future generations; people yet to be born will praise the Lord."},{"p":19,"t":"For he will look down from his sanctuary above; from heaven the Lord will look toward earth,"},{"p":20,"t":"in order to hear the painful cries of the prisoners, and to set free those condemned to die,"},{"p":21,"t":"so they may proclaim the name of the Lord in Zion, and praise him in Jerusalem,"},{"p":22,"t":"when the nations gather together, and the kingdoms pay tribute to the Lord."},{"p":23,"t":"He has taken away my strength in the middle of life; he has cut short my days."},{"p":24,"t":"I say, “O my God, please do not take me away in the middle of my life! You endure through all generations."},{"p":25,"t":"In earlier times you established the earth; the skies are your handiwork."},{"p":26,"t":"They will perish, but you will endure. They will wear out like a garment; like clothes you will remove them and they will disappear."},{"p":27,"t":"But you remain; your years do not come to an end."},{"p":28,"t":"The children of your servants will settle down here, and their descendants will live securely in your presence.”"}],[{"p":1,"t":"By David. Praise the Lord, O my soul! With all that is within me, praise his holy name!"},{"p":2,"t":"Praise the Lord, O my soul! Do not forget all his kind deeds!"},{"p":3,"t":"He is the one who forgives all your sins, who heals all your diseases,"},{"p":4,"t":"who delivers your life from the Pit, who crowns you with his loyal love and compassion,"},{"p":5,"t":"who satisfies your life with good things, so your youth is renewed like an eagle’s."},{"p":6,"t":"The Lord does what is fair, and executes justice for all the oppressed."},{"p":7,"t":"The Lord revealed his faithful acts to Moses, his deeds to the Israelites."},{"p":8,"t":"The Lord is compassionate and merciful; he is patient and demonstrates great loyal love."},{"p":9,"t":"He does not always accuse, and does not stay angry."},{"p":10,"t":"He does not deal with us as our sins deserve; he does not repay us as our misdeeds deserve."},{"p":11,"t":"For as the skies are high above the earth, so his loyal love towers over his faithful followers."},{"p":12,"t":"As far as the eastern horizon is from the west, so he removes the guilt of our rebellious actions from us."},{"p":13,"t":"As a father has compassion on his children, so the Lord has compassion on his faithful followers."},{"p":14,"t":"For he knows what we are made of; he realizes we are made of clay."},{"p":15,"t":"A person’s life is like grass. Like a flower in the field it flourishes,"},{"p":16,"t":"but when the hot wind blows by, it disappears, and one can no longer even spot the place where it once grew."},{"p":17,"t":"But the Lord continually shows loyal love to his faithful followers, and is faithful to their descendants,"},{"p":18,"t":"to those who keep his covenant, who are careful to obey his commands."},{"p":19,"t":"The Lord has established his throne in heaven; his kingdom extends over everything."},{"p":20,"t":"Praise the Lord, you angels of his, you powerful warriors who carry out his decrees and obey his orders!"},{"p":21,"t":"Praise the Lord, all you warriors of his, you servants of his who carry out his desires!"},{"p":22,"t":"Praise the Lord, all that he has made, in all the regions of his kingdom! Praise the Lord, O my soul!"}],[{"p":1,"t":"Praise the Lord, O my soul! O Lord my God, you are magnificent. You are robed in splendor and majesty."},{"p":2,"t":"He covers himself with light as if it were a garment. He stretches out the skies like a tent curtain,"},{"p":3,"t":"and lays the beams of the upper rooms of his palace on the rain clouds. He makes the clouds his chariot, and travels along on the wings of the wind."},{"p":4,"t":"He makes the winds his messengers, and the flaming fire his attendant."},{"p":5,"t":"He established the earth on its foundations; it will never be upended."},{"p":6,"t":"The watery deep covered it like a garment; the waters reached above the mountains."},{"p":7,"t":"Your shout made the waters retreat; at the sound of your thunderous voice they hurried off &#8211;"},{"p":8,"t":"as the mountains rose up, and the valleys went down &#8211; to the place you appointed for them."},{"p":9,"t":"You set up a boundary for them that they could not cross, so that they would not cover the earth again."},{"p":10,"t":"He turns springs into streams; they flow between the mountains."},{"p":11,"t":"They provide water for all the animals in the field; the wild donkeys quench their thirst."},{"p":12,"t":"The birds of the sky live beside them; they chirp among the bushes."},{"p":13,"t":"He waters the mountains from the upper rooms of his palace; the earth is full of the fruit you cause to grow."},{"p":14,"t":"He provides grass for the cattle, and crops for people to cultivate, so they can produce food from the ground,"},{"p":15,"t":"as well as wine that makes people feel so good, and so they can have oil to make their faces shine, as well as food that sustains people’s lives."},{"p":16,"t":"The trees of the Lord receive all the rain they need, the cedars of Lebanon which he planted,"},{"p":17,"t":"where the birds make nests, near the evergreens in which the herons live."},{"p":18,"t":"The wild goats live in the high mountains; the rock badgers find safety in the cliffs."},{"p":19,"t":"He made the moon to mark the months, and the sun sets according to a regular schedule."},{"p":20,"t":"You make it dark and night comes, during which all the beasts of the forest prowl around."},{"p":21,"t":"The lions roar for prey, seeking their food from God."},{"p":22,"t":"When the sun rises, they withdraw and sleep in their dens."},{"p":23,"t":"Men then go out to do their work, and labor away until evening."},{"p":24,"t":"How many living things you have made, O Lord! You have exhibited great skill in making all of them; the earth is full of the living things you have made."},{"p":25,"t":"Over here is the deep, wide sea, which teems with innumerable swimming creatures, living things both small and large."},{"p":26,"t":"The ships travel there, and over here swims the whale you made to play in it."},{"p":27,"t":"All of your creatures wait for you to provide them with food on a regular basis."},{"p":28,"t":"You give food to them and they receive it; you open your hand and they are filled with food."},{"p":29,"t":"When you ignore them, they panic. When you take away their life’s breath, they die and return to dust."},{"p":30,"t":"When you send your life-giving breath, they are created, and you replenish the surface of the ground."},{"p":31,"t":"May the splendor of the Lord endure! May the Lord find pleasure in the living things he has made!"},{"p":32,"t":"He looks down on the earth and it shakes; he touches the mountains and they start to smolder."},{"p":33,"t":"I will sing to the Lord as long as I live; I will sing praise to my God as long as I exist!"},{"p":34,"t":"May my thoughts be pleasing to him! I will rejoice in the Lord."},{"p":35,"t":"May sinners disappear from the earth, and the wicked vanish! Praise the Lord, O my soul! Praise the Lord!"}],[{"p":1,"t":"Give thanks to the Lord! Call on his name! Make known his accomplishments among the nations!"},{"p":2,"t":"Sing to him! Make music to him! Tell about all his miraculous deeds!"},{"p":3,"t":"Boast about his holy name! Let the hearts of those who seek the Lord rejoice!"},{"p":4,"t":"Seek the Lord and the strength he gives! Seek his presence continually!"},{"p":5,"t":"Recall the miraculous deeds he performed, his mighty acts and the judgments he decreed,"},{"p":6,"t":"O children of Abraham, God’s servant, you descendants of Jacob, God’s chosen ones!"},{"p":7,"t":"He is the Lord our God; he carries out judgment throughout the earth."},{"p":8,"t":"He always remembers his covenantal decree, the promise he made to a thousand generations &#8211;"},{"p":9,"t":"the promise he made to Abraham, the promise he made by oath to Isaac!"},{"p":10,"t":"He gave it to Jacob as a decree, to Israel as a lasting promise,"},{"p":11,"t":"saying, “To you I will give the land of Canaan as the portion of your inheritance.”"},{"p":12,"t":"When they were few in number, just a very few, and resident aliens within it,"},{"p":13,"t":"they wandered from nation to nation, and from one kingdom to another."},{"p":14,"t":"He let no one oppress them; he disciplined kings for their sake,"},{"p":15,"t":"saying, “Don’t touch my chosen ones! Don’t harm my prophets!”"},{"p":16,"t":"He called down a famine upon the earth; he cut off all the food supply."},{"p":17,"t":"He sent a man ahead of them &#8211; Joseph was sold as a servant."},{"p":18,"t":"The shackles hurt his feet; his neck was placed in an iron collar,"},{"p":19,"t":"until the time when his prediction came true. The Lord’s word proved him right."},{"p":20,"t":"The king authorized his release; the ruler of nations set him free."},{"p":21,"t":"He put him in charge of his palace, and made him manager of all his property,"},{"p":22,"t":"giving him authority to imprison his officials and to teach his advisers."},{"p":23,"t":"Israel moved to Egypt; Jacob lived for a time in the land of Ham."},{"p":24,"t":"The Lord made his people very fruitful, and made them more numerous than their enemies."},{"p":25,"t":"He caused them to hate his people, and to mistreat his servants."},{"p":26,"t":"He sent his servant Moses, and Aaron, whom he had chosen."},{"p":27,"t":"They executed his miraculous signs among them, and his amazing deeds in the land of Ham."},{"p":28,"t":"He made it dark; they did not disobey his orders."},{"p":29,"t":"He turned their water into blood, and killed their fish."},{"p":30,"t":"Their land was overrun by frogs, which even got into the rooms of their kings."},{"p":31,"t":"He ordered flies to come; gnats invaded their whole territory."},{"p":32,"t":"He sent hail along with the rain; there was lightning in their land."},{"p":33,"t":"He destroyed their vines and fig trees, and broke the trees throughout their territory."},{"p":34,"t":"He ordered locusts to come, innumerable grasshoppers."},{"p":35,"t":"They ate all the vegetation in their land, and devoured the crops of their fields."},{"p":36,"t":"He struck down all the firstborn in their land, the firstfruits of their reproductive power."},{"p":37,"t":"He brought his people out enriched with silver and gold; none of his tribes stumbled."},{"p":38,"t":"Egypt was happy when they left, for they were afraid of them."},{"p":39,"t":"He spread out a cloud for a cover, and provided a fire to light up the night."},{"p":40,"t":"They asked for food, and he sent quails; he satisfied them with food from the sky."},{"p":41,"t":"He opened up a rock and water flowed out; a river ran through dry regions."},{"p":42,"t":"Yes, he remembered the sacred promise he made to Abraham his servant."},{"p":43,"t":"When he led his people out, they rejoiced; his chosen ones shouted with joy."},{"p":44,"t":"He handed the territory of nations over to them, and they took possession of what other peoples had produced,"},{"p":45,"t":"so that they might keep his commands and obey his laws. Praise the Lord!"}],[{"p":1,"t":"Praise the Lord! Give thanks to the Lord, for he is good, and his loyal love endures!"},{"p":2,"t":"Who can adequately recount the Lord’s mighty acts, or relate all his praiseworthy deeds?"},{"p":3,"t":"How blessed are those who promote justice, and do what is right all the time!"},{"p":4,"t":"Remember me, O Lord, when you show favor to your people! Pay attention to me, when you deliver,"},{"p":5,"t":"so I may see the prosperity of your chosen ones, rejoice along with your nation, and boast along with the people who belong to you."},{"p":6,"t":"We have sinned like our ancestors; we have done wrong, we have done evil."},{"p":7,"t":"Our ancestors in Egypt failed to appreciate your miraculous deeds, they failed to remember your many acts of loyal love, and they rebelled at the sea, by the Red Sea."},{"p":8,"t":"Yet he delivered them for the sake of his reputation, that he might reveal his power."},{"p":9,"t":"He shouted at the Red Sea and it dried up; he led them through the deep water as if it were a desert."},{"p":10,"t":"He delivered them from the power of the one who hated them, and rescued them from the power of the enemy."},{"p":11,"t":"The water covered their enemies; not even one of them survived."},{"p":12,"t":"They believed his promises; they sang praises to him."},{"p":13,"t":"They quickly forgot what he had done; they did not wait for his instructions."},{"p":14,"t":"In the wilderness they had an insatiable craving for meat; they challenged God in the desert."},{"p":15,"t":"He granted their request, then struck them with a disease."},{"p":16,"t":"In the camp they resented Moses, and Aaron, the Lord’s holy priest."},{"p":17,"t":"The earth opened up and swallowed Dathan; it engulfed the group led by Abiram."},{"p":18,"t":"Fire burned their group; the flames scorched the wicked."},{"p":19,"t":"They made an image of a calf at Horeb, and worshiped a metal idol."},{"p":20,"t":"They traded their majestic God for the image of an ox that eats grass."},{"p":21,"t":"They rejected the God who delivered them, the one who performed great deeds in Egypt,"},{"p":22,"t":"amazing feats in the land of Ham, mighty acts by the Red Sea."},{"p":23,"t":"He threatened to destroy them, but Moses, his chosen one, interceded with him and turned back his destructive anger."},{"p":24,"t":"They rejected the fruitful land; they did not believe his promise."},{"p":25,"t":"They grumbled in their tents; they did not obey the Lord."},{"p":26,"t":"So he made a solemn vow that he would make them die in the desert,"},{"p":27,"t":"make their descendants die among the nations, and scatter them among foreign lands."},{"p":28,"t":"They worshiped Baal of Peor, and ate sacrifices offered to the dead."},{"p":29,"t":"They made the Lord angry by their actions, and a plague broke out among them."},{"p":30,"t":"Phinehas took a stand and intervened, and the plague subsided."},{"p":31,"t":"This brought him a reward, an eternal gift."},{"p":32,"t":"They made him angry by the waters of Meribah, and Moses suffered because of them,"},{"p":33,"t":"for they aroused his temper, and he spoke rashly."},{"p":34,"t":"They did not destroy the nations, as the Lord had commanded them to do."},{"p":35,"t":"They mixed in with the nations and learned their ways."},{"p":36,"t":"They worshiped their idols, which became a snare to them."},{"p":37,"t":"They sacrificed their sons and daughters to demons."},{"p":38,"t":"They shed innocent blood &#8211; the blood of their sons and daughters, whom they sacrificed to the idols of Canaan. The land was polluted by bloodshed."},{"p":39,"t":"They were defiled by their deeds, and unfaithful in their actions."},{"p":40,"t":"So the Lord was angry with his people and despised the people who belong to him."},{"p":41,"t":"He handed them over to the nations, and those who hated them ruled over them."},{"p":42,"t":"Their enemies oppressed them; they were subject to their authority."},{"p":43,"t":"Many times he delivered them, but they had a rebellious attitude, and degraded themselves by their sin."},{"p":44,"t":"Yet he took notice of their distress, when he heard their cry for help."},{"p":45,"t":"He remembered his covenant with them, and relented because of his great loyal love."},{"p":46,"t":"He caused all their conquerors to have pity on them."},{"p":47,"t":"Deliver us, O Lord, our God! Gather us from among the nations! Then we will give thanks to your holy name, and boast about your praiseworthy deeds."},{"p":48,"t":"The Lord God of Israel deserves praise, in the future and forevermore. Let all the people say, “We agree! Praise the Lord!”"}],[{"p":1,"t":"Give thanks to the Lord, for he is good, and his loyal love endures!"},{"p":2,"t":"Let those delivered by the Lord speak out, those whom he delivered from the power of the enemy,"},{"p":3,"t":"and gathered from foreign lands, from east and west, from north and south."},{"p":4,"t":"They wandered through the wilderness on a desert road; they found no city in which to live."},{"p":5,"t":"They were hungry and thirsty; they fainted from exhaustion."},{"p":6,"t":"They cried out to the Lord in their distress; he delivered them from their troubles."},{"p":7,"t":"He led them on a level road, that they might find a city in which to live."},{"p":8,"t":"Let them give thanks to the Lord for his loyal love, and for the amazing things he has done for people!"},{"p":9,"t":"For he has satisfied those who thirst, and those who hunger he has filled with food."},{"p":10,"t":"They sat in utter darkness, bound in painful iron chains,"},{"p":11,"t":"because they had rebelled against God’s commands, and rejected the instructions of the sovereign king."},{"p":12,"t":"So he used suffering to humble them; they stumbled and no one helped them up."},{"p":13,"t":"They cried out to the Lord in their distress; he delivered them from their troubles."},{"p":14,"t":"He brought them out of the utter darkness, and tore off their shackles."},{"p":15,"t":"Let them give thanks to the Lord for his loyal love, and for the amazing things he has done for people!"},{"p":16,"t":"For he shattered the bronze gates, and hacked through the iron bars."},{"p":17,"t":"They acted like fools in their rebellious ways, and suffered because of their sins."},{"p":18,"t":"They lost their appetite for all food, and they drew near the gates of death."},{"p":19,"t":"They cried out to the Lord in their distress; he delivered them from their troubles."},{"p":20,"t":"He sent them an assuring word and healed them; he rescued them from the pits where they were trapped."},{"p":21,"t":"Let them give thanks to the Lord for his loyal love, and for the amazing things he has done for people!"},{"p":22,"t":"Let them present thank offerings, and loudly proclaim what he has done!"},{"p":23,"t":"Some traveled on the sea in ships, and carried cargo over the vast waters."},{"p":24,"t":"They witnessed the acts of the Lord, his amazing feats on the deep water."},{"p":25,"t":"He gave the order for a windstorm, and it stirred up the waves of the sea."},{"p":26,"t":"They reached up to the sky, then dropped into the depths. The sailors’ strength left them because the danger was so great."},{"p":27,"t":"They swayed and staggered like a drunk, and all their skill proved ineffective."},{"p":28,"t":"They cried out to the Lord in their distress; he delivered them from their troubles."},{"p":29,"t":"He calmed the storm, and the waves grew silent."},{"p":30,"t":"The sailors rejoiced because the waves grew quiet, and he led them to the harbor they desired."},{"p":31,"t":"Let them give thanks to the Lord for his loyal love, and for the amazing things he has done for people!"},{"p":32,"t":"Let them exalt him in the assembly of the people! Let them praise him in the place where the leaders preside!"},{"p":33,"t":"He turned streams into a desert, springs of water into arid land,"},{"p":34,"t":"and a fruitful land into a barren place, because of the sin of its inhabitants."},{"p":35,"t":"As for his people, he turned a desert into a pool of water, and a dry land into springs of water."},{"p":36,"t":"He allowed the hungry to settle there, and they established a city in which to live."},{"p":37,"t":"They cultivated fields, and planted vineyards, which yielded a harvest of fruit."},{"p":38,"t":"He blessed them so that they became very numerous. He would not allow their cattle to decrease in number."},{"p":39,"t":"As for their enemies, they decreased in number and were beaten down, because of painful distress and suffering."},{"p":40,"t":"He would pour contempt upon princes, and he made them wander in a wasteland with no road."},{"p":41,"t":"Yet he protected the needy from oppression, and cared for his families like a flock of sheep."},{"p":42,"t":"When the godly see this, they rejoice, and every sinner shuts his mouth."},{"p":43,"t":"Whoever is wise, let him take note of these things! Let them consider the Lord’s acts of loyal love!"}],[{"p":1,"t":"A song, a psalm of David. I am determined, O God! I will sing and praise you with my whole heart."},{"p":2,"t":"Awake, O stringed instrument and harp! I will wake up at dawn!"},{"p":3,"t":"I will give you thanks before the nations, O Lord! I will sing praises to you before foreigners!"},{"p":4,"t":"For your loyal love extends beyond the sky, and your faithfulness reaches the clouds."},{"p":5,"t":"Rise up above the sky, O God! May your splendor cover the whole earth!"},{"p":6,"t":"Deliver by your power and answer me, so that the ones you love may be safe."},{"p":7,"t":"God has spoken in his sanctuary: “I will triumph! I will parcel out Shechem, the valley of Succoth I will measure off."},{"p":8,"t":"Gilead belongs to me, as does Manasseh! Ephraim is my helmet, Judah my royal scepter."},{"p":9,"t":"Moab is my wash basin. I will make Edom serve me. I will shout in triumph over Philistia.”"},{"p":10,"t":"Who will lead me into the fortified city? Who will bring me to Edom?"},{"p":11,"t":"Have you not rejected us, O God? O God, you do not go into battle with our armies."},{"p":12,"t":"Give us help against the enemy, for any help men might offer is futile."},{"p":13,"t":"By God’s power we will conquer; he will trample down our enemies."}],[{"p":1,"t":"For the music director, a psalm of David. O God whom I praise, do not ignore me!"},{"p":2,"t":"For they say cruel and deceptive things to me; they lie to me."},{"p":3,"t":"They surround me and say hateful things; they attack me for no reason."},{"p":4,"t":"They repay my love with accusations, but I continue to pray."},{"p":5,"t":"They repay me evil for good, and hate for love."},{"p":6,"t":"Appoint an evil man to testify against him! May an accuser stand at his right side!"},{"p":7,"t":"When he is judged, he will be found guilty! Then his prayer will be regarded as sinful."},{"p":8,"t":"May his days be few! May another take his job!"},{"p":9,"t":"May his children be fatherless, and his wife a widow!"},{"p":10,"t":"May his children roam around begging, asking for handouts as they leave their ruined home!"},{"p":11,"t":"May the creditor seize all he owns! May strangers loot his property!"},{"p":12,"t":"May no one show him kindness! May no one have compassion on his fatherless children!"},{"p":13,"t":"May his descendants be cut off! May the memory of them be wiped out by the time the next generation arrives!"},{"p":14,"t":"May his ancestors’ sins be remembered by the Lord! May his mother’s sin not be forgotten!"},{"p":15,"t":"May the Lord be constantly aware of them, and cut off the memory of his children from the earth!"},{"p":16,"t":"For he never bothered to show kindness; he harassed the oppressed and needy, and killed the disheartened."},{"p":17,"t":"He loved to curse others, so those curses have come upon him. He had no desire to bless anyone, so he has experienced no blessings."},{"p":18,"t":"He made cursing a way of life, so curses poured into his stomach like water and seeped into his bones like oil."},{"p":19,"t":"May a curse attach itself to him, like a garment one puts on, or a belt one wears continually!"},{"p":20,"t":"May the Lord repay my accusers in this way, those who say evil things about me!"},{"p":21,"t":"O sovereign Lord, intervene on my behalf for the sake of your reputation! Because your loyal love is good, deliver me!"},{"p":22,"t":"For I am oppressed and needy, and my heart beats violently within me."},{"p":23,"t":"I am fading away like a shadow at the end of the day; I am shaken off like a locust."},{"p":24,"t":"I am so starved my knees shake; I have turned into skin and bones."},{"p":25,"t":"I am disdained by them. When they see me, they shake their heads."},{"p":26,"t":"Help me, O Lord my God! Because you are faithful to me, deliver me!"},{"p":27,"t":"Then they will realize this is your work, and that you, Lord, have accomplished it."},{"p":28,"t":"They curse, but you will bless. When they attack, they will be humiliated, but your servant will rejoice."},{"p":29,"t":"My accusers will be covered with shame, and draped in humiliation as if it were a robe."},{"p":30,"t":"I will thank the Lord profusely, in the middle of a crowd I will praise him,"},{"p":31,"t":"because he stands at the right hand of the needy, to deliver him from those who threaten his life."}],[{"p":1,"t":"A psalm of David. Here is the Lord’s proclamation to my lord: “Sit down at my right hand until I make your enemies your footstool!”"},{"p":2,"t":"The Lord extends your dominion from Zion. Rule in the midst of your enemies!"},{"p":3,"t":"Your people willingly follow you when you go into battle. On the holy hills at sunrise the dew of your youth belongs to you."},{"p":4,"t":"The Lord makes this promise on oath and will not revoke it: “You are an eternal priest after the pattern of Melchizedek.”"},{"p":5,"t":"O sovereign Lord, at your right hand he strikes down kings in the day he unleashes his anger."},{"p":6,"t":"He executes judgment against the nations; he fills the valleys with corpses; he shatters their heads over the vast battlefield."},{"p":7,"t":"From the stream along the road he drinks; then he lifts up his head."}],[{"p":1,"t":"Praise the Lord! I will give thanks to the Lord with my whole heart, in the assembly of the godly and the congregation."},{"p":2,"t":"The Lord’s deeds are great, eagerly awaited by all who desire them."},{"p":3,"t":"His work is majestic and glorious, and his faithfulness endures forever."},{"p":4,"t":"He does amazing things that will be remembered; the Lord is merciful and compassionate."},{"p":5,"t":"He gives food to his faithful followers; he always remembers his covenant."},{"p":6,"t":"He announced that he would do mighty deeds for his people, giving them a land that belonged to other nations."},{"p":7,"t":"His acts are characterized by faithfulness and justice; all his precepts are reliable."},{"p":8,"t":"They are forever firm, and should be faithfully and properly carried out."},{"p":9,"t":"He delivered his people; he ordained that his covenant be observed forever. His name is holy and awesome."},{"p":10,"t":"To obey the Lord is the fundamental principle for wise living; all who carry out his precepts acquire good moral insight. He will receive praise forever."}],[{"p":1,"t":"Praise the Lord! How blessed is the one who obeys the Lord, who takes great delight in keeping his commands."},{"p":2,"t":"His descendants will be powerful on the earth; the godly will be blessed."},{"p":3,"t":"His house contains wealth and riches; his integrity endures."},{"p":4,"t":"In the darkness a light shines for the godly, for each one who is merciful, compassionate, and just."},{"p":5,"t":"It goes well for the one who generously lends money, and conducts his business honestly."},{"p":6,"t":"For he will never be upended; others will always remember one who is just."},{"p":7,"t":"He does not fear bad news. He is confident; he trusts in the Lord."},{"p":8,"t":"His resolve is firm; he will not succumb to fear before he looks in triumph on his enemies."},{"p":9,"t":"He generously gives to the needy; his integrity endures. He will be vindicated and honored."},{"p":10,"t":"When the wicked see this, they will worry; they will grind their teeth in frustration and melt away; the desire of the wicked will perish."}],[{"p":1,"t":"Praise the Lord! Praise, you servants of the Lord, praise the name of the Lord!"},{"p":2,"t":"May the Lord’s name be praised now and forevermore!"},{"p":3,"t":"From east to west the Lord’s name is deserving of praise."},{"p":4,"t":"The Lord is exalted over all the nations; his splendor reaches beyond the sky."},{"p":5,"t":"Who can compare to the Lord our God, who sits on a high throne?"},{"p":6,"t":"He bends down to look at the sky and the earth."},{"p":7,"t":"He raises the poor from the dirt, and lifts up the needy from the garbage pile,"},{"p":8,"t":"that he might seat him with princes, with the princes of his people."},{"p":9,"t":"He makes the barren woman of the family a happy mother of children. Praise the Lord!"}],[{"p":1,"t":"When Israel left Egypt, when the family of Jacob left a foreign nation behind,"},{"p":2,"t":"Judah became his sanctuary, Israel his kingdom."},{"p":3,"t":"The sea looked and fled; the Jordan River turned back."},{"p":4,"t":"The mountains skipped like rams, the hills like lambs."},{"p":5,"t":"Why do you flee, O sea? Why do you turn back, O Jordan River?"},{"p":6,"t":"Why do you skip like rams, O mountains, like lambs, O hills?"},{"p":7,"t":"Tremble, O earth, before the Lord &#8211; before the God of Jacob,"},{"p":8,"t":"who turned a rock into a pool of water, a hard rock into springs of water!"}],[{"p":1,"t":"Not to us, O Lord, not to us! But to your name bring honor, for the sake of your loyal love and faithfulness."},{"p":2,"t":"Why should the nations say, “Where is their God?”"},{"p":3,"t":"Our God is in heaven! He does whatever he pleases!"},{"p":4,"t":"Their idols are made of silver and gold &#8211; they are man-made."},{"p":5,"t":"They have mouths, but cannot speak, eyes, but cannot see,"},{"p":6,"t":"ears, but cannot hear, noses, but cannot smell,"},{"p":7,"t":"hands, but cannot touch, feet, but cannot walk. They cannot even clear their throats."},{"p":8,"t":"Those who make them will end up like them, as will everyone who trusts in them."},{"p":9,"t":"O Israel, trust in the Lord! He is their deliverer and protector."},{"p":10,"t":"O family of Aaron, trust in the Lord! He is their deliverer and protector."},{"p":11,"t":"You loyal followers of the Lord, trust in the Lord! He is their deliverer and protector."},{"p":12,"t":"The Lord takes notice of us, he will bless &#8211; he will bless the family of Israel, he will bless the family of Aaron."},{"p":13,"t":"He will bless his loyal followers, both young and old."},{"p":14,"t":"May he increase your numbers, yours and your children’s!"},{"p":15,"t":"May you be blessed by the Lord, the creator of heaven and earth!"},{"p":16,"t":"The heavens belong to the Lord, but the earth he has given to mankind."},{"p":17,"t":"The dead do not praise the Lord, nor do any of those who descend into the silence of death."},{"p":18,"t":"But we will praise the Lord now and forevermore. Praise the Lord!"}],[{"p":1,"t":"I love the Lord because he heard my plea for mercy,"},{"p":2,"t":"and listened to me. As long as I live, I will call to him when I need help."},{"p":3,"t":"The ropes of death tightened around me, the snares of Sheol confronted me. I was confronted with trouble and sorrow."},{"p":4,"t":"I called on the name of the Lord, “Please Lord, rescue my life!”"},{"p":5,"t":"The Lord is merciful and fair; our God is compassionate."},{"p":6,"t":"The Lord protects the untrained; I was in serious trouble and he delivered me."},{"p":7,"t":"Rest once more, my soul, for the Lord has vindicated you."},{"p":8,"t":"Yes, Lord, you rescued my life from death, and kept my feet from stumbling."},{"p":9,"t":"I will serve the Lord in the land of the living."},{"p":10,"t":"I had faith when I said, “I am severely oppressed.”"},{"p":11,"t":"I rashly declared, “All men are liars.”"},{"p":12,"t":"How can I repay the Lord for all his acts of kindness to me?"},{"p":13,"t":"I will celebrate my deliverance, and call on the name of the Lord."},{"p":14,"t":"I will fulfill my vows to the Lord before all his people."},{"p":15,"t":"The Lord values the lives of his faithful followers."},{"p":16,"t":"Yes, Lord! I am indeed your servant; I am your lowest slave. You saved me from death."},{"p":17,"t":"I will present a thank offering to you, and call on the name of the Lord."},{"p":18,"t":"I will fulfill my vows to the Lord before all his people,"},{"p":19,"t":"in the courts of the Lord’s temple, in your midst, O Jerusalem. Praise the Lord!"}],[{"p":1,"t":"Praise the Lord, all you nations! Applaud him, all you foreigners!"},{"p":2,"t":"For his loyal love towers over us, and the Lord’s faithfulness endures. Praise the Lord!"}],[{"p":1,"t":"Give thanks to the Lord, for he is good and his loyal love endures!"},{"p":2,"t":"Let Israel say, “Yes, his loyal love endures!”"},{"p":3,"t":"Let the family of Aaron say, “Yes, his loyal love endures!”"},{"p":4,"t":"Let the loyal followers of the Lord say, “Yes, his loyal love endures!”"},{"p":5,"t":"In my distress I cried out to the Lord. The Lord answered me and put me in a wide open place."},{"p":6,"t":"The Lord is on my side, I am not afraid! What can people do to me?"},{"p":7,"t":"The Lord is on my side as my helper. I look in triumph on those who hate me."},{"p":8,"t":"It is better to take shelter in the Lord than to trust in people."},{"p":9,"t":"It is better to take shelter in the Lord than to trust in princes."},{"p":10,"t":"All the nations surrounded me. Indeed, in the name of the Lord I pushed them away."},{"p":11,"t":"They surrounded me, yes, they surrounded me. Indeed, in the name of the Lord I pushed them away."},{"p":12,"t":"They surrounded me like bees. But they disappeared as quickly as a fire among thorns. Indeed, in the name of the Lord I pushed them away."},{"p":13,"t":"“You aggressively attacked me and tried to knock me down, but the Lord helped me."},{"p":14,"t":"The Lord gives me strength and protects me; he has become my deliverer.”"},{"p":15,"t":"They celebrate deliverance in the tents of the godly. The Lord’s right hand conquers,"},{"p":16,"t":"the Lord’s right hand gives victory, the Lord’s right hand conquers."},{"p":17,"t":"I will not die, but live, and I will proclaim what the Lord has done."},{"p":18,"t":"The Lord severely punished me, but he did not hand me over to death."},{"p":19,"t":"Open for me the gates of the just king’s temple! I will enter through them and give thanks to the Lord."},{"p":20,"t":"This is the Lord’s gate &#8211; the godly enter through it."},{"p":21,"t":"I will give you thanks, for you answered me, and have become my deliverer."},{"p":22,"t":"The stone which the builders discarded has become the cornerstone."},{"p":23,"t":"This is the Lord’s work. We consider it amazing!"},{"p":24,"t":"This is the day the Lord has brought about. We will be happy and rejoice in it."},{"p":25,"t":"Please Lord, deliver! Please Lord, grant us success!"},{"p":26,"t":"May the one who comes in the name of the Lord be blessed! We will pronounce blessings on you in the Lord’s temple."},{"p":27,"t":"The Lord is God and he has delivered us. Tie the offering with ropes to the horns of the altar!"},{"p":28,"t":"You are my God and I will give you thanks! You are my God and I will praise you!"},{"p":29,"t":"Give thanks to the Lord, for he is good and his loyal love endures!"}],[{"p":1,"t":"&#1488; (Alef) How blessed are those whose actions are blameless, who obey the law of the Lord."},{"p":2,"t":"How blessed are those who observe his rules, and seek him with all their heart,"},{"p":3,"t":"who, moreover, do no wrong, but follow in his footsteps."},{"p":4,"t":"You demand that your precepts be carefully kept."},{"p":5,"t":"If only I were predisposed to keep your statutes!"},{"p":6,"t":"Then I would not be ashamed, if I were focused on all your commands."},{"p":7,"t":"I will give you sincere thanks, when I learn your just regulations."},{"p":8,"t":"I will keep your statutes. Do not completely abandon me!"},{"p":9,"t":"&#1489; (Bet) How can a young person maintain a pure life? By guarding it according to your instructions!"},{"p":10,"t":"With all my heart I seek you. Do not allow me to stray from your commands!"},{"p":11,"t":"In my heart I store up your words, so I might not sin against you."},{"p":12,"t":"You deserve praise, O Lord! Teach me your statutes!"},{"p":13,"t":"With my lips I proclaim all the regulations you have revealed."},{"p":14,"t":"I rejoice in the lifestyle prescribed by your rules as if they were riches of all kinds."},{"p":15,"t":"I will meditate on your precepts and focus on your behavior."},{"p":16,"t":"I find delight in your statutes; I do not forget your instructions."},{"p":17,"t":"&#1490; (Gimel) Be kind to your servant! Then I will live and keep your instructions."},{"p":18,"t":"Open my eyes so I can truly see the marvelous things in your law!"},{"p":19,"t":"I am like a foreigner in this land. Do not hide your commands from me!"},{"p":20,"t":"I desperately long to know your regulations at all times."},{"p":21,"t":"You reprimand arrogant people. Those who stray from your commands are doomed."},{"p":22,"t":"Spare me shame and humiliation, for I observe your rules."},{"p":23,"t":"Though rulers plot and slander me, your servant meditates on your statutes."},{"p":24,"t":"Yes, I find delight in your rules; they give me guidance."},{"p":25,"t":"&#1491; (Dalet) I collapse in the dirt. Revive me with your word!"},{"p":26,"t":"I told you about my ways and you answered me. Teach me your statutes!"},{"p":27,"t":"Help me to understand what your precepts mean! Then I can meditate on your marvelous teachings."},{"p":28,"t":"I collapse from grief. Sustain me by your word!"},{"p":29,"t":"Remove me from the path of deceit! Graciously give me your law!"},{"p":30,"t":"I choose the path of faithfulness; I am committed to your regulations."},{"p":31,"t":"I hold fast to your rules. O Lord, do not let me be ashamed!"},{"p":32,"t":"I run along the path of your commands, for you enable me to do so."},{"p":33,"t":"&#1492; (He) Teach me, O Lord, the lifestyle prescribed by your statutes, so that I might observe it continually."},{"p":34,"t":"Give me understanding so that I might observe your law, and keep it with all my heart."},{"p":35,"t":"Guide me in the path of your commands, for I delight to walk in it."},{"p":36,"t":"Give me a desire for your rules, rather than for wealth gained unjustly."},{"p":37,"t":"Turn my eyes away from what is worthless! Revive me with your word!"},{"p":38,"t":"Confirm to your servant your promise, which you made to the one who honors you."},{"p":39,"t":"Take away the insults that I dread! Indeed, your regulations are good."},{"p":40,"t":"Look, I long for your precepts. Revive me with your deliverance!"},{"p":41,"t":"&#1493; (Vav) May I experience your loyal love, O Lord, and your deliverance, as you promised."},{"p":42,"t":"Then I will have a reply for the one who insults me, for I trust in your word."},{"p":43,"t":"Do not completely deprive me of a truthful testimony, for I await your justice."},{"p":44,"t":"Then I will keep your law continually now and for all time."},{"p":45,"t":"I will be secure, for I seek your precepts."},{"p":46,"t":"I will speak about your regulations before kings and not be ashamed."},{"p":47,"t":"I will find delight in your commands, which I love."},{"p":48,"t":"I will lift my hands to your commands, which I love, and I will meditate on your statutes."},{"p":49,"t":"&#1494; (Zayin) Remember your word to your servant, for you have given me hope."},{"p":50,"t":"This is what comforts me in my trouble, for your promise revives me."},{"p":51,"t":"Arrogant people do nothing but scoff at me. Yet I do not turn aside from your law."},{"p":52,"t":"I remember your ancient regulations, O Lord, and console myself."},{"p":53,"t":"Rage takes hold of me because of the wicked, those who reject your law."},{"p":54,"t":"Your statutes have been my songs in the house where I live."},{"p":55,"t":"I remember your name during the night, O Lord, and I will keep your law."},{"p":56,"t":"This has been my practice, for I observe your precepts."},{"p":57,"t":"&#1495; (Khet) The Lord is my source of security. I have determined to follow your instructions."},{"p":58,"t":"I seek your favor with all my heart. Have mercy on me as you promised!"},{"p":59,"t":"I consider my actions and follow your rules."},{"p":60,"t":"I keep your commands eagerly and without delay."},{"p":61,"t":"The ropes of the wicked tighten around me, but I do not forget your law."},{"p":62,"t":"In the middle of the night I arise to thank you for your just regulations."},{"p":63,"t":"I am a friend to all your loyal followers, and to those who keep your precepts."},{"p":64,"t":"O Lord, your loyal love fills the earth. Teach me your statutes!"},{"p":65,"t":"&#1496; (Tet) You are good to your servant, O Lord, just as you promised."},{"p":66,"t":"Teach me proper discernment and understanding! For I consider your commands to be reliable."},{"p":67,"t":"Before I was afflicted I used to stray off, but now I keep your instructions."},{"p":68,"t":"You are good and you do good. Teach me your statutes!"},{"p":69,"t":"Arrogant people smear my reputation with lies, but I observe your precepts with all my heart."},{"p":70,"t":"Their hearts are calloused, but I find delight in your law."},{"p":71,"t":"It was good for me to suffer, so that I might learn your statutes."},{"p":72,"t":"The law you have revealed is more important to me than thousands of pieces of gold and silver."},{"p":73,"t":"&#1497; (Yod) Your hands made me and formed me. Give me understanding so that I might learn your commands."},{"p":74,"t":"Your loyal followers will be glad when they see me, for I find hope in your word."},{"p":75,"t":"I know, Lord, that your regulations are just. You disciplined me because of your faithful devotion to me."},{"p":76,"t":"May your loyal love console me, as you promised your servant."},{"p":77,"t":"May I experience your compassion, so I might live! For I find delight in your law."},{"p":78,"t":"May the arrogant be humiliated, for they have slandered me! But I meditate on your precepts."},{"p":79,"t":"May your loyal followers turn to me, those who know your rules."},{"p":80,"t":"May I be fully committed to your statutes, so that I might not be ashamed."},{"p":81,"t":"&#1499; (Kaf) I desperately long for your deliverance. I find hope in your word."},{"p":82,"t":"My eyes grow tired as I wait for your promise to be fulfilled. I say, “When will you comfort me?”"},{"p":83,"t":"For I am like a wineskin dried up in smoke. I do not forget your statutes."},{"p":84,"t":"How long must your servant endure this? When will you judge those who pursue me?"},{"p":85,"t":"The arrogant dig pits to trap me, which violates your law."},{"p":86,"t":"All your commands are reliable. I am pursued without reason. Help me!"},{"p":87,"t":"They have almost destroyed me here on the earth, but I do not reject your precepts."},{"p":88,"t":"Revive me with your loyal love, that I might keep the rules you have revealed."},{"p":89,"t":"&#1500; (Lamed) O Lord, your instructions endure; they stand secure in heaven."},{"p":90,"t":"You demonstrate your faithfulness to all generations. You established the earth and it stood firm."},{"p":91,"t":"Today they stand firm by your decrees, for all things are your servants."},{"p":92,"t":"If I had not found encouragement in your law, I would have died in my sorrow."},{"p":93,"t":"I will never forget your precepts, for by them you have revived me."},{"p":94,"t":"I belong to you. Deliver me! For I seek your precepts."},{"p":95,"t":"The wicked prepare to kill me, yet I concentrate on your rules."},{"p":96,"t":"I realize that everything has its limits, but your commands are beyond full comprehension."},{"p":97,"t":"&#1502; (Mem) O how I love your law! All day long I meditate on it."},{"p":98,"t":"Your commandments make me wiser than my enemies, for I am always aware of them."},{"p":99,"t":"I have more insight than all my teachers, for I meditate on your rules."},{"p":100,"t":"I am more discerning than those older than I, for I observe your precepts."},{"p":101,"t":"I stay away from the evil path, so that I might keep your instructions."},{"p":102,"t":"I do not turn aside from your regulations, for you teach me."},{"p":103,"t":"Your words are sweeter in my mouth than honey!"},{"p":104,"t":"Your precepts give me discernment. Therefore I hate all deceitful actions."},{"p":105,"t":"&#1504; (Nun) Your word is a lamp to walk by, and a light to illumine my path."},{"p":106,"t":"I have vowed and solemnly sworn to keep your just regulations."},{"p":107,"t":"I am suffering terribly. O Lord, revive me with your word!"},{"p":108,"t":"O Lord, please accept the freewill offerings of my praise! Teach me your regulations!"},{"p":109,"t":"My life is in continual danger, but I do not forget your law."},{"p":110,"t":"The wicked lay a trap for me, but I do not wander from your precepts."},{"p":111,"t":"I claim your rules as my permanent possession, for they give me joy."},{"p":112,"t":"I am determined to obey your statutes at all times, to the very end."},{"p":113,"t":"<b>&#1505; (</b>Samek<b>)</b> I hate people with divided loyalties, but I love your law."},{"p":114,"t":"You are my hiding place and my shield. I find hope in your word."},{"p":115,"t":"Turn away from me, you evil men, so that I can observe the commands of my God."},{"p":116,"t":"Sustain me as you promised, so that I will live. Do not disappoint me!"},{"p":117,"t":"Support me, so that I will be delivered. Then I will focus on your statutes continually."},{"p":118,"t":"You despise all who stray from your statutes, for they are deceptive and unreliable."},{"p":119,"t":"You remove all the wicked of the earth like slag. Therefore I love your rules."},{"p":120,"t":"My body trembles because I fear you; I am afraid of your judgments."},{"p":121,"t":"&#1506; (Ayin) I do what is fair and right. Do not abandon me to my oppressors!"},{"p":122,"t":"Guarantee the welfare of your servant! Do not let the arrogant oppress me!"},{"p":123,"t":"My eyes grow tired as I wait for your deliverance, for your reliable promise to be fulfilled."},{"p":124,"t":"Show your servant your loyal love! Teach me your statutes!"},{"p":125,"t":"I am your servant. Give me insight, so that I can understand your rules."},{"p":126,"t":"It is time for the Lord to act &#8211; they break your law!"},{"p":127,"t":"For this reason I love your commands more than gold, even purest gold."},{"p":128,"t":"For this reason I carefully follow all your precepts. I hate all deceitful actions."},{"p":129,"t":"&#1508; (Pe) Your rules are marvelous. Therefore I observe them."},{"p":130,"t":"Your instructions are a doorway through which light shines. They give insight to the untrained."},{"p":131,"t":"I open my mouth and pant, because I long for your commands."},{"p":132,"t":"Turn toward me and extend mercy to me, as you typically do to your loyal followers."},{"p":133,"t":"Direct my steps by your word! Do not let any sin dominate me!"},{"p":134,"t":"Deliver me from oppressive men, so that I can keep your precepts."},{"p":135,"t":"Smile on your servant! Teach me your statutes!"},{"p":136,"t":"Tears stream down from my eyes, because people do not keep your law."},{"p":137,"t":"&#1510; (Tsade) You are just, O Lord, and your judgments are fair."},{"p":138,"t":"The rules you impose are just, and absolutely reliable."},{"p":139,"t":"My zeal consumes me, for my enemies forget your instructions."},{"p":140,"t":"Your word is absolutely pure, and your servant loves it!"},{"p":141,"t":"I am insignificant and despised, yet I do not forget your precepts."},{"p":142,"t":"Your justice endures, and your law is reliable."},{"p":143,"t":"Distress and hardship confront me, yet I find delight in your commands."},{"p":144,"t":"Your rules remain just. Give me insight so that I can live."},{"p":145,"t":"&#1511; (Qof) I cried out with all my heart, “Answer me, O Lord! I will observe your statutes.”"},{"p":146,"t":"I cried out to you, “Deliver me, so that I can keep your rules.”"},{"p":147,"t":"I am up before dawn crying for help. I find hope in your word."},{"p":148,"t":"My eyes anticipate the nighttime hours, so that I can meditate on your word."},{"p":149,"t":"Listen to me because of your loyal love! O Lord, revive me, as you typically do!"},{"p":150,"t":"Those who are eager to do wrong draw near; they are far from your law."},{"p":151,"t":"You are near, O Lord, and all your commands are reliable."},{"p":152,"t":"I learned long ago that you ordained your rules to last."},{"p":153,"t":"&#1512; (Resh) See my pain and rescue me! For I do not forget your law."},{"p":154,"t":"Fight for me and defend me! Revive me with your word!"},{"p":155,"t":"The wicked have no chance for deliverance, for they do not seek your statutes."},{"p":156,"t":"Your compassion is great, O Lord. Revive me, as you typically do!"},{"p":157,"t":"The enemies who chase me are numerous. Yet I do not turn aside from your rules."},{"p":158,"t":"I take note of the treacherous and despise them, because they do not keep your instructions."},{"p":159,"t":"See how I love your precepts! O Lord, revive me with your loyal love!"},{"p":160,"t":"Your instructions are totally reliable; all your just regulations endure."},{"p":161,"t":"&#1513;&#1474;/&#1513;&#1473; (Sin/Shin) Rulers pursue me for no reason, yet I am more afraid of disobeying your instructions."},{"p":162,"t":"I rejoice in your instructions, like one who finds much plunder."},{"p":163,"t":"I hate and despise deceit; I love your law."},{"p":164,"t":"Seven times a day I praise you because of your just regulations."},{"p":165,"t":"Those who love your law are completely secure; nothing causes them to stumble."},{"p":166,"t":"I hope for your deliverance, O Lord, and I obey your commands."},{"p":167,"t":"I keep your rules; I love them greatly."},{"p":168,"t":"I keep your precepts and rules, for you are aware of everything I do."},{"p":169,"t":"&#1514; (Tav) Listen to my cry for help, O Lord! Give me insight by your word!"},{"p":170,"t":"Listen to my appeal for mercy! Deliver me, as you promised."},{"p":171,"t":"May praise flow freely from my lips, for you teach me your statutes."},{"p":172,"t":"May my tongue sing about your instructions, for all your commands are just."},{"p":173,"t":"May your hand help me, for I choose to obey your precepts."},{"p":174,"t":"I long for your deliverance, O Lord; I find delight in your law."},{"p":175,"t":"May I live and praise you! May your regulations help me!"},{"p":176,"t":"I have wandered off like a lost sheep. Come looking for your servant, for I do not forget your commands."}],[{"p":1,"t":"A song of ascents. In my distress I cried out to the Lord and he answered me."},{"p":2,"t":"I said, “O Lord, rescue me from those who lie with their lips and those who deceive with their tongue."},{"p":3,"t":"How will he severely punish you, you deceptive talker?"},{"p":4,"t":"Here’s how! With the sharp arrows of warriors, with arrowheads forged over the hot coals."},{"p":5,"t":"How miserable I am! For I have lived temporarily in Meshech; I have resided among the tents of Kedar."},{"p":6,"t":"For too long I have had to reside with those who hate peace."},{"p":7,"t":"I am committed to peace, but when I speak, they want to make war."}],[{"p":1,"t":"A song of ascents. I look up toward the hills. From where does my help come?"},{"p":2,"t":"My help comes from the Lord, the Creator of heaven and earth!"},{"p":3,"t":"May he not allow your foot to slip! May your protector not sleep!"},{"p":4,"t":"Look! Israel’s protector does not sleep or slumber!"},{"p":5,"t":"The Lord is your protector; the Lord is the shade at your right hand."},{"p":6,"t":"The sun will not harm you by day, or the moon by night."},{"p":7,"t":"The Lord will protect you from all harm; he will protect your life."},{"p":8,"t":"The Lord will protect you in all you do, now and forevermore."}],[{"p":1,"t":"A song of ascents, by David. I was glad because they said to me, “We will go to the Lord’s temple.”"},{"p":2,"t":"Our feet are standing inside your gates, O Jerusalem."},{"p":3,"t":"Jerusalem is a city designed to accommodate an assembly."},{"p":4,"t":"The tribes go up there, the tribes of the Lord, where it is required that Israel give thanks to the name of the Lord."},{"p":5,"t":"Indeed, the leaders sit there on thrones and make legal decisions, on the thrones of the house of David."},{"p":6,"t":"Pray for the peace of Jerusalem! May those who love her prosper!"},{"p":7,"t":"May there be peace inside your defenses, and prosperity inside your fortresses!"},{"p":8,"t":"For the sake of my brothers and my neighbors I will say, “May there be peace in you!”"},{"p":9,"t":"For the sake of the temple of the Lord our God I will pray for you to prosper."}],[{"p":1,"t":"A song of ascents. I look up toward you, the one enthroned in heaven."},{"p":2,"t":"Look, as the eyes of servants look to the hand of their master, as the eyes of a female servant look to the hand of her mistress, so my eyes will look to the Lord, our God, until he shows us favor."},{"p":3,"t":"Show us favor, O Lord, show us favor! For we have had our fill of humiliation, and then some."},{"p":4,"t":"We have had our fill of the taunts of the self-assured, of the contempt of the proud."}],[{"p":1,"t":"A song of ascents, by David. “If the Lord had not been on our side” &#8211; let Israel say this! &#8211;"},{"p":2,"t":"if the Lord had not been on our side, when men attacked us,"},{"p":3,"t":"they would have swallowed us alive, when their anger raged against us."},{"p":4,"t":"The water would have overpowered us; the current would have overwhelmed us."},{"p":5,"t":"The raging water would have overwhelmed us."},{"p":6,"t":"The Lord deserves praise, for he did not hand us over as prey to their teeth."},{"p":7,"t":"We escaped with our lives, like a bird from a hunter’s snare. The snare broke, and we escaped."},{"p":8,"t":"Our deliverer is the Lord, the Creator of heaven and earth."}],[{"p":1,"t":"A song of ascents. Those who trust in the Lord are like Mount Zion; it cannot be upended and will endure forever."},{"p":2,"t":"As the mountains surround Jerusalem, so the Lord surrounds his people, now and forevermore."},{"p":3,"t":"Indeed, the scepter of a wicked king will not settle upon the allotted land of the godly. Otherwise the godly might do what is wrong."},{"p":4,"t":"Do good, O Lord, to those who are good, to the morally upright!"},{"p":5,"t":"As for those who are bent on traveling a sinful path, may the Lord remove them, along with those who behave wickedly! May Israel experience peace!"}],[{"p":1,"t":"A song of ascents. When the Lord restored the well-being of Zion, we thought we were dreaming."},{"p":2,"t":"At that time we laughed loudly and shouted for joy. At that time the nations said, “The Lord has accomplished great things for these people.”"},{"p":3,"t":"The Lord did indeed accomplish great things for us. We were happy."},{"p":4,"t":"O Lord, restore our well-being, just as the streams in the arid south are replenished."},{"p":5,"t":"Those who shed tears as they plant will shout for joy when they reap the harvest."},{"p":6,"t":"The one who weeps as he walks along, carrying his bag of seed, will certainly come in with a shout of joy, carrying his sheaves of grain."}],[{"p":1,"t":"A song of ascents, by Solomon. If the Lord does not build a house, then those who build it work in vain. If the Lord does not guard a city, then the watchman stands guard in vain."},{"p":2,"t":"It is vain for you to rise early, come home late, and work so hard for your food. Yes, he can provide for those whom he loves even when they sleep."},{"p":3,"t":"Yes, sons are a gift from the Lord, the fruit of the womb is a reward."},{"p":4,"t":"Sons born during one’s youth are like arrows in a warrior’s hand."},{"p":5,"t":"How blessed is the man who fills his quiver with them! They will not be put to shame when they confront enemies at the city gate."}],[{"p":1,"t":"A song of ascents. How blessed is every one of the Lord’s loyal followers, each one who keeps his commands!"},{"p":2,"t":"You will eat what you worked so hard to grow. You will be blessed and secure."},{"p":3,"t":"Your wife will be like a fruitful vine in the inner rooms of your house; your children will be like olive branches, as they sit all around your table."},{"p":4,"t":"Yes indeed, the man who fears the Lord will be blessed in this way."},{"p":5,"t":"May the Lord bless you from Zion, that you might see Jerusalem prosper all the days of your life,"},{"p":6,"t":"and that you might see your grandchildren. May Israel experience peace!"}],[{"p":1,"t":"A song of ascents. “Since my youth they have often attacked me,” let Israel say."},{"p":2,"t":"“Since my youth they have often attacked me, but they have not defeated me."},{"p":3,"t":"The plowers plowed my back; they made their furrows long."},{"p":4,"t":"The Lord is just; he cut the ropes of the wicked.”"},{"p":5,"t":"May all who hate Zion be humiliated and turned back!"},{"p":6,"t":"May they be like the grass on the rooftops which withers before one can even pull it up,"},{"p":7,"t":"which cannot fill the reaper’s hand, or the lap of the one who gathers the grain!"},{"p":8,"t":"Those who pass by will not say, “May you experience the Lord’s blessing! We pronounce a blessing on you in the name of the Lord.”"}],[{"p":1,"t":"A song of ascents. From the deep water I cry out to you, O Lord."},{"p":2,"t":"O Lord, listen to me! Pay attention to my plea for mercy!"},{"p":3,"t":"If you, O Lord, were to keep track of sins, O Lord, who could stand before you?"},{"p":4,"t":"But you are willing to forgive, so that you might be honored."},{"p":5,"t":"I rely on the Lord, I rely on him with my whole being; I wait for his assuring word."},{"p":6,"t":"I yearn for the Lord, more than watchmen do for the morning, yes, more than watchmen do for the morning."},{"p":7,"t":"O Israel, hope in the Lord, for the Lord exhibits loyal love, and is more than willing to deliver."},{"p":8,"t":"He will deliver Israel from all the consequences of their sins."}],[{"p":1,"t":"A song of ascents, by David. O Lord, my heart is not proud, nor do I have a haughty look. I do not have great aspirations, or concern myself with things that are beyond me."},{"p":2,"t":"Indeed I am composed and quiet, like a young child carried by its mother; I am content like the young child I carry."},{"p":3,"t":"O Israel, hope in the Lord now and forevermore!"}],[{"p":1,"t":"A song of ascents. O Lord, for David’s sake remember all his strenuous effort,"},{"p":2,"t":"and how he made a vow to the Lord, and swore an oath to the powerful ruler of Jacob."},{"p":3,"t":"He said, “I will not enter my own home, or get into my bed."},{"p":4,"t":"I will not allow my eyes to sleep, or my eyelids to slumber,"},{"p":5,"t":"until I find a place for the Lord, a fine dwelling place for the powerful ruler of Jacob.”"},{"p":6,"t":"Look, we heard about it in Ephrathah, we found it in the territory of Jaar."},{"p":7,"t":"Let us go to his dwelling place! Let us worship before his footstool!"},{"p":8,"t":"Ascend, O Lord, to your resting place, you and the ark of your strength!"},{"p":9,"t":"May your priests be clothed with integrity! May your loyal followers shout for joy!"},{"p":10,"t":"For the sake of David, your servant, do not reject your chosen king!"},{"p":11,"t":"The Lord made a reliable promise to David; he will not go back on his word. He said, “I will place one of your descendants on your throne."},{"p":12,"t":"If your sons keep my covenant and the rules I teach them, their sons will also sit on your throne forever.”"},{"p":13,"t":"Certainly the Lord has chosen Zion; he decided to make it his home."},{"p":14,"t":"He said, “This will be my resting place forever; I will live here, for I have chosen it."},{"p":15,"t":"I will abundantly supply what she needs; I will give her poor all the food they need."},{"p":16,"t":"I will protect her priests, and her godly people will shout exuberantly."},{"p":17,"t":"There I will make David strong; I have determined that my chosen king’s dynasty will continue."},{"p":18,"t":"I will humiliate his enemies, and his crown will shine."}],[{"p":1,"t":"A song of ascents, by David. Look! How good and how pleasant it is when brothers live together!"},{"p":2,"t":"It is like fine oil poured on the head which flows down the beard &#8211; Aaron’s beard, and then flows down his garments."},{"p":3,"t":"It is like the dew of Hermon, which flows down upon the hills of Zion. Indeed that is where the Lord has decreed a blessing will be available &#8211; eternal life."}],[{"p":1,"t":"A song of ascents. Attention! Praise the Lord, all you servants of the Lord, who serve in the Lord’s temple during the night."},{"p":2,"t":"Lift your hands toward the sanctuary and praise the Lord!"},{"p":3,"t":"May the Lord, the Creator of heaven and earth, bless you from Zion!"}],[{"p":1,"t":"Praise the Lord! Praise the name of the Lord! Offer praise, you servants of the Lord,"},{"p":2,"t":"who serve in the Lord’s temple, in the courts of the temple of our God."},{"p":3,"t":"Praise the Lord, for the Lord is good! Sing praises to his name, for it is pleasant!"},{"p":4,"t":"Indeed, the Lord has chosen Jacob for himself, Israel to be his special possession."},{"p":5,"t":"Yes, I know the Lord is great, and our Lord is superior to all gods."},{"p":6,"t":"He does whatever he pleases in heaven and on earth, in the seas and all the ocean depths."},{"p":7,"t":"He causes the clouds to arise from the end of the earth, makes lightning bolts accompany the rain, and brings the wind out of his storehouses."},{"p":8,"t":"He struck down the firstborn of Egypt, including both men and animals."},{"p":9,"t":"He performed awesome deeds and acts of judgment in your midst, O Egypt, against Pharaoh and all his servants."},{"p":10,"t":"He defeated many nations, and killed mighty kings &#8211;"},{"p":11,"t":"Sihon, king of the Amorites, and Og, king of Bashan, and all the kingdoms of Canaan."},{"p":12,"t":"He gave their land as an inheritance, as an inheritance to Israel his people."},{"p":13,"t":"O Lord, your name endures, your reputation, O Lord, lasts."},{"p":14,"t":"For the Lord vindicates his people, and has compassion on his servants."},{"p":15,"t":"The nations’ idols are made of silver and gold, they are man-made."},{"p":16,"t":"They have mouths, but cannot speak, eyes, but cannot see,"},{"p":17,"t":"and ears, but cannot hear. Indeed, they cannot breathe."},{"p":18,"t":"Those who make them will end up like them, as will everyone who trusts in them."},{"p":19,"t":"O family of Israel, praise the Lord! O family of Aaron, praise the Lord!"},{"p":20,"t":"O family of Levi, praise the Lord! You loyal followers of the Lord, praise the Lord!"},{"p":21,"t":"The Lord deserves praise in Zion &#8211; he who dwells in Jerusalem. Praise the Lord!"}],[{"p":1,"t":"Give thanks to the Lord, for he is good, for his loyal love endures."},{"p":2,"t":"Give thanks to the God of gods, for his loyal love endures."},{"p":3,"t":"Give thanks to the Lord of lords, for his loyal love endures,"},{"p":4,"t":"to the one who performs magnificent, amazing deeds all by himself, for his loyal love endures,"},{"p":5,"t":"to the one who used wisdom to make the heavens, for his loyal love endures,"},{"p":6,"t":"to the one who spread out the earth over the water, for his loyal love endures,"},{"p":7,"t":"to the one who made the great lights, for his loyal love endures,"},{"p":8,"t":"the sun to rule by day, for his loyal love endures,"},{"p":9,"t":"the moon and stars to rule by night, for his loyal love endures,"},{"p":10,"t":"to the one who struck down the firstborn of Egypt, for his loyal love endures,"},{"p":11,"t":"and led Israel out from their midst, for his loyal love endures,"},{"p":12,"t":"with a strong hand and an outstretched arm, for his loyal love endures,"},{"p":13,"t":"to the one who divided the Red Sea in two, for his loyal love endures,"},{"p":14,"t":"and led Israel through its midst, for his loyal love endures,"},{"p":15,"t":"and tossed Pharaoh and his army into the Red Sea, for his loyal love endures,"},{"p":16,"t":"to the one who led his people through the wilderness, for his loyal love endures,"},{"p":17,"t":"to the one who struck down great kings, for his loyal love endures,"},{"p":18,"t":"and killed powerful kings, for his loyal love endures,"},{"p":19,"t":"Sihon, king of the Amorites, for his loyal love endures,"},{"p":20,"t":"Og, king of Bashan, for his loyal love endures,"},{"p":21,"t":"and gave their land as an inheritance, for his loyal love endures,"},{"p":22,"t":"as an inheritance to Israel his servant, for his loyal love endures,"},{"p":23,"t":"to the one who remembered us when we were down, for his loyal love endures,"},{"p":24,"t":"and snatched us away from our enemies, for his loyal love endures,"},{"p":25,"t":"to the one who gives food to all living things, for his loyal love endures."},{"p":26,"t":"Give thanks to the God of heaven, for his loyal love endures!"}],[{"p":1,"t":"By the rivers of Babylon we sit down and weep when we remember Zion."},{"p":2,"t":"On the poplars in her midst we hang our harps,"},{"p":3,"t":"for there our captors ask us to compose songs; those who mock us demand that we be happy, saying: “Sing for us a song about Zion!”"},{"p":4,"t":"How can we sing a song to the Lord in a foreign land?"},{"p":5,"t":"If I forget you, O Jerusalem, may my right hand be crippled!"},{"p":6,"t":"May my tongue stick to the roof of my mouth, if I do not remember you, and do not give Jerusalem priority over whatever gives me the most joy."},{"p":7,"t":"Remember, O Lord, what the Edomites did on the day Jerusalem fell. They said, “Tear it down, tear it down, right to its very foundation!”"},{"p":8,"t":"O daughter Babylon, soon to be devastated! How blessed will be the one who repays you for what you dished out to us!"},{"p":9,"t":"How blessed will be the one who grabs your babies and smashes them on a rock!"}],[{"p":1,"t":"By David. I will give you thanks with all my heart; before the heavenly assembly I will sing praises to you."},{"p":2,"t":"I will bow down toward your holy temple, and give thanks to your name, because of your loyal love and faithfulness, for you have exalted your promise above the entire sky."},{"p":3,"t":"When I cried out for help, you answered me. You made me bold and energized me."},{"p":4,"t":"Let all the kings of the earth give thanks to you, O Lord, when they hear the words you speak."},{"p":5,"t":"Let them sing about the Lord’s deeds, for the Lord’s splendor is magnificent."},{"p":6,"t":"Though the Lord is exalted, he takes note of the lowly, and recognizes the proud from far away."},{"p":7,"t":"Even when I must walk in the midst of danger, you revive me. You oppose my angry enemies, and your right hand delivers me."},{"p":8,"t":"The Lord avenges me. O Lord, your loyal love endures. Do not abandon those whom you have made!"}],[{"p":1,"t":"For the music director, a psalm of David. O Lord, you examine me and know."},{"p":2,"t":"You know when I sit down and when I get up; even from far away you understand my motives."},{"p":3,"t":"You carefully observe me when I travel or when I lie down to rest; you are aware of everything I do."},{"p":4,"t":"Certainly my tongue does not frame a word without you, O Lord, being thoroughly aware of it."},{"p":5,"t":"You squeeze me in from behind and in front; you place your hand on me."},{"p":6,"t":"Your knowledge is beyond my comprehension; it is so far beyond me, I am unable to fathom it."},{"p":7,"t":"Where can I go to escape your spirit? Where can I flee to escape your presence?"},{"p":8,"t":"If I were to ascend to heaven, you would be there. If I were to sprawl out in Sheol, there you would be."},{"p":9,"t":"If I were to fly away on the wings of the dawn, and settle down on the other side of the sea,"},{"p":10,"t":"even there your hand would guide me, your right hand would grab hold of me."},{"p":11,"t":"If I were to say, “Certainly the darkness will cover me, and the light will turn to night all around me,”"},{"p":12,"t":"even the darkness is not too dark for you to see, and the night is as bright as day; darkness and light are the same to you."},{"p":13,"t":"Certainly you made my mind and heart; you wove me together in my mother’s womb."},{"p":14,"t":"I will give you thanks because your deeds are awesome and amazing. You knew me thoroughly;"},{"p":15,"t":"my bones were not hidden from you, when I was made in secret and sewed together in the depths of the earth."},{"p":16,"t":"Your eyes saw me when I was inside the womb. All the days ordained for me were recorded in your scroll before one of them came into existence."},{"p":17,"t":"How difficult it is for me to fathom your thoughts about me, O God! How vast is their sum total!"},{"p":18,"t":"If I tried to count them, they would outnumber the grains of sand. Even if I finished counting them, I would still have to contend with you."},{"p":19,"t":"If only you would kill the wicked, O God! Get away from me, you violent men!"},{"p":20,"t":"They rebel against you and act deceitfully; your enemies lie."},{"p":21,"t":"O Lord, do I not hate those who hate you, and despise those who oppose you?"},{"p":22,"t":"I absolutely hate them, they have become my enemies!"},{"p":23,"t":"Examine me, and probe my thoughts! Test me, and know my concerns!"},{"p":24,"t":"See if there is any idolatrous tendency in me, and lead me in the reliable ancient path!"}],[{"p":1,"t":"For the music director; a psalm of David. O Lord, rescue me from wicked men! Protect me from violent men,"},{"p":2,"t":"who plan ways to harm me. All day long they stir up conflict."},{"p":3,"t":"Their tongues wound like a serpent; a viper’s venom is behind their lips. (Selah)"},{"p":4,"t":"O Lord, shelter me from the power of the wicked! Protect me from violent men, who plan to knock me over."},{"p":5,"t":"Proud men hide a snare for me; evil men spread a net by the path; they set traps for me. (Selah)"},{"p":6,"t":"I say to the Lord, “You are my God.” O Lord, pay attention to my plea for mercy!"},{"p":7,"t":"O sovereign Lord, my strong deliverer, you shield my head in the day of battle."},{"p":8,"t":"O Lord, do not let the wicked have their way! Do not allow their plan to succeed when they attack! (Selah)"},{"p":9,"t":"As for the heads of those who surround me &#8211; may the harm done by their lips overwhelm them!"},{"p":10,"t":"May he rain down fiery coals upon them! May he throw them into the fire! From bottomless pits they will not escape."},{"p":11,"t":"A slanderer will not endure on the earth; calamity will hunt down a violent man and strike him down."},{"p":12,"t":"I know that the Lord defends the cause of the oppressed and vindicates the poor."},{"p":13,"t":"Certainly the godly will give thanks to your name; the morally upright will live in your presence."}],[{"p":1,"t":"A psalm of David. O Lord, I cry out to you. Come quickly to me! Pay attention to me when I cry out to you!"},{"p":2,"t":"May you accept my prayer like incense, my uplifted hands like the evening offering!"},{"p":3,"t":"O Lord, place a guard on my mouth! Protect the opening of my lips!"},{"p":4,"t":"Do not let me have evil desires, or participate in sinful activities with men who behave wickedly. I will not eat their delicacies."},{"p":5,"t":"May the godly strike me in love and correct me! May my head not refuse choice oil! Indeed, my prayer is a witness against their evil deeds."},{"p":6,"t":"They will be thrown down the side of a cliff by their judges. They will listen to my words, for they are pleasant."},{"p":7,"t":"As when one plows and breaks up the soil, so our bones are scattered at the mouth of Sheol."},{"p":8,"t":"Surely I am looking to you, O sovereign Lord. In you I take shelter. Do not expose me to danger!"},{"p":9,"t":"Protect me from the snare they have laid for me, and the traps the evildoers have set."},{"p":10,"t":"Let the wicked fall into their own nets, while I escape."}],[{"p":1,"t":"A well-written song by David, when he was in the cave; a prayer. To the Lord I cry out; to the Lord I plead for mercy."},{"p":2,"t":"I pour out my lament before him; I tell him about my troubles."},{"p":3,"t":"Even when my strength leaves me, you watch my footsteps. In the path where I walk they have hidden a trap for me."},{"p":4,"t":"Look to the right and see! No one cares about me. I have nowhere to run; no one is concerned about my life."},{"p":5,"t":"I cry out to you, O Lord; I say, “You are my shelter, my security in the land of the living.”"},{"p":6,"t":"Listen to my cry for help, for I am in serious trouble! Rescue me from those who chase me, for they are stronger than I am."},{"p":7,"t":"Free me from prison, that I may give thanks to your name. Because of me the godly will assemble, for you will vindicate me."}],[{"p":1,"t":"A psalm of David. O Lord, hear my prayer! Pay attention to my plea for help! Because of your faithfulness and justice, answer me!"},{"p":2,"t":"Do not sit in judgment on your servant, for no one alive is innocent before you."},{"p":3,"t":"Certainly my enemies chase me. They smash me into the ground. They force me to live in dark regions, like those who have been dead for ages."},{"p":4,"t":"My strength leaves me; I am absolutely shocked."},{"p":5,"t":"I recall the old days; I meditate on all you have done; I reflect on your accomplishments."},{"p":6,"t":"I spread my hands out to you in prayer; my soul thirsts for you in a parched land."},{"p":7,"t":"Answer me quickly, Lord! My strength is fading. Do not reject me, or I will join those descending into the grave."},{"p":8,"t":"May I hear about your loyal love in the morning, for I trust in you. Show me the way I should go, because I long for you."},{"p":9,"t":"Rescue me from my enemies, O Lord! I run to you for protection."},{"p":10,"t":"Teach me to do what pleases you, for you are my God. May your kind presence lead me into a level land."},{"p":11,"t":"O Lord, for the sake of your reputation, revive me! Because of your justice, rescue me from trouble!"},{"p":12,"t":"As a demonstration of your loyal love, destroy my enemies! Annihilate all who threaten my life, for I am your servant."}],[{"p":1,"t":"By David. The Lord, my protector, deserves praise &#8211; the one who trains my hands for battle, and my fingers for war,"},{"p":2,"t":"who loves me and is my stronghold, my refuge and my deliverer, my shield and the one in whom I take shelter, who makes nations submit to me."},{"p":3,"t":"O Lord, of what importance is the human race, that you should notice them? Of what importance is mankind, that you should be concerned about them?"},{"p":4,"t":"People are like a vapor, their days like a shadow that disappears."},{"p":5,"t":"O Lord, make the sky sink and come down! Touch the mountains and make them smolder!"},{"p":6,"t":"Hurl lightning bolts and scatter them! Shoot your arrows and rout them!"},{"p":7,"t":"Reach down from above! Grab me and rescue me from the surging water, from the power of foreigners,"},{"p":8,"t":"who speak lies, and make false promises."},{"p":9,"t":"O God, I will sing a new song to you! Accompanied by a ten-stringed instrument, I will sing praises to you,"},{"p":10,"t":"the one who delivers kings, and rescued David his servant from a deadly sword."},{"p":11,"t":"Grab me and rescue me from the power of foreigners, who speak lies, and make false promises."},{"p":12,"t":"Then our sons will be like plants, that quickly grow to full size. Our daughters will be like corner pillars, carved like those in a palace."},{"p":13,"t":"Our storehouses will be full, providing all kinds of food. Our sheep will multiply by the thousands and fill our pastures."},{"p":14,"t":"Our cattle will be weighted down with produce. No one will break through our walls, no one will be taken captive, and there will be no terrified cries in our city squares."},{"p":15,"t":"How blessed are the people who experience these things! How blessed are the people whose God is the Lord!"}],[{"p":1,"t":"A psalm of praise, by David. I will extol you, my God, O king! I will praise your name continually!"},{"p":2,"t":"Every day I will praise you! I will praise your name continually!"},{"p":3,"t":"The Lord is great and certainly worthy of praise! No one can fathom his greatness!"},{"p":4,"t":"One generation will praise your deeds to another, and tell about your mighty acts!"},{"p":5,"t":"I will focus on your honor and majestic splendor, and your amazing deeds!"},{"p":6,"t":"They will proclaim the power of your awesome acts! I will declare your great deeds!"},{"p":7,"t":"They will talk about the fame of your great kindness, and sing about your justice."},{"p":8,"t":"The Lord is merciful and compassionate; he is patient and demonstrates great loyal love."},{"p":9,"t":"The Lord is good to all, and has compassion on all he has made."},{"p":10,"t":"All he has made will give thanks to the Lord. Your loyal followers will praise you."},{"p":11,"t":"They will proclaim the splendor of your kingdom; they will tell about your power,"},{"p":12,"t":"so that mankind might acknowledge your mighty acts, and the majestic splendor of your kingdom."},{"p":13,"t":"Your kingdom is an eternal kingdom, and your dominion endures through all generations."},{"p":14,"t":"The Lord supports all who fall, and lifts up all who are bent over."},{"p":15,"t":"Everything looks to you in anticipation, and you provide them with food on a regular basis."},{"p":16,"t":"You open your hand, and fill every living thing with the food they desire."},{"p":17,"t":"The Lord is just in all his actions, and exhibits love in all he does."},{"p":18,"t":"The Lord is near all who cry out to him, all who cry out to him sincerely."},{"p":19,"t":"He satisfies the desire of his loyal followers; he hears their cry for help and delivers them."},{"p":20,"t":"The Lord protects those who love him, but he destroys all the wicked."},{"p":21,"t":"My mouth will praise the Lord. Let all who live praise his holy name forever!"}],[{"p":1,"t":"Praise the Lord! Praise the Lord, O my soul!"},{"p":2,"t":"I will praise the Lord as long as I live! I will sing praises to my God as long as I exist!"},{"p":3,"t":"Do not trust in princes, or in human beings, who cannot deliver!"},{"p":4,"t":"Their life’s breath departs, they return to the ground; on that day their plans die."},{"p":5,"t":"How blessed is the one whose helper is the God of Jacob, whose hope is in the Lord his God,"},{"p":6,"t":"the one who made heaven and earth, the sea, and all that is in them, who remains forever faithful,"},{"p":7,"t":"vindicates the oppressed, and gives food to the hungry. The Lord releases the imprisoned."},{"p":8,"t":"The Lord gives sight to the blind. The Lord lifts up all who are bent over. The Lord loves the godly."},{"p":9,"t":"The Lord protects those residing outside their native land; he lifts up the fatherless and the widow, but he opposes the wicked."},{"p":10,"t":"The Lord rules forever, your God, O Zion, throughout the generations to come! Praise the Lord!"}],[{"p":1,"t":"Praise the Lord, for it is good to sing praises to our God! Yes, praise is pleasant and appropriate!"},{"p":2,"t":"The Lord rebuilds Jerusalem, and gathers the exiles of Israel."},{"p":3,"t":"He heals the brokenhearted, and bandages their wounds."},{"p":4,"t":"He counts the number of the stars; he names all of them."},{"p":5,"t":"Our Lord is great and has awesome power; there is no limit to his wisdom."},{"p":6,"t":"The Lord lifts up the oppressed, but knocks the wicked to the ground."},{"p":7,"t":"Offer to the Lord a song of thanks! Sing praises to our God to the accompaniment of a harp!"},{"p":8,"t":"He covers the sky with clouds, provides the earth with rain, and causes grass to grow on the hillsides."},{"p":9,"t":"He gives food to the animals, and to the young ravens when they chirp."},{"p":10,"t":"He is not enamored with the strength of a horse, nor is he impressed by the warrior’s strong legs."},{"p":11,"t":"The Lord takes delight in his faithful followers, and in those who wait for his loyal love."},{"p":12,"t":"Extol the Lord, O Jerusalem! Praise your God, O Zion!"},{"p":13,"t":"For he makes the bars of your gates strong. He blesses your children within you."},{"p":14,"t":"He brings peace to your territory. He abundantly provides for you the best grain."},{"p":15,"t":"He sends his command through the earth; swiftly his order reaches its destination."},{"p":16,"t":"He sends the snow that is white like wool; he spreads the frost that is white like ashes."},{"p":17,"t":"He throws his hailstones like crumbs. Who can withstand the cold wind he sends?"},{"p":18,"t":"He then orders it all to melt; he breathes on it, and the water flows."},{"p":19,"t":"He proclaims his word to Jacob, his statutes and regulations to Israel."},{"p":20,"t":"He has not done so with any other nation; they are not aware of his regulations. Praise the Lord!"}],[{"p":1,"t":"Praise the Lord! Praise the Lord from the sky! Praise him in the heavens!"},{"p":2,"t":"Praise him, all his angels! Praise him, all his heavenly assembly!"},{"p":3,"t":"Praise him, O sun and moon! Praise him, all you shiny stars!"},{"p":4,"t":"Praise him, O highest heaven, and you waters above the sky!"},{"p":5,"t":"Let them praise the name of the Lord, for he gave the command and they came into existence."},{"p":6,"t":"He established them so they would endure; he issued a decree that will not be revoked."},{"p":7,"t":"Praise the Lord from the earth, you sea creatures and all you ocean depths,"},{"p":8,"t":"O fire and hail, snow and clouds, O stormy wind that carries out his orders,"},{"p":9,"t":"you mountains and all you hills, you fruit trees and all you cedars,"},{"p":10,"t":"you animals and all you cattle, you creeping things and birds,"},{"p":11,"t":"you kings of the earth and all you nations, you princes and all you leaders on the earth,"},{"p":12,"t":"you young men and young women, you elderly, along with you children!"},{"p":13,"t":"Let them praise the name of the Lord, for his name alone is exalted; his majesty extends over the earth and sky."},{"p":14,"t":"He has made his people victorious, and given all his loyal followers reason to praise &#8211; the Israelites, the people who are close to him. Praise the Lord!"}],[{"p":1,"t":"Praise the Lord! Sing to the Lord a new song! Praise him in the assembly of the godly!"},{"p":2,"t":"Let Israel rejoice in their Creator! Let the people of Zion delight in their king!"},{"p":3,"t":"Let them praise his name with dancing! Let them sing praises to him to the accompaniment of the tambourine and harp!"},{"p":4,"t":"For the Lord takes delight in his people; he exalts the oppressed by delivering them."},{"p":5,"t":"Let the godly rejoice because of their vindication! Let them shout for joy upon their beds!"},{"p":6,"t":"May they praise God while they hold a two-edged sword in their hand,"},{"p":7,"t":"in order to take revenge on the nations, and punish foreigners."},{"p":8,"t":"They bind their kings in chains, and their nobles in iron shackles,"},{"p":9,"t":"and execute the judgment to which their enemies have been sentenced. All his loyal followers will be vindicated. Praise the Lord!"}],[{"p":1,"t":"Praise the Lord! Praise God in his sanctuary! Praise him in the sky, which testifies to his strength!"},{"p":2,"t":"Praise him for his mighty acts! Praise him for his surpassing greatness!"},{"p":3,"t":"Praise him with the blast of the horn! Praise him with the lyre and the harp!"},{"p":4,"t":"Praise him with the tambourine and with dancing! Praise him with stringed instruments and the flute!"},{"p":5,"t":"Praise him with loud cymbals! Praise him with clanging cymbals!"},{"p":6,"t":"Let everything that has breath praise the Lord! Praise the Lord!"}]]